{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA10_c",
   "name" : "char [10]",
   "referenced_type" : "type-134",
   "self_type" : "type-428",
   "size" : 10,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_modf.c"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_d",
   "name" : "double [10]",
   "referenced_type" : "type-15",
   "self_type" : "type-812",
   "size" : 80,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "type-1",
   "self_type" : "type-2",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA11_d",
   "name" : "double [11]",
   "referenced_type" : "type-15",
   "self_type" : "type-804",
   "size" : 88,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_N12pow_log_dataUt_E",
   "name" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3) [128]",
   "referenced_type" : "type-819",
   "self_type" : "type-818",
   "size" : 4096,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_N8log_dataUt_E",

   "self_type" : "type-825",
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10exp2f_data",
   "name" : "const exp2f_data",
   "referenced_type" : "type-807",
   "self_type" : "type-826",
   "size" : 328,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10log2f_data",
   "name" : "const log2f_data",
   "referenced_type" : "type-790",
   "self_type" : "type-794",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12pow_log_data",
   "name" : "const pow_log_data",
   "referenced_type" : "type-816",
   "self_type" : "type-820",
   "size" : 4168,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14powf_log2_data",
   "name" : "const powf_log2_data",
   "referenced_type" : "type-795",
   "self_type" : "type-799",
   "size" : 296,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6fenv_t",
   "name" : "const fenv_t",
   "referenced_type" : "type-131",
   "self_type" : "type-135",
   "size" : 28,
   "source_file" : "/bionic/libc/include/fenv.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8exp_data",
   "name" : "const exp_data",
   "referenced_type" : "type-800",
   "self_type" : "type-802",
   "size" : 2160,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8log_data",
   "name" : "const log_data",
   "referenced_type" : "type-803",
   "self_type" : "type-809",
   "size" : 4240,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9log2_data",
   "name" : "const log2_data",
   "referenced_type" : "type-810",
   "self_type" : "type-815",
   "size" : 2192,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9logf_data",
   "name" : "const logf_data",
   "referenced_type" : "type-788",
   "self_type" : "type-787",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "type-134",
   "self_type" : "type-475",
   "size" : 1,
   "source_file" : "/bionic/libc/include/math.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "type-15",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/bsdsrc/b_exp.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "type-8",
   "self_type" : "type-430",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-netbsd/lib/libm/complex/cephes_subrl.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "type-4",
   "self_type" : "type-45",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrigf.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "type-10",
   "self_type" : "type-110",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_exp.c"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "type-132",
   "self_type" : "type-433",
   "size" : 2,
   "source_file" : "/bionic/libc/include/fenv.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVKd",
   "name" : "const volatile double",
   "referenced_type" : "type-15",
   "self_type" : "type-42",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrig.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVKf",
   "name" : "const volatile float",
   "referenced_type" : "type-4",
   "self_type" : "type-43",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrig.c"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVf",
   "name" : "volatile float",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_acosf.c"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-128"
    }
   ],
   "linker_set_key" : "_ZTI10IEEEd2bits",
   "name" : "IEEEd2bits",
   "record_kind" : "union",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-126"
    }
   ],
   "linker_set_key" : "_ZTI10IEEEf2bits",
   "name" : "IEEEf2bits",
   "record_kind" : "union",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-808"
    },
    {
     "field_name" : "shift_scaled",
     "field_offset" : 2048,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-789"
    },
    {
     "field_name" : "shift",
     "field_offset" : 2304,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "invln2_scaled",
     "field_offset" : 2368,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "poly_scaled",
     "field_offset" : 2432,
     "referenced_type" : "type-789"
    }
   ],
   "linker_set_key" : "_ZTI10exp2f_data",
   "name" : "exp2f_data",
   "referenced_type" : "type-807",
   "self_type" : "type-807",
   "size" : 328,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-791"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-793"
    }
   ],
   "linker_set_key" : "_ZTI10log2f_data",
   "name" : "log2f_data",
   "referenced_type" : "type-790",
   "self_type" : "type-790",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-431",
   "self_type" : "type-431",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.7/include/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-817"
    },
    {
     "field_name" : "tab",
     "field_offset" : 576,
     "referenced_type" : "type-818"
    }
   ],
   "linker_set_key" : "_ZTI12pow_log_data",
   "name" : "pow_log_data",
   "referenced_type" : "type-816",
   "self_type" : "type-816",
   "size" : 4168,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "_ZTI13float_complex",
   "name" : "float_complex",
   "record_kind" : "union",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "_ZTI14double_complex",
   "name" : "double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-796"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "_ZTI14powf_log2_data",
   "name" : "powf_log2_data",
   "referenced_type" : "type-795",
   "self_type" : "type-795",
   "size" : 296,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 24,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "_ZTI19long_double_complex",
   "name" : "long_double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "parts32",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "parts64",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "_ZTI20ieee_quad_shape_type",
   "name" : "ieee_quad_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "word",
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "_ZTI21ieee_float_shape_type",
   "name" : "ieee_float_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "parts",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "xparts",
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "_ZTI22ieee_double_shape_type",
   "name" : "ieee_double_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hi",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "lo",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "_ZTI2dd",
   "name" : "dd",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_fma.c"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "_ZTI6Double",
   "name" : "Double",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/bsdsrc/mathimpl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__control",
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "__mxcsr_hi",
     "field_offset" : 16,
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "__status",
     "field_offset" : 32,
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "__mxcsr_lo",
     "field_offset" : 48,
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "__tag",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "__other",
     "field_offset" : 96,
     "referenced_type" : "type-133"
    }
   ],
   "linker_set_key" : "_ZTI6fenv_t",
   "name" : "fenv_t",
   "referenced_type" : "type-131",
   "self_type" : "type-131",
   "size" : 28,
   "source_file" : "/bionic/libc/include/bits/fenv_x86.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invln2N",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "shift",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "negln2hiN",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "negln2loN",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "poly",
     "field_offset" : 256,
     "referenced_type" : "type-793"
    },
    {
     "field_name" : "exp2_shift",
     "field_offset" : 512,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "exp2_poly",
     "field_offset" : 576,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "tab",
     "field_offset" : 896,
     "referenced_type" : "type-801"
    }
   ],
   "linker_set_key" : "_ZTI8exp_data",
   "name" : "exp_data",
   "referenced_type" : "type-800",
   "self_type" : "type-800",
   "size" : 2160,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 448,
     "referenced_type" : "type-804"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-805"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 17536,
     "referenced_type" : "type-805"
    }
   ],
   "linker_set_key" : "_ZTI8log_data",
   "name" : "log_data",
   "referenced_type" : "type-803",
   "self_type" : "type-803",
   "size" : 4240,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign",
     "referenced_type" : "type-793"
    },
    {
     "field_name" : "hpi_inv",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "hpi",
     "field_offset" : 320,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "c0",
     "field_offset" : 384,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "c1",
     "field_offset" : 448,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "c2",
     "field_offset" : 512,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "c3",
     "field_offset" : 576,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "c4",
     "field_offset" : 640,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "s1",
     "field_offset" : 704,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "s2",
     "field_offset" : 768,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "s3",
     "field_offset" : 832,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "_ZTI8sincos_t",
   "name" : "sincos_t",
   "referenced_type" : "type-821",
   "self_type" : "type-821",
   "size" : 112,
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invln2hi",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "invln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 512,
     "referenced_type" : "type-812"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-813"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 9344,
     "referenced_type" : "type-813"
    }
   ],
   "linker_set_key" : "_ZTI9log2_data",
   "name" : "log2_data",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 2192,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-786"
    },
    {
     "field_name" : "ln2",
     "field_offset" : 2048,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-789"
    }
   ],
   "linker_set_key" : "_ZTI9logf_data",
   "name" : "logf_data",
   "referenced_type" : "type-788",
   "self_type" : "type-788",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "manh",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "exp",
     "field_offset" : 52,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sign",
     "field_offset" : 63,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10IEEEd2bitsUt_E",
   "name" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3)",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "man",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "exp",
     "field_offset" : 23,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sign",
     "field_offset" : 31,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10IEEEf2bitsUt_E",
   "name" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3)",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10log2f_dataUt_E",
   "name" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3)",
   "referenced_type" : "type-792",
   "self_type" : "type-792",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "pad",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "logc",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "logctail",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12pow_log_dataUt_E",
   "name" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3)",
   "referenced_type" : "type-819",
   "self_type" : "type-819",
   "size" : 32,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14powf_log2_dataUt_E",
   "name" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3)",
   "referenced_type" : "type-797",
   "self_type" : "type-797",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "msw",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN20ieee_quad_shape_typeUt_E",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3)",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lswlo",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "lswhi",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "mswlo",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "mswhi",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN20ieee_quad_shape_typeUt_E",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3)",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "msw",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN22ieee_double_shape_typeUt_E",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3)",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "w",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN22ieee_double_shape_typeUt_E",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3)",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8log_dataUt_E",
   "name" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3)",
   "referenced_type" : "type-806",
   "self_type" : "type-806",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9log2_dataUt_E",
   "name" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3)",
   "referenced_type" : "type-814",
   "self_type" : "type-814",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9logf_dataUt_E",
   "name" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3)",
   "referenced_type" : "type-785",
   "self_type" : "type-785",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  }
 ],
 "rvalue_reference_types" : []
}
