{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "unsigned short [8]",
   "name" : "unsigned short [8]",
   "referenced_type" : "type-10",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [32]",
   "name" : "unsigned int [32]",
   "referenced_type" : "type-12",
   "self_type" : "type-651",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [4]",
   "name" : "unsigned int [4]",
   "referenced_type" : "type-12",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [5]",
   "name" : "unsigned int [5]",
   "referenced_type" : "type-12",
   "self_type" : "type-684",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [13]",
   "name" : "unsigned int [13]",
   "referenced_type" : "type-12",
   "self_type" : "type-643",
   "size" : 52,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [29]",
   "name" : "int [29]",
   "referenced_type" : "type-15",
   "self_type" : "type-401",
   "size" : 116,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h"
  },
  {

   "linker_set_key" : "const class std::__1::uniform_int_distribution::param_type",
   "name" : "const class std::__1::uniform_int_distribution::param_type",
   "referenced_type" : "type-604",
   "self_type" : "type-603",
   "source_file" : "/external/libcxx/include/algorithm"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const uniform_int_distribution<_IntType>",
   "name" : "const uniform_int_distribution<_IntType>",
   "referenced_type" : "type-607",
   "self_type" : "type-606",
   "source_file" : "/external/libcxx/include/algorithm"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_x86",
   "name" : "const libunwind::Registers_x86",
   "referenced_type" : "type-614",
   "self_type" : "type-698",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_x86_64",
   "name" : "const libunwind::Registers_x86_64",
   "referenced_type" : "type-619",
   "self_type" : "type-701",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_ppc",
   "name" : "const libunwind::Registers_ppc",
   "referenced_type" : "type-624",
   "self_type" : "type-705",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_arm64",
   "name" : "const libunwind::Registers_arm64",
   "referenced_type" : "type-634",
   "self_type" : "type-708",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_arm",
   "name" : "const libunwind::Registers_arm",
   "referenced_type" : "type-641",
   "self_type" : "type-712",
   "size" : 336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_or1k",
   "name" : "const libunwind::Registers_or1k",
   "referenced_type" : "type-649",
   "self_type" : "type-715",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_mips_o32",
   "name" : "const libunwind::Registers_mips_o32",
   "referenced_type" : "type-656",
   "self_type" : "type-720",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const libunwind::Registers_mips_n64",
   "name" : "const libunwind::Registers_mips_n64",
   "referenced_type" : "type-663",
   "self_type" : "type-723",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const addrinfo",
   "name" : "const addrinfo",
   "referenced_type" : "type-672",
   "self_type" : "type-874",
   "size" : 32,
   "source_file" : "/frameworks/native/include/android/multinetwork.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "type-727",
   "self_type" : "type-769",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const elf32_phdr",
   "name" : "const elf32_phdr",
   "referenced_type" : "type-741",
   "self_type" : "type-772",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned int, const void *)",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "type-780",
   "self_type" : "type-802",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-813",
   "self_type" : "type-830",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-836",
   "self_type" : "type-847",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-8",
   "self_type" : "type-188",
   "size" : 1,
   "source_file" : "/bionic/libc/dns/include/resolv_netid.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long>",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "type-100",
   "self_type" : "type-100",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofImEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "addr",
     "field_offset" : 16,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "ipv6_destopt_hao",
   "name" : "ipv6_destopt_hao",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 18,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ipv6_destopt_hao"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long long>",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned int, 8>",
   "name" : "std::integral_constant<unsigned int, 8>",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIjLj8EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::alignment_of<double>",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-48" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::alignment_of<long double>",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "type-106",
   "self_type" : "type-106",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double>",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-108" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "std::__struct_double",
   "name" : "std::__struct_double",
   "referenced_type" : "type-108",
   "self_type" : "type-108",
   "size" : 8,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115__struct_doubleE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double4>",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_16__struct_double4EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-111"
    }
   ],
   "linker_set_key" : "std::__struct_double4",
   "name" : "std::__struct_double4",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 32,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__116__struct_double4E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "priority",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "version",
     "field_offset" : 4,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flow_lbl",
     "field_offset" : 8,
     "referenced_type" : "type-113"
    },
    {
     "field_name" : "payload_len",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "nexthdr",
     "field_offset" : 48,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hop_limit",
     "field_offset" : 56,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "saddr",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "daddr",
     "field_offset" : 192,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "ipv6hdr",
   "name" : "ipv6hdr",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 40,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ipv6hdr"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "std::alignment_of<int *>",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIPiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat> > > > >",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat> > > > >",
   "referenced_type" : "type-116",
   "self_type" : "type-116",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-117", "type-118" ],
   "unique_id" : "_ZTSNSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat> > > > >",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat> > > > >",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-8", "type-121" ],
   "unique_id" : "_ZTSNSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__nat",
   "name" : "std::__nat",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__natE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned char>",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned short>",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__112__align_typeItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned int>",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long>",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112__align_typeImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long long>",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "type-127",
   "self_type" : "type-127",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<double>",
   "name" : "std::__align_type<double>",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-48" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<long double>",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIeEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin6_family",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sin6_port",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sin6_flowinfo",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sin6_addr",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "sin6_scope_id",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "sockaddr_in6",
   "name" : "sockaddr_in6",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 28,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "sockaddr_in6"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double>",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-108" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double4>",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "type-131",
   "self_type" : "type-131",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_16__struct_double4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<int *>",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-115" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIPiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 12>",
   "referenced_type" : "type-133",
   "self_type" : "type-133",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-134" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 12>",
   "referenced_type" : "type-136",
   "self_type" : "type-136",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-137" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 12>",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-139" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipv6mr_multiaddr",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "ipv6mr_ifindex",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "ipv6_mreq",
   "name" : "ipv6_mreq",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "ipv6_mreq"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 12>",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-141" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 12>",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-143" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sample_validity",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "success_threshold",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "min_samples",
     "field_offset" : 24,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "max_samples",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "base_timeout_msec",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "__res_params",
   "name" : "__res_params",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 12,
   "source_file" : "/bionic/libc/dns/include/resolv_params.h",
   "unique_id" : "__res_params"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 12>",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 12>",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 12>",
   "referenced_type" : "type-149",
   "self_type" : "type-149",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-150" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 12>",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-152" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 12>",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-154" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELj12EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 8, 4>",
   "name" : "std::__select_align<12, 8, 4>",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj8ELj4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 8, 8>",
   "name" : "std::__select_align<12, 8, 8>",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj8ELj8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 4, 8>",
   "name" : "std::__select_align<12, 4, 8>",
   "referenced_type" : "type-157",
   "self_type" : "type-157",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj4ELj8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 2, 8>",
   "name" : "std::__select_align<12, 2, 8>",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj2ELj8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 1, 8>",
   "name" : "std::__select_align<12, 1, 8>",
   "referenced_type" : "type-159",
   "self_type" : "type-159",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj1ELj8EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flr_dst",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "flr_label",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flr_action",
     "field_offset" : 160,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flr_share",
     "field_offset" : 168,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "flr_flags",
     "field_offset" : 176,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "flr_expires",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "flr_linger",
     "field_offset" : 208,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "__flr_pad",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "in6_flowlabel_req",
   "name" : "in6_flowlabel_req",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "in6_flowlabel_req"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::aligned_storage<12, 8>",
   "name" : "std::aligned_storage<12, 8>",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILj12ELj8EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "std::aligned_storage<12, 8>::type",
   "name" : "std::aligned_storage<12, 8>::type",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 16,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILj12ELj8EE4typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__numeric_type<void>",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__114__numeric_typeIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<bool, true>",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<short, true>",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "type-166",
   "self_type" : "type-166",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-167" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned short, true>",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__113__make_signedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<int, true>",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIiLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_addr",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "in_addr",
   "name" : "in_addr",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/in_addr.h",
   "unique_id" : "in_addr"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned int, true>",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long, true>",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-172" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long, true>",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "type-173",
   "self_type" : "type-173",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__113__make_signedImLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_ip",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "end_ip",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lsda",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "handler",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gp",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unwind_info_size",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unwind_info",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "extra",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unw_proc_info_t",
   "name" : "unw_proc_info_t",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS15unw_proc_info_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long long, true>",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "type-176",
   "self_type" : "type-176",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long long, true>",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIyLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "app_netid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "app_mark",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "dns_netid",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "dns_mark",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "uid",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "qhook",
     "field_offset" : 192,
     "referenced_type" : "type-179"
    }
   ],
   "linker_set_key" : "android_net_context",
   "name" : "android_net_context",
   "referenced_type" : "type-178",
   "self_type" : "type-178",
   "size" : 28,
   "source_file" : "/bionic/libc/dns/include/resolv_netid.h",
   "unique_id" : "android_net_context"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imsf_multiaddr",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imsf_interface",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imsf_fmode",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "imsf_numsrc",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "imsf_slist",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "ip_msfilter",
   "name" : "ip_msfilter",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 20,
   "source_file" : "/bionic/libc/include/bits/ip_msfilter.h",
   "unique_id" : "ip_msfilter"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "sa_family",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sa_data",
     "field_offset" : 16,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "sockaddr",
   "name" : "sockaddr",
   "referenced_type" : "type-184",
   "self_type" : "type-184",
   "size" : 16,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "sockaddr"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<bool, true>",
   "name" : "std::__make_unsigned<bool, true>",
   "referenced_type" : "type-190",
   "self_type" : "type-190",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<short, true>",
   "name" : "std::__make_unsigned<short, true>",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-167" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned short, true>",
   "name" : "std::__make_unsigned<unsigned short, true>",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<int, true>",
   "name" : "std::__make_unsigned<int, true>",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned int, true>",
   "name" : "std::__make_unsigned<unsigned int, true>",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long, true>",
   "name" : "std::__make_unsigned<long, true>",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-172" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long, true>",
   "name" : "std::__make_unsigned<unsigned long, true>",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long long, true>",
   "name" : "std::__make_unsigned<long long, true>",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long long, true>",
   "name" : "std::__make_unsigned<unsigned long long, true>",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIyLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::is_destructible<void>",
   "name" : "std::is_destructible<void>",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__115is_destructibleIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imr_sourceaddr",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "ip_mreq_source",
   "name" : "ip_mreq_source",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 12,
   "source_file" : "/bionic/libc/include/bits/ip_mreq_source.h",
   "unique_id" : "ip_mreq_source"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_construct::__nat",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__is_construct5__natE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_fail_tag",
   "name" : "std::__extract_key_fail_tag",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_fail_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_self_tag",
   "name" : "std::__extract_key_self_tag",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_self_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_first_tag",
   "name" : "std::__extract_key_first_tag",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__extract_key_first_tagE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "std::exception",
   "name" : "std::exception",
   "record_kind" : "class",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 4,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt9exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "std::bad_exception",
   "name" : "std::bad_exception",
   "record_kind" : "class",
   "referenced_type" : "type-206",
   "self_type" : "type-206",
   "size" : 4,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt13bad_exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13bad_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13bad_exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "std::exception_ptr",
   "name" : "std::exception_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-208",
   "self_type" : "type-208",
   "size" : 4,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt13exception_ptr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "ip_mreq",
   "name" : "ip_mreq",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "ip_mreq"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "field_offset" : 32,
     "referenced_type" : "type-208"
    }
   ],
   "linker_set_key" : "std::nested_exception",
   "name" : "std::nested_exception",
   "record_kind" : "class",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 8,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt16nested_exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16nested_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::nothrow_t",
   "name" : "std::nothrow_t",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 1,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt9nothrow_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imr_address",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "imr_ifindex",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "ip_mreqn",
   "name" : "ip_mreqn",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "ip_mreqn"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "std::bad_alloc",
   "name" : "std::bad_alloc",
   "record_kind" : "class",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 4,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt9bad_alloc",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9bad_alloc"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9bad_alloc4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "std::bad_array_new_length",
   "name" : "std::bad_array_new_length",
   "record_kind" : "class",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 4,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt20bad_array_new_length",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt20bad_array_new_length"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt20bad_array_new_length4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-221"
    }
   ],
   "linker_set_key" : "std::bad_array_length",
   "name" : "std::bad_array_length",
   "record_kind" : "class",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 4,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt16bad_array_length",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16bad_array_length"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16bad_array_lengthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16bad_array_lengthD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt16bad_array_length4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gr_interface",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gr_group",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "group_req",
   "name" : "group_req",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 132,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "group_req"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_indices<>",
   "name" : "std::__tuple_indices<>",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__115__tuple_indicesIJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__integer_sequence<unsigned int>",
   "name" : "std::__integer_sequence<unsigned int>",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__118__integer_sequenceIjJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_tuple_indices<0, 0>",
   "name" : "std::__make_tuple_indices<0, 0>",
   "referenced_type" : "type-236",
   "self_type" : "type-236",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__make_tuple_indicesILj0ELj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_types<>",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_typesIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, false>",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, false>",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb0EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_family",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "__data",
     "field_offset" : 16,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "sockaddr_storage",
   "name" : "sockaddr_storage",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/socket.h",
   "unique_id" : "sockaddr_storage"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, true>",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, true>",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, false>",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, false>",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, true>",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, true>",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_sfinae_base",
   "name" : "std::__tuple_sfinae_base",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__119__tuple_sfinae_baseE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__check_tuple_constructor_fail",
   "name" : "std::__check_tuple_constructor_fail",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__130__check_tuple_constructor_failE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__file_",
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "__line_",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "__pred_",
     "field_offset" : 64,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "__msg_",
     "field_offset" : 96,
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "std::__libcpp_debug_info",
   "name" : "std::__libcpp_debug_info",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__debug",
   "unique_id" : "_ZTSNSt3__119__libcpp_debug_infoE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::piecewise_construct_t",
   "name" : "std::piecewise_construct_t",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__121piecewise_construct_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<0>",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<1>",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "type-257",
   "self_type" : "type-257",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILj1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<std::_PairT, unsigned int>",
   "name" : "std::unary_function<std::_PairT, unsigned int>",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-259", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionINS_6_PairTEjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "second",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "std::_PairT",
   "name" : "std::_PairT",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 8,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__16_PairTE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<bool, unsigned int>",
   "name" : "std::unary_function<bool, unsigned int>",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-43", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIbjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char, unsigned int>",
   "name" : "std::unary_function<char, unsigned int>",
   "referenced_type" : "type-261",
   "self_type" : "type-261",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-26", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIcjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<signed char, unsigned int>",
   "name" : "std::unary_function<signed char, unsigned int>",
   "referenced_type" : "type-262",
   "self_type" : "type-262",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-117", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIajEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned char, unsigned int>",
   "name" : "std::unary_function<unsigned char, unsigned int>",
   "referenced_type" : "type-263",
   "self_type" : "type-263",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-8", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIhjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char16_t, unsigned int>",
   "name" : "std::unary_function<char16_t, unsigned int>",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-265", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDsjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char32_t, unsigned int>",
   "name" : "std::unary_function<char32_t, unsigned int>",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-269", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDijEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gsr_interface",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gsr_group",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "gsr_source",
     "field_offset" : 1056,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "group_source_req",
   "name" : "group_source_req",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 260,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "group_source_req"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<wchar_t, unsigned int>",
   "name" : "std::unary_function<wchar_t, unsigned int>",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-271", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIwjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<short, unsigned int>",
   "name" : "std::unary_function<short, unsigned int>",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-167", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIsjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned short, unsigned int>",
   "name" : "std::unary_function<unsigned short, unsigned int>",
   "referenced_type" : "type-273",
   "self_type" : "type-273",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-10", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionItjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<int, unsigned int>",
   "name" : "std::unary_function<int, unsigned int>",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-15", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIijEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned int, unsigned int>",
   "name" : "std::unary_function<unsigned int, unsigned int>",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-12", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long, unsigned int>",
   "name" : "std::unary_function<long, unsigned int>",
   "referenced_type" : "type-276",
   "self_type" : "type-276",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-172", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIljEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long, unsigned int>",
   "name" : "std::unary_function<unsigned long, unsigned int>",
   "referenced_type" : "type-277",
   "self_type" : "type-277",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionImjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long long, unsigned int>",
   "name" : "std::unary_function<long long, unsigned int>",
   "referenced_type" : "type-278",
   "self_type" : "type-278",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIxjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long long, unsigned int>",
   "name" : "std::unary_function<unsigned long long, unsigned int>",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-71", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIyjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gf_interface",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gf_group",
     "field_offset" : 32,
     "referenced_type" : "type-24"
    },
    {
     "field_name" : "gf_fmode",
     "field_offset" : 1056,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gf_numsrc",
     "field_offset" : 1088,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gf_slist",
     "field_offset" : 1120,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "group_filter",
   "name" : "group_filter",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 268,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "group_filter"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<float, unsigned int>",
   "name" : "std::unary_function<float, unsigned int>",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-46", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIfjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<double, unsigned int>",
   "name" : "std::unary_function<double, unsigned int>",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-48", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIdjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long double, unsigned int>",
   "name" : "std::unary_function<long double, unsigned int>",
   "referenced_type" : "type-282",
   "self_type" : "type-282",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-39", "type-12" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIejEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__murmur2_or_cityhash<unsigned int, 32>",
   "name" : "std::__murmur2_or_cityhash<unsigned int, 32>",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__121__murmur2_or_cityhashIjLj32EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-258"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<std::_PairT, 2>",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "type-285",
   "self_type" : "type-285",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-259" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashINS_6_PairTELj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-278"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long long, 2>",
   "name" : "std::__scalar_hash<long long, 2>",
   "referenced_type" : "type-288",
   "self_type" : "type-288",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIxLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-279"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<unsigned long long, 2>",
   "name" : "std::__scalar_hash<unsigned long long, 2>",
   "referenced_type" : "type-289",
   "self_type" : "type-289",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIyLj2EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-290",
   "self_type" : "type-290",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-280"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<float, 1>",
   "name" : "std::__scalar_hash<float, 1>",
   "referenced_type" : "type-291",
   "self_type" : "type-291",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIfLj1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-281"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<double, 2>",
   "name" : "std::__scalar_hash<double, 2>",
   "referenced_type" : "type-294",
   "self_type" : "type-294",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-48" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIdLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-282"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long double, 2>",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "type-297",
   "self_type" : "type-297",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIeLj2EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi_ifindex",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ipi_spec_dst",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "ipi_addr",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "in_pktinfo",
   "name" : "in_pktinfo",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "in_pktinfo"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-260"
    }
   ],
   "linker_set_key" : "std::hash<bool>",
   "name" : "std::hash<bool>",
   "referenced_type" : "type-300",
   "self_type" : "type-300",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSNSt3__14hashIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-261"
    }
   ],
   "linker_set_key" : "std::hash<char>",
   "name" : "std::hash<char>",
   "referenced_type" : "type-303",
   "self_type" : "type-303",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-26" ],
   "unique_id" : "_ZTSNSt3__14hashIcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-262"
    }
   ],
   "linker_set_key" : "std::hash<signed char>",
   "name" : "std::hash<signed char>",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-117" ],
   "unique_id" : "_ZTSNSt3__14hashIaEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-263"
    }
   ],
   "linker_set_key" : "std::hash<unsigned char>",
   "name" : "std::hash<unsigned char>",
   "referenced_type" : "type-309",
   "self_type" : "type-309",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSNSt3__14hashIhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin_family",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sin_port",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "sin_addr",
     "field_offset" : 32,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 64,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "sockaddr_in",
   "name" : "sockaddr_in",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in.h",
   "unique_id" : "sockaddr_in"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-311",
   "self_type" : "type-311",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-264"
    }
   ],
   "linker_set_key" : "std::hash<char16_t>",
   "name" : "std::hash<char16_t>",
   "referenced_type" : "type-314",
   "self_type" : "type-314",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-265" ],
   "unique_id" : "_ZTSNSt3__14hashIDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-268"
    }
   ],
   "linker_set_key" : "std::hash<char32_t>",
   "name" : "std::hash<char32_t>",
   "referenced_type" : "type-317",
   "self_type" : "type-317",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-269" ],
   "unique_id" : "_ZTSNSt3__14hashIDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-270"
    }
   ],
   "linker_set_key" : "std::hash<wchar_t>",
   "name" : "std::hash<wchar_t>",
   "referenced_type" : "type-320",
   "self_type" : "type-320",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-271" ],
   "unique_id" : "_ZTSNSt3__14hashIwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-272"
    }
   ],
   "linker_set_key" : "std::hash<short>",
   "name" : "std::hash<short>",
   "referenced_type" : "type-323",
   "self_type" : "type-323",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-167" ],
   "unique_id" : "_ZTSNSt3__14hashIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-273"
    }
   ],
   "linker_set_key" : "std::hash<unsigned short>",
   "name" : "std::hash<unsigned short>",
   "referenced_type" : "type-326",
   "self_type" : "type-326",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__14hashItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-274"
    }
   ],
   "linker_set_key" : "std::hash<int>",
   "name" : "std::hash<int>",
   "referenced_type" : "type-329",
   "self_type" : "type-329",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__14hashIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi6_addr",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "ipi6_ifindex",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "in6_pktinfo",
   "name" : "in6_pktinfo",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "in6_pktinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-333"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_barrier_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-275"
    }
   ],
   "linker_set_key" : "std::hash<unsigned int>",
   "name" : "std::hash<unsigned int>",
   "referenced_type" : "type-334",
   "self_type" : "type-334",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__14hashIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-335",
   "self_type" : "type-335",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-276"
    }
   ],
   "linker_set_key" : "std::hash<long>",
   "name" : "std::hash<long>",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-172" ],
   "unique_id" : "_ZTSNSt3__14hashIlEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ip6m_addr",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "ip6m_mtu",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "ip6_mtuinfo",
   "name" : "ip6_mtuinfo",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ip6_mtuinfo"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-277"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long>",
   "name" : "std::hash<unsigned long>",
   "referenced_type" : "type-341",
   "self_type" : "type-341",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__14hashImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-288"
    }
   ],
   "linker_set_key" : "std::hash<long long>",
   "name" : "std::hash<long long>",
   "referenced_type" : "type-344",
   "self_type" : "type-344",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__14hashIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-289"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long long>",
   "name" : "std::hash<unsigned long long>",
   "referenced_type" : "type-345",
   "self_type" : "type-345",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSNSt3__14hashIyEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-346",
   "self_type" : "type-346",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-291"
    }
   ],
   "linker_set_key" : "std::hash<float>",
   "name" : "std::hash<float>",
   "referenced_type" : "type-348",
   "self_type" : "type-348",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSNSt3__14hashIfEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifr6_addr",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "ifr6_prefixlen",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ifr6_ifindex",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "in6_ifreq",
   "name" : "in6_ifreq",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "in6_ifreq"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-294"
    }
   ],
   "linker_set_key" : "std::hash<double>",
   "name" : "std::hash<double>",
   "referenced_type" : "type-351",
   "self_type" : "type-351",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-48" ],
   "unique_id" : "_ZTSNSt3__14hashIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-297"
    }
   ],
   "linker_set_key" : "std::hash<long double>",
   "name" : "std::hash<long double>",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSNSt3__14hashIeEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__type_name",
     "field_offset" : 32,
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "std::type_info",
   "name" : "std::type_info",
   "record_kind" : "class",
   "referenced_type" : "type-358",
   "self_type" : "type-358",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt9type_info",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9type_info"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nexthdr",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hdrlen",
     "field_offset" : 8,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "ipv6_opt_hdr",
   "name" : "ipv6_opt_hdr",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 2,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "ipv6_opt_hdr"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "std::bad_cast",
   "name" : "std::bad_cast",
   "record_kind" : "class",
   "referenced_type" : "type-363",
   "self_type" : "type-363",
   "size" : 4,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt8bad_cast",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt8bad_cast"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt8bad_cast4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "std::bad_typeid",
   "name" : "std::bad_typeid",
   "record_kind" : "class",
   "referenced_type" : "type-364",
   "self_type" : "type-364",
   "size" : 4,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt10bad_typeid",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt10bad_typeid"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt10bad_typeid4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-37",
   "self_type" : "type-37",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-371"
    }
   ],
   "linker_set_key" : "__sFILE",
   "name" : "__sFILE",
   "referenced_type" : "type-370",
   "self_type" : "type-370",
   "size" : 84,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/struct_file.h",
   "unique_id" : "__sFILE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<int, true>",
   "name" : "std::__libcpp_numeric_limits<int, true>",
   "record_kind" : "class",
   "referenced_type" : "type-372",
   "self_type" : "type-372",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<unsigned int, true>",
   "name" : "std::__libcpp_numeric_limits<unsigned int, true>",
   "record_kind" : "class",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_compute_min<int, 31, true>",
   "name" : "std::__libcpp_compute_min<int, 31, true>",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_compute_minIiLi31ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_compute_min<unsigned int, 32, false>",
   "name" : "std::__libcpp_compute_min<unsigned int, 32, false>",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_compute_minIjLi32ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<bool, true>",
   "name" : "std::__libcpp_numeric_limits<bool, true>",
   "record_kind" : "class",
   "referenced_type" : "type-376",
   "self_type" : "type-376",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<float, true>",
   "name" : "std::__libcpp_numeric_limits<float, true>",
   "record_kind" : "class",
   "referenced_type" : "type-377",
   "self_type" : "type-377",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIfLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<double, true>",
   "name" : "std::__libcpp_numeric_limits<double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-48" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIdLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<long double, true>",
   "name" : "std::__libcpp_numeric_limits<long double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIeLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-372"
    }
   ],
   "linker_set_key" : "std::numeric_limits<int>",
   "name" : "std::numeric_limits<int>",
   "record_kind" : "class",
   "referenced_type" : "type-380",
   "self_type" : "type-380",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-373"
    }
   ],
   "linker_set_key" : "std::numeric_limits<unsigned int>",
   "name" : "std::numeric_limits<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-383",
   "self_type" : "type-383",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-384",
   "self_type" : "type-384",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-382"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-382"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-385",
   "self_type" : "type-385",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-312"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-383"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-383"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-388",
   "self_type" : "type-388",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-388"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-388"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 84,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-393"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-414"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-392",
   "self_type" : "type-392",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-394"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-396"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "name" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "record_kind" : "union",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "type-400"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-401"
    },
    {
     "field_name" : "_kill",
     "referenced_type" : "type-402"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-405"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-406"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-407"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-412"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-413"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3",
   "record_kind" : "union",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 116,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-404"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-404",
   "self_type" : "type-404",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-404"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5",
   "referenced_type" : "type-405",
   "self_type" : "type-405",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-172"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5",
   "referenced_type" : "type-406",
   "self_type" : "type-406",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-209"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-408"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-409"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-411"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7",
   "record_kind" : "union",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-410"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-209"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9",
   "referenced_type" : "type-409",
   "self_type" : "type-409",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut_E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<_Float16>",
   "name" : "std::__libcpp_is_floating_point<_Float16>",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-44" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDF16_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-410"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5",
   "referenced_type" : "type-412",
   "self_type" : "type-412",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-347"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-416",
   "self_type" : "type-416",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<bool, true>",
   "name" : "std::integral_constant<bool, true>",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIbLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-420",
   "self_type" : "type-420",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-421",
   "self_type" : "type-421",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-404"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "type-423"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-424"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-425"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3",
   "name" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3",
   "record_kind" : "union",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 52,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-426"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "type-209"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5",
   "name" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-430"
    }
   ],
   "linker_set_key" : "sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "type-429",
   "self_type" : "type-429",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS10sigset64_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-432"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-414"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-431",
   "self_type" : "type-431",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-394"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-396"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-434"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-414"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-429"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-394"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-396"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "type-435",
   "self_type" : "type-435",
   "size" : 116,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_fpregs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "user_fpregs::fp_reg",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_fpregs::fp_reg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "type-439"
    }
   ],
   "linker_set_key" : "user_regs",
   "name" : "user_regs",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 72,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_regs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "type-440",
   "self_type" : "type-440",
   "size" : 264,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_vfp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "type-442",
   "self_type" : "type-442",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_vfp_exc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-438"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "type-446"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-443",
   "self_type" : "type-443",
   "size" : 296,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-419"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-391"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "type-452"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "type-453"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 744,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<float>",
   "name" : "std::__libcpp_is_floating_point<float>",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-46" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIfEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-429"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3",
   "name" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3",
   "record_kind" : "union",
   "referenced_type" : "type-450",
   "self_type" : "type-450",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5",
   "name" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-456",
   "self_type" : "type-456",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "type-457",
   "self_type" : "type-457",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "f_owner_ex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-459",
   "self_type" : "type-459",
   "size" : 44,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-461"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-460",
   "self_type" : "type-460",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less<void>",
   "name" : "std::less<void>",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__14lessIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__invoke_void_return_wrapper<void>",
   "name" : "std::__invoke_void_return_wrapper<void>",
   "referenced_type" : "type-466",
   "self_type" : "type-466",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__128__invoke_void_return_wrapperIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator_arg_t",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "type-467",
   "self_type" : "type-467",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "unique_id" : "_ZTSNSt3__115allocator_arg_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "flock",
   "name" : "flock",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "flock"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<double>",
   "name" : "std::__libcpp_is_floating_point<double>",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-48" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__has_iterator_category<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "name" : "std::__has_iterator_category<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-471" ],
   "unique_id" : "_ZTSNSt3__123__has_iterator_categoryIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_i",
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-472"
    },
    {
     "access" : "private",
     "field_name" : "_sects",
     "field_offset" : 64,
     "referenced_type" : "type-474"
    }
   ],
   "linker_set_key" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "name" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-473" ],
   "unique_id" : "_ZTSN9libunwind20EHABISectionIteratorINS_17LocalAddressSpaceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "libunwind::LocalAddressSpace",
   "name" : "libunwind::LocalAddressSpace",
   "record_kind" : "class",
   "referenced_type" : "type-473",
   "self_type" : "type-473",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind17LocalAddressSpaceE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arm_section",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "arm_section_length",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::UnwindInfoSections",
   "name" : "libunwind::UnwindInfoSections",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind18UnwindInfoSectionsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__iterator_traits_impl<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "name" : "std::__iterator_traits_impl<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "referenced_type" : "type-477",
   "self_type" : "type-477",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-471" ],
   "unique_id" : "_ZTSNSt3__122__iterator_traits_implIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-477"
    }
   ],
   "linker_set_key" : "std::__iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "name" : "std::__iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "referenced_type" : "type-478",
   "self_type" : "type-478",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-471" ],
   "unique_id" : "_ZTSNSt3__117__iterator_traitsIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-478"
    }
   ],
   "linker_set_key" : "std::iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "name" : "std::iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "referenced_type" : "type-479",
   "self_type" : "type-479",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-471" ],
   "unique_id" : "_ZTSNSt3__115iterator_traitsIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "name" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-86", "type-163", "type-163", "type-163", "type-163" ],
   "unique_id" : "_ZTSNSt3__18iteratorINS_19output_iterator_tagEvvvvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::tuple<>",
   "name" : "std::tuple<>",
   "record_kind" : "class",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__15tupleIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__ignore_t<unsigned char>",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "type-485",
   "self_type" : "type-485",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSNSt3__110__ignore_tIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_equal<0>",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_equalILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_less<0>",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "type-488",
   "self_type" : "type-488",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__112__tuple_lessILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_cat_return<>",
   "name" : "std::__tuple_cat_return<>",
   "referenced_type" : "type-489",
   "self_type" : "type-489",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__118__tuple_cat_returnIJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<long double>",
   "name" : "std::__libcpp_is_floating_point<long double>",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-39" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIeEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "referenced_type" : "type-229"
    }
   ],
   "linker_set_key" : "std::__libcpp_refstring",
   "name" : "std::__libcpp_refstring",
   "record_kind" : "class",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 4,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSNSt3__118__libcpp_refstringE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 32,
     "referenced_type" : "type-490"
    }
   ],
   "linker_set_key" : "std::logic_error",
   "name" : "std::logic_error",
   "record_kind" : "class",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11logic_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11logic_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 32,
     "referenced_type" : "type-490"
    }
   ],
   "linker_set_key" : "std::runtime_error",
   "name" : "std::runtime_error",
   "record_kind" : "class",
   "referenced_type" : "type-494",
   "self_type" : "type-494",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt13runtime_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13runtime_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "std::domain_error",
   "name" : "std::domain_error",
   "record_kind" : "class",
   "referenced_type" : "type-495",
   "self_type" : "type-495",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12domain_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12domain_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "flock64",
   "name" : "flock64",
   "referenced_type" : "type-499",
   "self_type" : "type-499",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "flock64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "in6_u",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "in6_addr",
   "name" : "in6_addr",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "in6_addr"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "std::is_floating_point<int>",
   "name" : "std::is_floating_point<int>",
   "referenced_type" : "type-50",
   "self_type" : "type-50",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIiEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "std::invalid_argument",
   "name" : "std::invalid_argument",
   "record_kind" : "class",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt16invalid_argument",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16invalid_argument"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "std::length_error",
   "name" : "std::length_error",
   "record_kind" : "class",
   "referenced_type" : "type-503",
   "self_type" : "type-503",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12length_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12length_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "std::out_of_range",
   "name" : "std::out_of_range",
   "record_kind" : "class",
   "referenced_type" : "type-506",
   "self_type" : "type-506",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12out_of_range",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12out_of_range"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-494"
    }
   ],
   "linker_set_key" : "std::range_error",
   "name" : "std::range_error",
   "record_kind" : "class",
   "referenced_type" : "type-508",
   "self_type" : "type-508",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11range_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11range_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<int>",
   "name" : "std::__libcpp_is_floating_point<int>",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIiEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-494"
    }
   ],
   "linker_set_key" : "std::overflow_error",
   "name" : "std::overflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-510",
   "self_type" : "type-510",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt14overflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt14overflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-494"
    }
   ],
   "linker_set_key" : "std::underflow_error",
   "name" : "std::underflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-512",
   "self_type" : "type-512",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt15underflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt15underflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-516"
    }
   ],
   "linker_set_key" : "std::atomic_flag",
   "name" : "std::atomic_flag",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic",
   "unique_id" : "_ZTSNSt3__111atomic_flagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<bool, false>",
   "name" : "std::integral_constant<bool, false>",
   "referenced_type" : "type-52",
   "self_type" : "type-52",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIbLb0EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "iovec",
   "name" : "iovec",
   "referenced_type" : "type-520",
   "self_type" : "type-520",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/uio.h",
   "unique_id" : "iovec"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<void>",
   "name" : "std::allocator<void>",
   "record_kind" : "class",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__19allocatorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<const void>",
   "name" : "std::allocator<const void>",
   "record_kind" : "class",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-226" ],
   "unique_id" : "_ZTSNSt3__19allocatorIKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::auto_ptr<void>",
   "name" : "std::auto_ptr<void>",
   "record_kind" : "class",
   "referenced_type" : "type-525",
   "self_type" : "type-525",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__18auto_ptrIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned int, 0>",
   "name" : "std::integral_constant<unsigned int, 0>",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIjLj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__second_tag",
   "name" : "std::__second_tag",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__second_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "std::__destruct_n",
   "name" : "std::__destruct_n",
   "referenced_type" : "type-528",
   "self_type" : "type-528",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__destruct_nE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "std::is_floating_point<unsigned int>",
   "name" : "std::is_floating_point<unsigned int>",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_onoff",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "l_linger",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "linger",
   "name" : "linger",
   "referenced_type" : "type-531",
   "self_type" : "type-531",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "linger"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "std::bad_weak_ptr",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-532",
   "self_type" : "type-532",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112bad_weak_ptrE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 32,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "std::__shared_count",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114__shared_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-533"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__shared_weak_owners_",
     "field_offset" : 64,
     "referenced_type" : "type-172"
    }
   ],
   "linker_set_key" : "std::__shared_weak_count",
   "name" : "std::__shared_weak_count",
   "record_kind" : "class",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 12,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__119__shared_weak_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__119__shared_weak_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__119__shared_weak_count21__on_zero_shared_weakEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<unsigned int>",
   "name" : "std::__libcpp_is_floating_point<unsigned int>",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_name",
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "msg_namelen",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "msg_iov",
     "field_offset" : 64,
     "referenced_type" : "type-542"
    },
    {
     "field_name" : "msg_iovlen",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "msg_control",
     "field_offset" : 128,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "msg_controllen",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "msg_flags",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "msghdr",
   "name" : "msghdr",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 28,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "msghdr"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "name" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "record_kind" : "class",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-544" ],
   "unique_id" : "_ZTSNSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__lx",
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "std::__sp_mut",
   "name" : "std::__sp_mut",
   "record_kind" : "class",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__18__sp_mutE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "type-547"
    }
   ],
   "linker_set_key" : "std::pointer_safety",
   "name" : "std::pointer_safety",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114pointer_safetyE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::is_same<std::__less<unsigned int, unsigned int> &, std::__two>",
   "name" : "std::is_same<std::__less<unsigned int, unsigned int> &, std::__two>",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-56", "type-58" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRNS_6__lessIjjEENS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::plus<void>",
   "name" : "std::plus<void>",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__14plusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::minus<void>",
   "name" : "std::minus<void>",
   "referenced_type" : "type-552",
   "self_type" : "type-552",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__15minusIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rt_hdr",
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "addr",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "rt0_hdr",
   "name" : "rt0_hdr",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/ipv6.h",
   "unique_id" : "rt0_hdr"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::multiplies<void>",
   "name" : "std::multiplies<void>",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__110multipliesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::divides<void>",
   "name" : "std::divides<void>",
   "referenced_type" : "type-555",
   "self_type" : "type-555",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__17dividesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::modulus<void>",
   "name" : "std::modulus<void>",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__17modulusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::negate<void>",
   "name" : "std::negate<void>",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__16negateIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::equal_to<void>",
   "name" : "std::equal_to<void>",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__18equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::not_equal_to<void>",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__112not_equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater<void>",
   "name" : "std::greater<void>",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__17greaterIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 0>",
   "name" : "std::integral_constant<int, 0>",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater_equal<void>",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "type-562",
   "self_type" : "type-562",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__113greater_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less_equal<void>",
   "name" : "std::less_equal<void>",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__110less_equalIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_hdr",
     "referenced_type" : "type-541"
    },
    {
     "field_name" : "msg_len",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "mmsghdr",
   "name" : "mmsghdr",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 32,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "mmsghdr"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_and<void>",
   "name" : "std::logical_and<void>",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__111logical_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_or<void>",
   "name" : "std::logical_or<void>",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__110logical_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_not<void>",
   "name" : "std::logical_not<void>",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__111logical_notIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_and<void>",
   "name" : "std::bit_and<void>",
   "referenced_type" : "type-568",
   "self_type" : "type-568",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__17bit_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_or<void>",
   "name" : "std::bit_or<void>",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__16bit_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__less<unsigned int, unsigned int>",
   "name" : "std::__less<unsigned int, unsigned int>",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-12", "type-12" ],
   "unique_id" : "_ZTSNSt3__16__lessIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_xor<void>",
   "name" : "std::bit_xor<void>",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__17bit_xorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_not<void>",
   "name" : "std::bit_not<void>",
   "referenced_type" : "type-571",
   "self_type" : "type-571",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__17bit_notIvEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "std::bad_function_call",
   "name" : "std::bad_function_call",
   "record_kind" : "class",
   "referenced_type" : "type-572",
   "self_type" : "type-572",
   "size" : 4,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__117bad_function_callE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__117bad_function_callE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<1>",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "type-574",
   "self_type" : "type-574",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmsg_len",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "cmsg_level",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "cmsg_type",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "cmsghdr",
   "name" : "cmsghdr",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "cmsghdr"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<2>",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "type-576",
   "self_type" : "type-576",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<3>",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi3EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<4>",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<5>",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "type-579",
   "self_type" : "type-579",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi5EEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "std::__two",
   "name" : "std::__two",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 2,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__twoE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<6>",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi6EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<7>",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi7EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<8>",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "type-582",
   "self_type" : "type-582",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<9>",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "type-583",
   "self_type" : "type-583",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi9EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<10>",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi10EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 1>",
   "name" : "std::integral_constant<int, 1>",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "uid",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "gid",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "ucred",
   "name" : "ucred",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "ucred"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h_name",
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "h_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-598"
    },
    {
     "field_name" : "h_addrtype",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "h_length",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "h_addr_list",
     "field_offset" : 128,
     "referenced_type" : "type-598"
    }
   ],
   "linker_set_key" : "hostent",
   "name" : "hostent",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 20,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "hostent"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 2>",
   "name" : "std::integral_constant<int, 2>",
   "referenced_type" : "type-599",
   "self_type" : "type-599",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi2EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "u6_addr8",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "u6_addr16",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "u6_addr32",
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "in6_addr::(anonymous union at bionic/libc/kernel/uapi/linux/in6.h:25:3) at bionic/libc/kernel/uapi/linux/in6.h:25:3",
   "name" : "in6_addr::(anonymous union at bionic/libc/kernel/uapi/linux/in6.h:25:3) at bionic/libc/kernel/uapi/linux/in6.h:25:3",
   "record_kind" : "union",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/in6.h",
   "unique_id" : "in6_addr::(anonymous union at bionic/libc/kernel/uapi/linux/in6.h:25:3)"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_is_function_imp::__dummy_type",
   "name" : "std::__libcpp_is_function_imp::__dummy_type",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__124__libcpp_is_function_imp12__dummy_typeE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__p_",
     "referenced_type" : "type-610"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<int>",
   "name" : "std::uniform_int_distribution<int>",
   "record_kind" : "class",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 8,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<int>",
   "name" : "std::is_arithmetic<int>",
   "referenced_type" : "type-61",
   "self_type" : "type-61",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__a_",
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "__b_",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<int>::param_type",
   "name" : "std::uniform_int_distribution<int>::param_type",
   "record_kind" : "class",
   "referenced_type" : "type-610",
   "self_type" : "type-610",
   "size" : 8,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIiE10param_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__rs_default",
   "name" : "std::__rs_default",
   "record_kind" : "class",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__112__rs_defaultE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__return_temporary_buffer",
   "name" : "std::__return_temporary_buffer",
   "referenced_type" : "type-612",
   "self_type" : "type-612",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__125__return_temporary_bufferE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-614", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_x86E13unw_context_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-615"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86",
   "name" : "libunwind::Registers_x86",
   "record_kind" : "class",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x86E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__eax",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ebx",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ecx",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__edx",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__edi",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__esi",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ebp",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__esp",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ss",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__eflags",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__eip",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 352,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ds",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__es",
     "field_offset" : 416,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 448,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 480,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86::GPRs",
   "name" : "libunwind::Registers_x86::GPRs",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x864GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "referenced_type" : "type-616",
   "self_type" : "type-616",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-614" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "referenced_type" : "type-618",
   "self_type" : "type-618",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-619", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-620"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64",
   "name" : "libunwind::Registers_x86_64",
   "record_kind" : "class",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_64E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<unsigned int>",
   "name" : "std::is_arithmetic<unsigned int>",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIjEE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__rax",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rbx",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rcx",
     "field_offset" : 128,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rdx",
     "field_offset" : 192,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rdi",
     "field_offset" : 256,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rsi",
     "field_offset" : 320,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rbp",
     "field_offset" : 384,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rsp",
     "field_offset" : 448,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 512,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 576,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 640,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 704,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 768,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 832,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 896,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 960,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rip",
     "field_offset" : 1024,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__rflags",
     "field_offset" : 1088,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 1152,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 1216,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 1280,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64::GPRs",
   "name" : "libunwind::Registers_x86_64::GPRs",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_644GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-619" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-624", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_ppcE13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-625"
    },
    {
     "access" : "private",
     "field_name" : "_floatRegisters",
     "field_offset" : 1280,
     "referenced_type" : "type-626"
    },
    {
     "access" : "private",
     "field_name" : "_vectorRegisters",
     "field_offset" : 3392,
     "referenced_type" : "type-628"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc",
   "name" : "libunwind::Registers_ppc",
   "record_kind" : "class",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppcE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 352,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 416,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 448,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 480,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 512,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 544,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 576,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 608,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 640,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 672,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 704,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 736,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 768,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 800,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 832,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 864,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 896,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 928,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 960,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 992,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 1024,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 1056,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 1088,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 1120,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1152,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 1184,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__mq",
     "field_offset" : 1216,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 1248,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "name" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 160,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc18ppc_thread_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__fpregs",
     "referenced_type" : "type-627"
    },
    {
     "field_name" : "__fpscr_pad",
     "field_offset" : 2048,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__fpscr",
     "field_offset" : 2080,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_float_state_t",
   "name" : "libunwind::Registers_ppc::ppc_float_state_t",
   "referenced_type" : "type-626",
   "self_type" : "type-626",
   "size" : 264,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc17ppc_float_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vec",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::v128",
   "name" : "libunwind::v128",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind4v128E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::is_scalar<nullptr_t>",
   "name" : "std::is_scalar<nullptr_t>",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-64" ],
   "unique_id" : "_ZTSNSt3__19is_scalarIDnEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-630",
   "self_type" : "type-630",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-624" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-632",
   "self_type" : "type-632",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "referenced_type" : "type-633",
   "self_type" : "type-633",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-634", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_arm64E13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-635"
    },
    {
     "access" : "private",
     "field_name" : "_vectorHalfRegisters",
     "field_offset" : 2176,
     "referenced_type" : "type-627"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64",
   "name" : "libunwind::Registers_arm64",
   "record_kind" : "class",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__x",
     "referenced_type" : "type-636"
    },
    {
     "field_name" : "__fp",
     "field_offset" : 1856,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1920,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 1984,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "padding",
     "field_offset" : 2112,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64::GPRs",
   "name" : "libunwind::Registers_arm64::GPRs",
   "referenced_type" : "type-635",
   "self_type" : "type-635",
   "size" : 272,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm644GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "referenced_type" : "type-637",
   "self_type" : "type-637",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-634" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_name",
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "n_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-598"
    },
    {
     "field_name" : "n_addrtype",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "n_net",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "netent",
   "name" : "netent",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 16,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "netent"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-641", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_armE13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-642"
    },
    {
     "access" : "private",
     "field_name" : "_use_X_for_vfp_save",
     "field_offset" : 512,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d0_d15",
     "field_offset" : 520,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d16_d31",
     "field_offset" : 528,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d0_d15_pad",
     "field_offset" : 576,
     "referenced_type" : "type-644"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d16_d31",
     "field_offset" : 1664,
     "referenced_type" : "type-645"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm",
   "name" : "libunwind::Registers_arm",
   "record_kind" : "class",
   "referenced_type" : "type-641",
   "self_type" : "type-641",
   "size" : 336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_armE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-643"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 416,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 448,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 480,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm::GPRs",
   "name" : "libunwind::Registers_arm::GPRs",
   "referenced_type" : "type-642",
   "self_type" : "type-642",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_arm4GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "referenced_type" : "type-646",
   "self_type" : "type-646",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-641" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-649", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind14Registers_or1kE13unw_context_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k",
   "name" : "libunwind::Registers_or1k",
   "record_kind" : "class",
   "referenced_type" : "type-649",
   "self_type" : "type-649",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1kE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_referenceable_impl",
   "name" : "std::__is_referenceable_impl",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__is_referenceable_implE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-651"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "name" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1k19or1k_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_name",
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "s_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-598"
    },
    {
     "field_name" : "s_port",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "s_proto",
     "field_offset" : 96,
     "referenced_type" : "type-232"
    }
   ],
   "linker_set_key" : "servent",
   "name" : "servent",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 16,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "servent"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-649" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-654",
   "self_type" : "type-654",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "referenced_type" : "type-655",
   "self_type" : "type-655",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-656", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-657"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32",
   "name" : "libunwind::Registers_mips_o32",
   "record_kind" : "class",
   "referenced_type" : "type-656",
   "self_type" : "type-656",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o32E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-651"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 1056,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 1088,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "name" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "referenced_type" : "type-657",
   "self_type" : "type-657",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o3223mips_o32_thread_state_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "referenced_type" : "type-658",
   "self_type" : "type-658",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-656" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__lazy_and_impl<true>",
   "name" : "std::__lazy_and_impl<true>",
   "referenced_type" : "type-659",
   "self_type" : "type-659",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115__lazy_and_implILb1EJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<std::__less<unsigned int, unsigned int> >",
   "name" : "std::__is_referenceable<std::__less<unsigned int, unsigned int> >",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableINS_6__lessIjjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-660",
   "self_type" : "type-660",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_name",
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "p_aliases",
     "field_offset" : 32,
     "referenced_type" : "type-598"
    },
    {
     "field_name" : "p_proto",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "protoent",
   "name" : "protoent",
   "referenced_type" : "type-661",
   "self_type" : "type-661",
   "size" : 12,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "protoent"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_n64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_n64, unw_context_t>",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-663", "type-83" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind18Registers_mips_n64E13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-664"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_n64",
   "name" : "libunwind::Registers_mips_n64",
   "record_kind" : "class",
   "referenced_type" : "type-663",
   "self_type" : "type-663",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_n64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 2112,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 2176,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_n64::mips_n64_thread_state_t",
   "name" : "libunwind::Registers_mips_n64::mips_n64_thread_state_t",
   "referenced_type" : "type-664",
   "self_type" : "type-664",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_n6423mips_n64_thread_state_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<libunwind::Registers_mips_n64>",
   "name" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<libunwind::Registers_mips_n64>",
   "referenced_type" : "type-665",
   "self_type" : "type-665",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-663" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_n64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-666",
   "self_type" : "type-666",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_n64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "name" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "referenced_type" : "type-667",
   "self_type" : "type-667",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-668", "type-69" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-670"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-669"
    },
    {
     "access" : "private",
     "field_name" : "_registers",
     "field_offset" : 64,
     "referenced_type" : "type-641"
    },
    {
     "access" : "private",
     "field_name" : "_info",
     "field_offset" : 2752,
     "referenced_type" : "type-175"
    },
    {
     "access" : "private",
     "field_name" : "_unwindInfoMissing",
     "field_offset" : 3072,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "_isSignalFrame",
     "field_offset" : 3080,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "name" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "record_kind" : "class",
   "referenced_type" : "type-668",
   "self_type" : "type-668",
   "size" : 392,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-473", "type-641" ],
   "unique_id" : "_ZTSN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<std::__less<unsigned int, unsigned int>, true>",
   "name" : "std::__add_lvalue_reference_impl<std::__less<unsigned int, unsigned int>, true>",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implINS_6__lessIjjEELb1EEE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libunwind::AbstractUnwindCursor",
   "name" : "libunwind::AbstractUnwindCursor",
   "record_kind" : "class",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 4,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind20AbstractUnwindCursorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind20AbstractUnwindCursorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "referenced_type" : "type-671",
   "self_type" : "type-671",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-668" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS4_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ai_flags",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ai_family",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ai_socktype",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ai_protocol",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ai_addrlen",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ai_canonname",
     "field_offset" : 160,
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "ai_addr",
     "field_offset" : 192,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "ai_next",
     "field_offset" : 224,
     "referenced_type" : "type-673"
    }
   ],
   "linker_set_key" : "addrinfo",
   "name" : "addrinfo",
   "referenced_type" : "type-672",
   "self_type" : "type-672",
   "size" : 32,
   "source_file" : "/bionic/libc/include/netdb.h",
   "unique_id" : "addrinfo"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "referenced_type" : "type-674",
   "self_type" : "type-674",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-69" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS5_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::__lazy_or_impl<false>",
   "name" : "std::__lazy_or_impl<false>",
   "referenced_type" : "type-676",
   "self_type" : "type-676",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__lazy_or_implILb0EJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-679"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-682"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-683"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-686"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTS21_Unwind_Control_Block"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:75:3) at external/libunwind_llvm/include/unwind.h:75:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:75:3) at external/libunwind_llvm/include/unwind.h:75:3",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-684"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:84:3) at external/libunwind_llvm/include/unwind.h:84:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:84:3) at external/libunwind_llvm/include/unwind.h:84:3",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:90:3) at external/libunwind_llvm/include/unwind.h:90:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:90:3) at external/libunwind_llvm/include/unwind.h:90:3",
   "referenced_type" : "type-685",
   "self_type" : "type-685",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:95:3) at external/libunwind_llvm/include/unwind.h:95:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:95:3) at external/libunwind_llvm/include/unwind.h:95:3",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt2_E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__and_<>",
   "name" : "std::__and_<>",
   "referenced_type" : "type-687",
   "self_type" : "type-687",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__16__and_IJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "unw_cursor_t",
   "name" : "unw_cursor_t",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 1120,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS12unw_cursor_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tbase",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "dbase",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "dwarf_eh_bases",
   "name" : "dwarf_eh_bases",
   "referenced_type" : "type-691",
   "self_type" : "type-691",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "dwarf_eh_bases"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 32,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 64,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 96,
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "Dl_info",
   "name" : "Dl_info",
   "referenced_type" : "type-692",
   "self_type" : "type-692",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/dlfcn.h",
   "unique_id" : "Dl_info"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-693",
   "self_type" : "type-693",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::__or_<>",
   "name" : "std::__or_<>",
   "referenced_type" : "type-697",
   "self_type" : "type-697",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__or_IJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<int>",
   "name" : "std::remove_const<int>",
   "referenced_type" : "type-704",
   "self_type" : "type-704",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__112remove_constIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<unsigned int>",
   "name" : "std::remove_const<unsigned int>",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__112remove_constIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-716",
   "self_type" : "type-716",
   "size" : 40,
   "source_file" : "/bionic/libc/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<int>",
   "name" : "std::remove_volatile<int>",
   "referenced_type" : "type-718",
   "self_type" : "type-718",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_lvalue_reference<std::__less<unsigned int, unsigned int> >",
   "name" : "std::add_lvalue_reference<std::__less<unsigned int, unsigned int> >",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSNSt3__120add_lvalue_referenceINS_6__lessIjjEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 32,
     "referenced_type" : "type-726"
    }
   ],
   "linker_set_key" : "dynamic",
   "name" : "dynamic",
   "referenced_type" : "type-725",
   "self_type" : "type-725",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS7dynamic"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "name" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "record_kind" : "union",
   "referenced_type" : "type-726",
   "self_type" : "type-726",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN7dynamicUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<unsigned int>",
   "name" : "std::remove_volatile<unsigned int>",
   "referenced_type" : "type-729",
   "self_type" : "type-729",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__any",
   "name" : "std::__any",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__anyE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 64,
     "referenced_type" : "type-731"
    }
   ],
   "linker_set_key" : "Elf64_Dyn",
   "name" : "Elf64_Dyn",
   "referenced_type" : "type-730",
   "self_type" : "type-730",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9Elf64_Dyn"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-71"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "name" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "record_kind" : "union",
   "referenced_type" : "type-731",
   "self_type" : "type-731",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN9Elf64_DynUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_rel",
   "name" : "elf32_rel",
   "referenced_type" : "type-732",
   "self_type" : "type-732",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_rel"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "elf64_rel",
   "name" : "elf64_rel",
   "referenced_type" : "type-733",
   "self_type" : "type-733",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_rel"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "elf32_rela",
   "name" : "elf32_rela",
   "referenced_type" : "type-734",
   "self_type" : "type-734",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_rela"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 128,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "elf64_rela",
   "name" : "elf64_rela",
   "referenced_type" : "type-735",
   "self_type" : "type-735",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_rela"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 96,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 104,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 112,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "elf32_sym",
   "name" : "elf32_sym",
   "referenced_type" : "type-736",
   "self_type" : "type-736",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_sym"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 40,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 48,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 128,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "elf64_sym",
   "name" : "elf64_sym",
   "referenced_type" : "type-737",
   "self_type" : "type-737",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_sym"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 320,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 336,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 352,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 368,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 384,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 400,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "elf32_hdr",
   "name" : "elf32_hdr",
   "referenced_type" : "type-738",
   "self_type" : "type-738",
   "size" : 52,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_hdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 256,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 320,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 384,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 416,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 432,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 448,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 464,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 480,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 496,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "elf64_hdr",
   "name" : "elf64_hdr",
   "referenced_type" : "type-739",
   "self_type" : "type-739",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_hdr"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed_impl<int, true>",
   "name" : "std::__libcpp_is_signed_impl<int, true>",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_is_signed_implIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<int>",
   "name" : "std::remove_cv<int>",
   "referenced_type" : "type-740",
   "self_type" : "type-740",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_phdr",
   "name" : "elf32_phdr",
   "referenced_type" : "type-741",
   "self_type" : "type-741",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_phdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 128,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 192,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 256,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 320,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 384,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "elf64_phdr",
   "name" : "elf64_phdr",
   "referenced_type" : "type-742",
   "self_type" : "type-742",
   "size" : 56,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_phdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_shdr",
   "name" : "elf32_shdr",
   "referenced_type" : "type-743",
   "self_type" : "type-743",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_shdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 128,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 192,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 256,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 320,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 352,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 384,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 448,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "elf64_shdr",
   "name" : "elf64_shdr",
   "referenced_type" : "type-744",
   "self_type" : "type-744",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_shdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf32_note",
   "name" : "elf32_note",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_note"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "elf64_note",
   "name" : "elf64_note",
   "referenced_type" : "type-746",
   "self_type" : "type-746",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_note"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 32,
     "referenced_type" : "type-748"
    }
   ],
   "linker_set_key" : "Elf32_auxv_t",
   "name" : "Elf32_auxv_t",
   "referenced_type" : "type-747",
   "self_type" : "type-747",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_auxv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "name" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "record_kind" : "union",
   "referenced_type" : "type-748",
   "self_type" : "type-748",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf32_auxv_tUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 64,
     "referenced_type" : "type-750"
    }
   ],
   "linker_set_key" : "Elf64_auxv_t",
   "name" : "Elf64_auxv_t",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_auxv_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed_impl<unsigned int, true>",
   "name" : "std::__libcpp_is_signed_impl<unsigned int, true>",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_is_signed_implIjLb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-71"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "name" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "record_kind" : "union",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf64_auxv_tUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<unsigned int>",
   "name" : "std::remove_cv<unsigned int>",
   "referenced_type" : "type-751",
   "self_type" : "type-751",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Chdr",
   "name" : "Elf32_Chdr",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Chdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_reserved",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 128,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "Elf64_Chdr",
   "name" : "Elf64_Chdr",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Chdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Lib",
   "name" : "Elf32_Lib",
   "referenced_type" : "type-754",
   "self_type" : "type-754",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf32_Lib"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Lib",
   "name" : "Elf64_Lib",
   "referenced_type" : "type-755",
   "self_type" : "type-755",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf64_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 128,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 144,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "Elf32_Move",
   "name" : "Elf32_Move",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Move"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 128,
     "referenced_type" : "type-71"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 208,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "Elf64_Move",
   "name" : "Elf64_Move",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "Elf32_Syminfo",
   "name" : "Elf32_Syminfo",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Syminfo"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "Elf64_Syminfo",
   "name" : "Elf64_Syminfo",
   "referenced_type" : "type-759",
   "self_type" : "type-759",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Syminfo"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-74"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed<int, true>",
   "name" : "std::__libcpp_is_signed<int, true>",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__118__libcpp_is_signedIiLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Verdef",
   "name" : "Elf32_Verdef",
   "referenced_type" : "type-760",
   "self_type" : "type-760",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Verdaux",
   "name" : "Elf32_Verdaux",
   "referenced_type" : "type-761",
   "self_type" : "type-761",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verdaux"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<void>",
   "name" : "std::__libcpp_is_void<void>",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Verdef",
   "name" : "Elf64_Verdef",
   "referenced_type" : "type-763",
   "self_type" : "type-763",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Verdaux",
   "name" : "Elf64_Verdaux",
   "referenced_type" : "type-764",
   "self_type" : "type-764",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Verneed",
   "name" : "Elf32_Verneed",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verneed"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf32_Vernaux",
   "name" : "Elf32_Vernaux",
   "referenced_type" : "type-766",
   "self_type" : "type-766",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Verneed",
   "name" : "Elf64_Verneed",
   "referenced_type" : "type-767",
   "self_type" : "type-767",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verneed"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "Elf64_Vernaux",
   "name" : "Elf64_Vernaux",
   "referenced_type" : "type-768",
   "self_type" : "type-768",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Vernaux"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-75"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed<unsigned int, true>",
   "name" : "std::__libcpp_is_signed<unsigned int, true>",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__118__libcpp_is_signedIjLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlpi_addr",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "dlpi_name",
     "field_offset" : 32,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "dlpi_phdr",
     "field_offset" : 64,
     "referenced_type" : "type-771"
    },
    {
     "field_name" : "dlpi_phnum",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "dl_phdr_info",
   "name" : "dl_phdr_info",
   "referenced_type" : "type-770",
   "self_type" : "type-770",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "dl_phdr_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_addr",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "l_name",
     "field_offset" : 32,
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "l_ld",
     "field_offset" : 64,
     "referenced_type" : "type-774"
    },
    {
     "field_name" : "l_next",
     "field_offset" : 96,
     "referenced_type" : "type-775"
    },
    {
     "field_name" : "l_prev",
     "field_offset" : 128,
     "referenced_type" : "type-775"
    }
   ],
   "linker_set_key" : "link_map",
   "name" : "link_map",
   "referenced_type" : "type-773",
   "self_type" : "type-773",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "link_map"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<nullptr_t>",
   "name" : "std::__is_nullptr_t_impl<nullptr_t>",
   "referenced_type" : "type-776",
   "self_type" : "type-776",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-64" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implIDnEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_version",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "r_map",
     "field_offset" : 32,
     "referenced_type" : "type-775"
    },
    {
     "field_name" : "r_brk",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_state",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "r_ldbase",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "r_debug",
   "name" : "r_debug",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "r_debug"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "std::is_signed<int>",
   "name" : "std::is_signed<int>",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__19is_signedIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "addressSpace",
     "referenced_type" : "type-472"
    },
    {
     "field_name" : "sects",
     "field_offset" : 32,
     "referenced_type" : "type-783"
    },
    {
     "field_name" : "targetAddr",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "dl_iterate_cb_data",
   "name" : "dl_iterate_cb_data",
   "referenced_type" : "type-782",
   "self_type" : "type-782",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSZN9libunwind17LocalAddressSpace18findUnwindSectionsEjRNS_18UnwindInfoSectionsEE18dl_iterate_cb_data"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "commonEncodingsArraySectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "commonEncodingsArrayCount",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "personalityArraySectionOffset",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "personalityArrayCount",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "indexSectionOffset",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "indexCount",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_section_header",
   "name" : "unwind_info_section_header",
   "referenced_type" : "type-784",
   "self_type" : "type-784",
   "size" : 28,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS26unwind_info_section_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "secondLevelPagesSectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lsdaIndexArraySectionOffset",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_index_entry",
   "name" : "unwind_info_section_header_index_entry",
   "referenced_type" : "type-785",
   "self_type" : "type-785",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_section_header_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lsdaOffset",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_lsda_index_entry",
   "name" : "unwind_info_section_header_lsda_index_entry",
   "referenced_type" : "type-786",
   "self_type" : "type-786",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS43unwind_info_section_header_lsda_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_entry",
   "name" : "unwind_info_regular_second_level_entry",
   "referenced_type" : "type-787",
   "self_type" : "type-787",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_regular_second_level_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_page_header",
   "name" : "unwind_info_regular_second_level_page_header",
   "referenced_type" : "type-788",
   "self_type" : "type-788",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS44unwind_info_regular_second_level_page_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "encodingsPageOffset",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "encodingsCount",
     "field_offset" : 80,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "unwind_info_compressed_second_level_page_header",
   "name" : "unwind_info_compressed_second_level_page_header",
   "referenced_type" : "type-789",
   "self_type" : "type-789",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS47unwind_info_compressed_second_level_page_header"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "std::is_signed<unsigned int>",
   "name" : "std::is_signed<unsigned int>",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__19is_signedIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-790",
   "self_type" : "type-790",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-792"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-791",
   "self_type" : "type-791",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-794"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "type-795"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "type-209"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-793",
   "self_type" : "type-793",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<bool>",
   "name" : "std::__libcpp_is_integral<bool>",
   "referenced_type" : "type-797",
   "self_type" : "type-797",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-43" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_lock",
     "referenced_type" : "type-346"
    }
   ],
   "linker_set_key" : "libunwind::RWMutex",
   "name" : "libunwind::RWMutex",
   "record_kind" : "class",
   "referenced_type" : "type-798",
   "self_type" : "type-798",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/src/RWMutex.hpp",
   "unique_id" : "_ZTSN9libunwind7RWMutexE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "std::is_abstract<std::input_iterator_tag>",
   "name" : "std::is_abstract<std::input_iterator_tag>",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__111is_abstractINS_18input_iterator_tagEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char>",
   "name" : "std::__libcpp_is_integral<char>",
   "referenced_type" : "type-803",
   "self_type" : "type-803",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-26" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "libunwind::EHABIIndexEntry",
   "name" : "libunwind::EHABIIndexEntry",
   "referenced_type" : "type-805",
   "self_type" : "type-805",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind15EHABIIndexEntryE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::input_iterator_tag",
   "name" : "std::input_iterator_tag",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__118input_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<signed char>",
   "name" : "std::__libcpp_is_integral<signed char>",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-117" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIaEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned char>",
   "name" : "std::__libcpp_is_integral<unsigned char>",
   "referenced_type" : "type-811",
   "self_type" : "type-811",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<wchar_t>",
   "name" : "std::__libcpp_is_integral<wchar_t>",
   "referenced_type" : "type-812",
   "self_type" : "type-812",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-271" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char16_t>",
   "name" : "std::__libcpp_is_integral<char16_t>",
   "referenced_type" : "type-815",
   "self_type" : "type-815",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-265" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char32_t>",
   "name" : "std::__libcpp_is_integral<char32_t>",
   "referenced_type" : "type-816",
   "self_type" : "type-816",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-269" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<short>",
   "name" : "std::__libcpp_is_integral<short>",
   "referenced_type" : "type-817",
   "self_type" : "type-817",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-167" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned short>",
   "name" : "std::__libcpp_is_integral<unsigned short>",
   "referenced_type" : "type-818",
   "self_type" : "type-818",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<int>",
   "name" : "std::__libcpp_is_integral<int>",
   "referenced_type" : "type-819",
   "self_type" : "type-819",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned int>",
   "name" : "std::__libcpp_is_integral<unsigned int>",
   "referenced_type" : "type-820",
   "self_type" : "type-820",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<long>",
   "name" : "std::__libcpp_is_integral<long>",
   "referenced_type" : "type-821",
   "self_type" : "type-821",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-172" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned long>",
   "name" : "std::__libcpp_is_integral<unsigned long>",
   "referenced_type" : "type-822",
   "self_type" : "type-822",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<long long>",
   "name" : "std::__libcpp_is_integral<long long>",
   "referenced_type" : "type-823",
   "self_type" : "type-823",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned long long>",
   "name" : "std::__libcpp_is_integral<unsigned long long>",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-71" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-819"
    }
   ],
   "linker_set_key" : "std::is_integral<int>",
   "name" : "std::is_integral<int>",
   "referenced_type" : "type-825",
   "self_type" : "type-825",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__111is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-820"
    }
   ],
   "linker_set_key" : "std::is_integral<unsigned int>",
   "name" : "std::is_integral<unsigned int>",
   "referenced_type" : "type-826",
   "self_type" : "type-826",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__111is_integralIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<__fp16>",
   "name" : "std::__libcpp_is_floating_point<__fp16>",
   "referenced_type" : "type-827",
   "self_type" : "type-827",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-40" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDhEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "unw_context_t",
   "name" : "unw_context_t",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 1024,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS13unw_context_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
