{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "PSH_GlobalsRec_ *[256]",
   "name" : "PSH_GlobalsRec_ *[256]",
   "referenced_type" : "type-1091",
   "self_type" : "type-1105",
   "size" : 1024,
   "source_file" : "/external/freetype/include/freetype/internal/cffotypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "long *[16]",
   "name" : "long *[16]",
   "referenced_type" : "type-109",
   "self_type" : "type-464",
   "size" : 64,
   "source_file" : "/external/freetype/include/freetype/t1tables.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "PSH_GlobalsRec_ *[256]",
   "name" : "PSH_GlobalsRec_ *[256]",
   "referenced_type" : "type-1129",
   "self_type" : "type-1142",
   "size" : 1024,
   "source_file" : "/external/freetype/include/freetype/internal/cffotypes.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "PSH_GlobalsRec_ *[256]",
   "name" : "PSH_GlobalsRec_ *[256]",
   "referenced_type" : "type-1177",
   "self_type" : "type-1194",
   "size" : 1024,
   "source_file" : "/external/freetype/include/freetype/internal/cffotypes.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "signed char [16]",
   "name" : "signed char [16]",
   "referenced_type" : "type-127",
   "self_type" : "type-448",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/tttables.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "signed char [2]",
   "name" : "signed char [2]",
   "referenced_type" : "type-127",

   "source_file" : "/external/freetype/include/freetype/ftmodapi.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_Open_Args_",
   "name" : "const FT_Open_Args_",
   "referenced_type" : "type-278",
   "self_type" : "type-406",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/freetype.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_ServiceDescRec_",
   "name" : "const FT_ServiceDescRec_",
   "referenced_type" : "type-332",
   "self_type" : "type-431",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/ftserv.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_CMap_ClassRec_",
   "name" : "const FT_CMap_ClassRec_",
   "referenced_type" : "type-336",
   "self_type" : "type-335",
   "size" : 40,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_Outline_Funcs_",
   "name" : "const FT_Outline_Funcs_",
   "referenced_type" : "type-382",
   "self_type" : "type-589",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/ftoutln.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-3",
   "self_type" : "type-26",
   "source_file" : "/external/freetype/include/freetype/ftimage.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_Vector_",
   "name" : "const FT_Vector_",
   "referenced_type" : "type-46",
   "self_type" : "type-133",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/ftimage.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_Renderer_Class_",
   "name" : "const FT_Renderer_Class_",
   "referenced_type" : "type-48",
   "self_type" : "type-261",
   "size" : 60,
   "source_file" : "/external/freetype/include/freetype/config/ftmodule.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const FT_Frame_Field_",
   "name" : "const FT_Frame_Field_",
   "referenced_type" : "type-578",
   "self_type" : "type-581",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/ftstream.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile FT_ValidatorRec_",
   "name" : "volatile FT_ValidatorRec_",
   "referenced_type" : "type-595",
   "self_type" : "type-597",
   "size" : 56,
   "source_file" : "/external/freetype/include/freetype/internal/ftvalid.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-64",
   "self_type" : "type-456",
   "size" : 2,
   "source_file" : "/external/freetype/include/freetype/ftcolor.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_Service_PsCMapsRec_",
   "name" : "const FT_Service_PsCMapsRec_",
   "referenced_type" : "type-655",
   "self_type" : "type-709",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const PS_Table_FuncsRec_",
   "name" : "const PS_Table_FuncsRec_",
   "referenced_type" : "type-717",
   "self_type" : "type-858",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const PS_Parser_FuncsRec_",
   "name" : "const PS_Parser_FuncsRec_",
   "referenced_type" : "type-733",
   "self_type" : "type-860",
   "size" : 52,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const FT_Driver_ClassRec_",
   "name" : "const FT_Driver_ClassRec_",
   "referenced_type" : "type-76",
   "self_type" : "type-260",
   "size" : 96,
   "source_file" : "/external/freetype/include/freetype/config/ftmodule.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const T1_Builder_FuncsRec_",
   "name" : "const T1_Builder_FuncsRec_",
   "referenced_type" : "type-779",
   "self_type" : "type-862",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const T1_Decoder_FuncsRec_",
   "name" : "const T1_Decoder_FuncsRec_",
   "referenced_type" : "type-797",
   "self_type" : "type-864",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-82",
   "self_type" : "type-280",
   "size" : 1,
   "source_file" : "/external/freetype/include/freetype/fttypes.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const CFF_Decoder_FuncsRec_",
   "name" : "const CFF_Decoder_FuncsRec_",
   "referenced_type" : "type-835",
   "self_type" : "type-878",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AFM_Parser_FuncsRec_",
   "name" : "const AFM_Parser_FuncsRec_",
   "referenced_type" : "type-841",
   "self_type" : "type-876",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const T1_CMap_ClassesRec_",
   "name" : "const T1_CMap_ClassesRec_",
   "referenced_type" : "type-855",
   "self_type" : "type-874",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "user",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "free",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "realloc",
     "field_offset" : 96,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "FT_MemoryRec_",
   "name" : "FT_MemoryRec_",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/ftsystem.h",
   "unique_id" : "FT_MemoryRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-114"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "horiResolution",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "vertResolution",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "FT_Size_RequestRec_",
   "name" : "FT_Size_RequestRec_",
   "referenced_type" : "type-113",
   "self_type" : "type-113",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_Size_RequestRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_standard_encoding",
     "referenced_type" : "type-1152"
    },
    {
     "field_name" : "load_private_dict",
     "field_offset" : 32,
     "referenced_type" : "type-1154"
    },
    {
     "field_name" : "fd_select_get",
     "field_offset" : 64,
     "referenced_type" : "type-1158"
    },
    {
     "field_name" : "blend_check_vector",
     "field_offset" : 96,
     "referenced_type" : "type-1161"
    },
    {
     "field_name" : "blend_build_vector",
     "field_offset" : 128,
     "referenced_type" : "type-1164"
    }
   ],
   "linker_set_key" : "FT_Service_CFFLoadRec_",
   "name" : "FT_Service_CFFLoadRec_",
   "referenced_type" : "type-1151",
   "self_type" : "type-1151",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/internal/services/svcfftl.h",
   "unique_id" : "FT_Service_CFFLoadRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "memory",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "max_points",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "max_contours",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "max_subglyphs",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "use_extra",
     "field_offset" : 128,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "base",
     "field_offset" : 160,
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "current",
     "field_offset" : 448,
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "other",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "FT_GlyphLoaderRec_",
   "name" : "FT_GlyphLoaderRec_",
   "referenced_type" : "type-118",
   "self_type" : "type-118",
   "size" : 96,
   "source_file" : "/external/freetype/include/freetype/internal/ftgloadr.h",
   "unique_id" : "FT_GlyphLoaderRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "outline",
     "referenced_type" : "type-120"
    },
    {
     "field_name" : "extra_points",
     "field_offset" : 160,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "extra_points2",
     "field_offset" : 192,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "num_subglyphs",
     "field_offset" : 224,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "subglyphs",
     "field_offset" : 256,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "FT_GlyphLoadRec_",
   "name" : "FT_GlyphLoadRec_",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 36,
   "source_file" : "/external/freetype/include/freetype/internal/ftgloadr.h",
   "unique_id" : "FT_GlyphLoadRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_contours",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "n_points",
     "field_offset" : 16,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "points",
     "field_offset" : 32,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "tags",
     "field_offset" : 64,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "contours",
     "field_offset" : 96,
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "FT_Outline_",
   "name" : "FT_Outline_",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_Outline_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "arg1",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "arg2",
     "field_offset" : 96,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "transform",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "FT_SubGlyphRec_",
   "name" : "FT_SubGlyphRec_",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/internal/ftgloadr.h",
   "unique_id" : "FT_SubGlyphRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "transform_matrix",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "transform_delta",
     "field_offset" : 128,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "transform_flags",
     "field_offset" : 192,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "services",
     "field_offset" : 224,
     "referenced_type" : "type-126"
    },
    {
     "field_name" : "no_stem_darkening",
     "field_offset" : 416,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "random_seed",
     "field_offset" : 448,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "refcount",
     "field_offset" : 480,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "FT_Face_InternalRec_",
   "name" : "FT_Face_InternalRec_",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 64,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_Face_InternalRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "service_POSTSCRIPT_FONT_NAME",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "service_MULTI_MASTERS",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "service_METRICS_VARIATIONS",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "service_GLYPH_DICT",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "service_PFR_METRICS",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "service_WINFNT",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "FT_ServiceCacheRec_",
   "name" : "FT_ServiceCacheRec_",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/internal/ftserv.h",
   "unique_id" : "FT_ServiceCacheRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-1263"
    },
    {
     "field_name" : "u",
     "field_offset" : 32,
     "referenced_type" : "type-1265"
    }
   ],
   "linker_set_key" : "BDF_PropertyRec_",
   "name" : "BDF_PropertyRec_",
   "referenced_type" : "type-1264",
   "self_type" : "type-1264",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/ftbdf.h",
   "unique_id" : "BDF_PropertyRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "atom",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "integer",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "cardinal",
     "referenced_type" : "type-37"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "BDF_PropertyRec_::(anonymous union at external/freetype/include/freetype/ftbdf.h:121:5) at external/freetype/include/freetype/ftbdf.h:121:5",
   "name" : "BDF_PropertyRec_::(anonymous union at external/freetype/include/freetype/ftbdf.h:121:5) at external/freetype/include/freetype/ftbdf.h:121:5",
   "record_kind" : "union",
   "referenced_type" : "type-1265",
   "self_type" : "type-1265",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/ftbdf.h",
   "unique_id" : "BDF_PropertyRec_::(anonymous union at external/freetype/include/freetype/ftbdf.h:121:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_charset_id",
     "referenced_type" : "type-1267"
    },
    {
     "field_name" : "get_property",
     "field_offset" : 32,
     "referenced_type" : "type-1269"
    }
   ],
   "linker_set_key" : "FT_Service_BDFRec_",
   "name" : "FT_Service_BDFRec_",
   "referenced_type" : "type-1266",
   "self_type" : "type-1266",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/services/svbdf.h",
   "unique_id" : "FT_Service_BDFRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "horiBearingX",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "horiBearingY",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "horiAdvance",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "vertBearingX",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "vertBearingY",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "vertAdvance",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_Glyph_Metrics_",
   "name" : "FT_Glyph_Metrics_",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_Glyph_Metrics_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rows",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "pitch",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 96,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "num_grays",
     "field_offset" : 128,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "pixel_mode",
     "field_offset" : 144,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "palette_mode",
     "field_offset" : 152,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "palette",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "FT_Bitmap_",
   "name" : "FT_Bitmap_",
   "referenced_type" : "type-129",
   "self_type" : "type-129",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_Bitmap_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "xx",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "xy",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "yx",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "yy",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_Matrix_",
   "name" : "FT_Matrix_",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/fttypes.h",
   "unique_id" : "FT_Matrix_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "loader",
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "flags",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "glyph_transformed",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "glyph_matrix",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "glyph_delta",
     "field_offset" : 224,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "glyph_hints",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "load_flags",
     "field_offset" : 320,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "FT_Slot_InternalRec_",
   "name" : "FT_Slot_InternalRec_",
   "referenced_type" : "type-131",
   "self_type" : "type-131",
   "size" : 44,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_Slot_InternalRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "glyph_format",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "raster_new",
     "field_offset" : 32,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "raster_reset",
     "field_offset" : 64,
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "raster_set_mode",
     "field_offset" : 96,
     "referenced_type" : "type-148"
    },
    {
     "field_name" : "raster_render",
     "field_offset" : 128,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "raster_done",
     "field_offset" : 160,
     "referenced_type" : "type-166"
    }
   ],
   "linker_set_key" : "FT_Raster_Funcs_",
   "name" : "FT_Raster_Funcs_",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_Raster_Funcs_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "target",
     "referenced_type" : "type-155"
    },
    {
     "field_name" : "source",
     "field_offset" : 32,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "gray_spans",
     "field_offset" : 96,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "black_spans",
     "field_offset" : 128,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "bit_test",
     "field_offset" : 160,
     "referenced_type" : "type-162"
    },
    {
     "field_name" : "bit_set",
     "field_offset" : 192,
     "referenced_type" : "type-164"
    },
    {
     "field_name" : "user",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "clip_box",
     "field_offset" : 256,
     "referenced_type" : "type-66"
    }
   ],
   "linker_set_key" : "FT_Raster_Params_",
   "name" : "FT_Raster_Params_",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 48,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_Raster_Params_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "len",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "coverage",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "FT_Span_",
   "name" : "FT_Span_",
   "referenced_type" : "type-161",
   "self_type" : "type-161",
   "size" : 6,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_Span_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "glyph_size",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "glyph_format",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "glyph_init",
     "field_offset" : 64,
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "glyph_done",
     "field_offset" : 96,
     "referenced_type" : "type-175"
    },
    {
     "field_name" : "glyph_copy",
     "field_offset" : 128,
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "glyph_transform",
     "field_offset" : 160,
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "glyph_bbox",
     "field_offset" : 192,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "glyph_prepare",
     "field_offset" : 224,
     "referenced_type" : "type-169"
    }
   ],
   "linker_set_key" : "FT_Glyph_Class_",
   "name" : "FT_Glyph_Class_",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/ftrender.h",
   "unique_id" : "FT_Glyph_Class_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "clazz",
     "field_offset" : 96,
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "glyph_format",
     "field_offset" : 128,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "glyph_class",
     "field_offset" : 160,
     "referenced_type" : "type-168"
    },
    {
     "field_name" : "raster",
     "field_offset" : 416,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "raster_render",
     "field_offset" : 448,
     "referenced_type" : "type-150"
    },
    {
     "field_name" : "render",
     "field_offset" : 480,
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "FT_RendererRec_",
   "name" : "FT_RendererRec_",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 64,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_RendererRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "library",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "clazz",
     "field_offset" : 32,
     "referenced_type" : "type-173"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "advance",
     "field_offset" : 96,
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "FT_GlyphRec_",
   "name" : "FT_GlyphRec_",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/ftglyph.h",
   "unique_id" : "FT_GlyphRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "clazz",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "library",
     "field_offset" : 32,
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "memory",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "FT_ModuleRec_",
   "name" : "FT_ModuleRec_",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_ModuleRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "module_flags",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "module_size",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "module_name",
     "field_offset" : 64,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "module_version",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "module_requires",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "module_interface",
     "field_offset" : 160,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "module_init",
     "field_offset" : 192,
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "module_done",
     "field_offset" : 224,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "get_interface",
     "field_offset" : 256,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "FT_Module_Class_",
   "name" : "FT_Module_Class_",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 36,
   "source_file" : "/external/freetype/include/freetype/ftmodapi.h",
   "unique_id" : "FT_Module_Class_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_location",
     "referenced_type" : "type-2020"
    }
   ],
   "linker_set_key" : "FT_Service_TTGlyfRec_",
   "name" : "FT_Service_TTGlyfRec_",
   "referenced_type" : "type-2019",
   "self_type" : "type-2019",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/services/svttglyf.h",
   "unique_id" : "FT_Service_TTGlyfRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ps_get_font_info",
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "ps_get_font_extra",
     "field_offset" : 32,
     "referenced_type" : "type-220"
    },
    {
     "field_name" : "ps_has_glyph_names",
     "field_offset" : 64,
     "referenced_type" : "type-224"
    },
    {
     "field_name" : "ps_get_font_private",
     "field_offset" : 96,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "ps_get_font_value",
     "field_offset" : 128,
     "referenced_type" : "type-235"
    }
   ],
   "linker_set_key" : "FT_Service_PsInfoRec_",
   "name" : "FT_Service_PsInfoRec_",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/internal/services/svpsinfo.h",
   "unique_id" : "FT_Service_PsInfoRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "notice",
     "field_offset" : 32,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "full_name",
     "field_offset" : 64,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "family_name",
     "field_offset" : 96,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "weight",
     "field_offset" : 128,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "italic_angle",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "is_fixed_pitch",
     "field_offset" : 192,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "underline_position",
     "field_offset" : 208,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "underline_thickness",
     "field_offset" : 224,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "PS_FontInfoRec_",
   "name" : "PS_FontInfoRec_",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/t1tables.h",
   "unique_id" : "PS_FontInfoRec_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "fs_type",
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "PS_FontExtraRec_",
   "name" : "PS_FontExtraRec_",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 2,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "PS_FontExtraRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "unique_id",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "lenIV",
     "field_offset" : 32,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_blue_values",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_other_blues",
     "field_offset" : 72,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_family_blues",
     "field_offset" : 80,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_family_other_blues",
     "field_offset" : 88,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "blue_values",
     "field_offset" : 96,
     "referenced_type" : "type-230"
    },
    {
     "field_name" : "other_blues",
     "field_offset" : 320,
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "family_blues",
     "field_offset" : 480,
     "referenced_type" : "type-230"
    },
    {
     "field_name" : "family_other_blues",
     "field_offset" : 704,
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "blue_scale",
     "field_offset" : 864,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "blue_shift",
     "field_offset" : 896,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "blue_fuzz",
     "field_offset" : 928,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "standard_width",
     "field_offset" : 960,
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "standard_height",
     "field_offset" : 976,
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "num_snap_widths",
     "field_offset" : 992,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_snap_heights",
     "field_offset" : 1000,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "force_bold",
     "field_offset" : 1008,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "round_stem_up",
     "field_offset" : 1016,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "snap_widths",
     "field_offset" : 1024,
     "referenced_type" : "type-233"
    },
    {
     "field_name" : "snap_heights",
     "field_offset" : 1232,
     "referenced_type" : "type-233"
    },
    {
     "field_name" : "expansion_factor",
     "field_offset" : 1440,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "language_group",
     "field_offset" : 1472,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "password",
     "field_offset" : 1504,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "min_feature",
     "field_offset" : 1536,
     "referenced_type" : "type-234"
    }
   ],
   "linker_set_key" : "PS_PrivateRec_",
   "name" : "PS_PrivateRec_",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 196,
   "source_file" : "/external/freetype/include/freetype/t1tables.h",
   "unique_id" : "PS_PrivateRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_axis",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_designs",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "axis",
     "field_offset" : 64,
     "referenced_type" : "type-267"
    }
   ],
   "linker_set_key" : "FT_Multi_Master_",
   "name" : "FT_Multi_Master_",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 56,
   "source_file" : "/external/freetype/include/freetype/ftmm.h",
   "unique_id" : "FT_Multi_Master_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "minimum",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "maximum",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_MM_Axis_",
   "name" : "FT_MM_Axis_",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/ftmm.h",
   "unique_id" : "FT_MM_Axis_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_axis",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_designs",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_namedstyles",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "axis",
     "field_offset" : 96,
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "namedstyle",
     "field_offset" : 128,
     "referenced_type" : "type-273"
    }
   ],
   "linker_set_key" : "FT_MM_Var_",
   "name" : "FT_MM_Var_",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/ftmm.h",
   "unique_id" : "FT_MM_Var_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "minimum",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "def",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "maximum",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "strid",
     "field_offset" : 160,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "FT_Var_Axis_",
   "name" : "FT_Var_Axis_",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/ftmm.h",
   "unique_id" : "FT_Var_Axis_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coords",
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "strid",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "psid",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "FT_Var_Named_Style_",
   "name" : "FT_Var_Named_Style_",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/ftmm.h",
   "unique_id" : "FT_Var_Named_Style_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "memory_base",
     "field_offset" : 32,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "memory_size",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pathname",
     "field_offset" : 96,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "stream",
     "field_offset" : 128,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "driver",
     "field_offset" : 160,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "num_params",
     "field_offset" : 192,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "params",
     "field_offset" : 224,
     "referenced_type" : "type-88"
    }
   ],
   "linker_set_key" : "FT_Open_Args_",
   "name" : "FT_Open_Args_",
   "referenced_type" : "type-278",
   "self_type" : "type-278",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_Open_Args_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_mm",
     "referenced_type" : "type-282"
    },
    {
     "field_name" : "set_mm_design",
     "field_offset" : 32,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "set_mm_blend",
     "field_offset" : 64,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "get_mm_blend",
     "field_offset" : 96,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "get_mm_var",
     "field_offset" : 128,
     "referenced_type" : "type-286"
    },
    {
     "field_name" : "set_var_design",
     "field_offset" : 160,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "get_var_design",
     "field_offset" : 192,
     "referenced_type" : "type-284"
    },
    {
     "field_name" : "set_instance",
     "field_offset" : 224,
     "referenced_type" : "type-288"
    },
    {
     "field_name" : "get_var_blend",
     "field_offset" : 256,
     "referenced_type" : "type-290"
    },
    {
     "field_name" : "done_blend",
     "field_offset" : 288,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "FT_Service_MultiMastersRec_",
   "name" : "FT_Service_MultiMastersRec_",
   "referenced_type" : "type-281",
   "self_type" : "type-281",
   "size" : 40,
   "source_file" : "/external/freetype/include/freetype/internal/services/svmm.h",
   "unique_id" : "FT_Service_MultiMastersRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hadvance_adjust",
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "lsb_adjust",
     "field_offset" : 32,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "rsb_adjust",
     "field_offset" : 64,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "vadvance_adjust",
     "field_offset" : 96,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "tsb_adjust",
     "field_offset" : 128,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "bsb_adjust",
     "field_offset" : 160,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "vorg_adjust",
     "field_offset" : 192,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "metrics_adjust",
     "field_offset" : 224,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "FT_Service_MetricsVariationsRec_",
   "name" : "FT_Service_MetricsVariationsRec_",
   "referenced_type" : "type-295",
   "self_type" : "type-295",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/internal/services/svmetric.h",
   "unique_id" : "FT_Service_MetricsVariationsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_layers",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "layer",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "p",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "FT_LayerIterator_",
   "name" : "FT_LayerIterator_",
   "referenced_type" : "type-299",
   "self_type" : "type-299",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_LayerIterator_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "left",
     "field_offset" : 160,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "top",
     "field_offset" : 192,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "bitmap",
     "field_offset" : 224,
     "referenced_type" : "type-129"
    }
   ],
   "linker_set_key" : "FT_BitmapGlyphRec_",
   "name" : "FT_BitmapGlyphRec_",
   "referenced_type" : "type-305",
   "self_type" : "type-305",
   "size" : 52,
   "source_file" : "/external/freetype/include/freetype/ftglyph.h",
   "unique_id" : "FT_BitmapGlyphRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "outline",
     "field_offset" : 160,
     "referenced_type" : "type-120"
    }
   ],
   "linker_set_key" : "FT_OutlineGlyphRec_",
   "name" : "FT_OutlineGlyphRec_",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 40,
   "source_file" : "/external/freetype/include/freetype/ftglyph.h",
   "unique_id" : "FT_OutlineGlyphRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reset_face",
     "referenced_type" : "type-316"
    },
    {
     "field_name" : "get_global_hints",
     "field_offset" : 32,
     "referenced_type" : "type-320"
    },
    {
     "field_name" : "done_global_hints",
     "field_offset" : 64,
     "referenced_type" : "type-323"
    },
    {
     "field_name" : "load_glyph",
     "field_offset" : 96,
     "referenced_type" : "type-325"
    }
   ],
   "linker_set_key" : "FT_AutoHinter_InterfaceRec_",
   "name" : "FT_AutoHinter_InterfaceRec_",
   "referenced_type" : "type-315",
   "self_type" : "type-315",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/autohint.h",
   "unique_id" : "FT_AutoHinter_InterfaceRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "serv_id",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "serv_data",
     "field_offset" : 32,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "FT_ServiceDescRec_",
   "name" : "FT_ServiceDescRec_",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/ftserv.h",
   "unique_id" : "FT_ServiceDescRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "charmap",
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "clazz",
     "field_offset" : 96,
     "referenced_type" : "type-334"
    }
   ],
   "linker_set_key" : "FT_CMapRec_",
   "name" : "FT_CMapRec_",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_CMapRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "init",
     "field_offset" : 32,
     "referenced_type" : "type-337"
    },
    {
     "field_name" : "done",
     "field_offset" : 64,
     "referenced_type" : "type-340"
    },
    {
     "field_name" : "char_index",
     "field_offset" : 96,
     "referenced_type" : "type-342"
    },
    {
     "field_name" : "char_next",
     "field_offset" : 128,
     "referenced_type" : "type-344"
    },
    {
     "field_name" : "char_var_index",
     "field_offset" : 160,
     "referenced_type" : "type-346"
    },
    {
     "field_name" : "char_var_default",
     "field_offset" : 192,
     "referenced_type" : "type-348"
    },
    {
     "field_name" : "variant_list",
     "field_offset" : 224,
     "referenced_type" : "type-350"
    },
    {
     "field_name" : "charvariant_list",
     "field_offset" : 256,
     "referenced_type" : "type-352"
    },
    {
     "field_name" : "variantchar_list",
     "field_offset" : 288,
     "referenced_type" : "type-352"
    }
   ],
   "linker_set_key" : "FT_CMap_ClassRec_",
   "name" : "FT_CMap_ClassRec_",
   "referenced_type" : "type-336",
   "self_type" : "type-336",
   "size" : 40,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_CMap_ClassRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "memory",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "version_major",
     "field_offset" : 32,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "version_minor",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "version_patch",
     "field_offset" : 96,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_modules",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "modules",
     "field_offset" : 160,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "renderers",
     "field_offset" : 1184,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "cur_renderer",
     "field_offset" : 1248,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "auto_hinter",
     "field_offset" : 1280,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "debug_hooks",
     "field_offset" : 1312,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "lcd_geometry",
     "field_offset" : 1440,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "refcount",
     "field_offset" : 1632,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "FT_LibraryRec_",
   "name" : "FT_LibraryRec_",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 208,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_LibraryRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "face",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "map",
     "field_offset" : 32,
     "referenced_type" : "type-370"
    }
   ],
   "linker_set_key" : "FT_Prop_GlyphToScriptMap_",
   "name" : "FT_Prop_GlyphToScriptMap_",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/ftdriver.h",
   "unique_id" : "FT_Prop_GlyphToScriptMap_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "face",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "limit",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "FT_Prop_IncreaseXHeight_",
   "name" : "FT_Prop_IncreaseXHeight_",
   "referenced_type" : "type-374",
   "self_type" : "type-374",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/ftdriver.h",
   "unique_id" : "FT_Prop_IncreaseXHeight_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "set_property",
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "get_property",
     "field_offset" : 32,
     "referenced_type" : "type-378"
    }
   ],
   "linker_set_key" : "FT_Service_PropertiesRec_",
   "name" : "FT_Service_PropertiesRec_",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/services/svprop.h",
   "unique_id" : "FT_Service_PropertiesRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "move_to",
     "referenced_type" : "type-383"
    },
    {
     "field_name" : "line_to",
     "field_offset" : 32,
     "referenced_type" : "type-383"
    },
    {
     "field_name" : "conic_to",
     "field_offset" : 64,
     "referenced_type" : "type-385"
    },
    {
     "field_name" : "cubic_to",
     "field_offset" : 96,
     "referenced_type" : "type-387"
    },
    {
     "field_name" : "shift",
     "field_offset" : 128,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "delta",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_Outline_Funcs_",
   "name" : "FT_Outline_Funcs_",
   "referenced_type" : "type-382",
   "self_type" : "type-382",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_Outline_Funcs_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "tail",
     "field_offset" : 32,
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "FT_ListRec_",
   "name" : "FT_ListRec_",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/fttypes.h",
   "unique_id" : "FT_ListRec_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "y",
     "field_offset" : 16,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "FT_UnitVector_",
   "name" : "FT_UnitVector_",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/fttypes.h",
   "unique_id" : "FT_UnitVector_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pointer",
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "FT_Data_",
   "name" : "FT_Data_",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/fttypes.h",
   "unique_id" : "FT_Data_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "prev",
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "next",
     "field_offset" : 32,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "FT_ListNodeRec_",
   "name" : "FT_ListNodeRec_",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/fttypes.h",
   "unique_id" : "FT_ListNodeRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_ros",
     "referenced_type" : "type-415"
    },
    {
     "field_name" : "get_is_cid",
     "field_offset" : 32,
     "referenced_type" : "type-418"
    },
    {
     "field_name" : "get_cid_from_glyph_index",
     "field_offset" : 64,
     "referenced_type" : "type-420"
    }
   ],
   "linker_set_key" : "FT_Service_CIDRec_",
   "name" : "FT_Service_CIDRec_",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/services/svcid.h",
   "unique_id" : "FT_Service_CIDRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Table_Version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "Font_Revision",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "CheckSum_Adjust",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "Magic_Number",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "Flags",
     "field_offset" : 128,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "Units_Per_EM",
     "field_offset" : 144,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "Created",
     "field_offset" : 160,
     "referenced_type" : "type-439"
    },
    {
     "field_name" : "Modified",
     "field_offset" : 224,
     "referenced_type" : "type-439"
    },
    {
     "field_name" : "xMin",
     "field_offset" : 288,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "yMin",
     "field_offset" : 304,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "xMax",
     "field_offset" : 320,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "yMax",
     "field_offset" : 336,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Mac_Style",
     "field_offset" : 352,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "Lowest_Rec_PPEM",
     "field_offset" : 368,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "Font_Direction",
     "field_offset" : 384,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Index_To_Loc_Format",
     "field_offset" : 400,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Glyph_Data_Format",
     "field_offset" : 416,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "TT_Header_",
   "name" : "TT_Header_",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 56,
   "source_file" : "/external/freetype/include/freetype/tttables.h",
   "unique_id" : "TT_Header_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "Ascender",
     "field_offset" : 32,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Descender",
     "field_offset" : 48,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Line_Gap",
     "field_offset" : 64,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "advance_Width_Max",
     "field_offset" : 80,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "min_Left_Side_Bearing",
     "field_offset" : 96,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "min_Right_Side_Bearing",
     "field_offset" : 112,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "xMax_Extent",
     "field_offset" : 128,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "caret_Slope_Rise",
     "field_offset" : 144,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "caret_Slope_Run",
     "field_offset" : 160,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "caret_Offset",
     "field_offset" : 176,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Reserved",
     "field_offset" : 192,
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "metric_Data_Format",
     "field_offset" : 256,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "number_Of_HMetrics",
     "field_offset" : 272,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "long_metrics",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "short_metrics",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "TT_HoriHeader_",
   "name" : "TT_HoriHeader_",
   "referenced_type" : "type-440",
   "self_type" : "type-440",
   "size" : 44,
   "source_file" : "/external/freetype/include/freetype/tttables.h",
   "unique_id" : "TT_HoriHeader_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "Ascender",
     "field_offset" : 32,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Descender",
     "field_offset" : 48,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Line_Gap",
     "field_offset" : 64,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "advance_Height_Max",
     "field_offset" : 80,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "min_Top_Side_Bearing",
     "field_offset" : 96,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "min_Bottom_Side_Bearing",
     "field_offset" : 112,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "yMax_Extent",
     "field_offset" : 128,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "caret_Slope_Rise",
     "field_offset" : 144,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "caret_Slope_Run",
     "field_offset" : 160,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "caret_Offset",
     "field_offset" : 176,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "Reserved",
     "field_offset" : 192,
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "metric_Data_Format",
     "field_offset" : 256,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "number_Of_VMetrics",
     "field_offset" : 272,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "long_metrics",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "short_metrics",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "TT_VertHeader_",
   "name" : "TT_VertHeader_",
   "referenced_type" : "type-442",
   "self_type" : "type-442",
   "size" : 44,
   "source_file" : "/external/freetype/include/freetype/tttables.h",
   "unique_id" : "TT_VertHeader_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "xAvgCharWidth",
     "field_offset" : 16,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "usWeightClass",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usWidthClass",
     "field_offset" : 48,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "fsType",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "ySubscriptXSize",
     "field_offset" : 80,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "ySubscriptYSize",
     "field_offset" : 96,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "ySubscriptXOffset",
     "field_offset" : 112,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "ySubscriptYOffset",
     "field_offset" : 128,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "ySuperscriptXSize",
     "field_offset" : 144,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "ySuperscriptYSize",
     "field_offset" : 160,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "ySuperscriptXOffset",
     "field_offset" : 176,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "ySuperscriptYOffset",
     "field_offset" : 192,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "yStrikeoutSize",
     "field_offset" : 208,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "yStrikeoutPosition",
     "field_offset" : 224,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "sFamilyClass",
     "field_offset" : 240,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "panose",
     "field_offset" : 256,
     "referenced_type" : "type-444"
    },
    {
     "field_name" : "ulUnicodeRange1",
     "field_offset" : 352,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "ulUnicodeRange2",
     "field_offset" : 384,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "ulUnicodeRange3",
     "field_offset" : 416,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "ulUnicodeRange4",
     "field_offset" : 448,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "achVendID",
     "field_offset" : 480,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "fsSelection",
     "field_offset" : 512,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usFirstCharIndex",
     "field_offset" : 528,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usLastCharIndex",
     "field_offset" : 544,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "sTypoAscender",
     "field_offset" : 560,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "sTypoDescender",
     "field_offset" : 576,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "sTypoLineGap",
     "field_offset" : 592,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "usWinAscent",
     "field_offset" : 608,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usWinDescent",
     "field_offset" : 624,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "ulCodePageRange1",
     "field_offset" : 640,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "ulCodePageRange2",
     "field_offset" : 672,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sxHeight",
     "field_offset" : 704,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "sCapHeight",
     "field_offset" : 720,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "usDefaultChar",
     "field_offset" : 736,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usBreakChar",
     "field_offset" : 752,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usMaxContext",
     "field_offset" : 768,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usLowerOpticalPointSize",
     "field_offset" : 784,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "usUpperOpticalPointSize",
     "field_offset" : 800,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "TT_OS2_",
   "name" : "TT_OS2_",
   "referenced_type" : "type-443",
   "self_type" : "type-443",
   "size" : 104,
   "source_file" : "/external/freetype/include/freetype/tttables.h",
   "unique_id" : "TT_OS2_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "FormatType",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "italicAngle",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "underlinePosition",
     "field_offset" : 64,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "underlineThickness",
     "field_offset" : 80,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "isFixedPitch",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "minMemType42",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "maxMemType42",
     "field_offset" : 160,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "minMemType1",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "maxMemType1",
     "field_offset" : 224,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "TT_Postscript_",
   "name" : "TT_Postscript_",
   "referenced_type" : "type-446",
   "self_type" : "type-446",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/tttables.h",
   "unique_id" : "TT_Postscript_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "FontNumber",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "Pitch",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "xHeight",
     "field_offset" : 80,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "Style",
     "field_offset" : 96,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "TypeFamily",
     "field_offset" : 112,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "CapHeight",
     "field_offset" : 128,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "SymbolSet",
     "field_offset" : 144,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "TypeFace",
     "field_offset" : 160,
     "referenced_type" : "type-448"
    },
    {
     "field_name" : "CharacterComplement",
     "field_offset" : 288,
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "FileName",
     "field_offset" : 352,
     "referenced_type" : "type-450"
    },
    {
     "field_name" : "StrokeWeight",
     "field_offset" : 400,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "WidthType",
     "field_offset" : 408,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "SerifStyle",
     "field_offset" : 416,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "Reserved",
     "field_offset" : 424,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "TT_PCLT_",
   "name" : "TT_PCLT_",
   "referenced_type" : "type-447",
   "self_type" : "type-447",
   "size" : 56,
   "source_file" : "/external/freetype/include/freetype/tttables.h",
   "unique_id" : "TT_PCLT_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "numGlyphs",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxPoints",
     "field_offset" : 48,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxContours",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxCompositePoints",
     "field_offset" : 80,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxCompositeContours",
     "field_offset" : 96,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxZones",
     "field_offset" : 112,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxTwilightPoints",
     "field_offset" : 128,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxStorage",
     "field_offset" : 144,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxFunctionDefs",
     "field_offset" : 160,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxInstructionDefs",
     "field_offset" : 176,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxStackElements",
     "field_offset" : 192,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxSizeOfInstructions",
     "field_offset" : 208,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxComponentElements",
     "field_offset" : 224,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "maxComponentDepth",
     "field_offset" : 240,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "TT_MaxProfile_",
   "name" : "TT_MaxProfile_",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/tttables.h",
   "unique_id" : "TT_MaxProfile_"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "blue",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "green",
     "field_offset" : 8,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "red",
     "field_offset" : 16,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 24,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "FT_Color_",
   "name" : "FT_Color_",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/ftcolor.h",
   "unique_id" : "FT_Color_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_palettes",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "palette_name_ids",
     "field_offset" : 32,
     "referenced_type" : "type-455"
    },
    {
     "field_name" : "palette_flags",
     "field_offset" : 64,
     "referenced_type" : "type-455"
    },
    {
     "field_name" : "num_palette_entries",
     "field_offset" : 96,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "palette_entry_name_ids",
     "field_offset" : 128,
     "referenced_type" : "type-455"
    }
   ],
   "linker_set_key" : "FT_Palette_Data_",
   "name" : "FT_Palette_Data_",
   "referenced_type" : "type-454",
   "self_type" : "type-454",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/ftcolor.h",
   "unique_id" : "FT_Palette_Data_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_Vector_",
   "name" : "FT_Vector_",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_Vector_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "design_points",
     "field_offset" : 32,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "blend_points",
     "field_offset" : 64,
     "referenced_type" : "type-109"
    }
   ],
   "linker_set_key" : "PS_DesignMap_",
   "name" : "PS_DesignMap_",
   "referenced_type" : "type-461",
   "self_type" : "type-461",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/t1tables.h",
   "unique_id" : "PS_DesignMap_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_designs",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_axis",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "axis_names",
     "field_offset" : 64,
     "referenced_type" : "type-463"
    },
    {
     "field_name" : "design_pos",
     "field_offset" : 192,
     "referenced_type" : "type-464"
    },
    {
     "field_name" : "design_map",
     "field_offset" : 704,
     "referenced_type" : "type-465"
    },
    {
     "field_name" : "weight_vector",
     "field_offset" : 1088,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "default_weight_vector",
     "field_offset" : 1120,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "font_infos",
     "field_offset" : 1152,
     "referenced_type" : "type-466"
    },
    {
     "field_name" : "privates",
     "field_offset" : 1696,
     "referenced_type" : "type-467"
    },
    {
     "field_name" : "blend_bitflags",
     "field_offset" : 2240,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "bboxes",
     "field_offset" : 2272,
     "referenced_type" : "type-468"
    },
    {
     "field_name" : "default_design_vector",
     "field_offset" : 2816,
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "num_default_design_vector",
     "field_offset" : 3328,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "PS_BlendRec_",
   "name" : "PS_BlendRec_",
   "referenced_type" : "type-462",
   "self_type" : "type-462",
   "size" : 420,
   "source_file" : "/external/freetype/include/freetype/t1tables.h",
   "unique_id" : "PS_BlendRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "private_dict",
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "len_buildchar",
     "field_offset" : 1568,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "forcebold_threshold",
     "field_offset" : 1600,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "stroke_width",
     "field_offset" : 1632,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "expansion_factor",
     "field_offset" : 1664,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "paint_type",
     "field_offset" : 1696,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "font_type",
     "field_offset" : 1704,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "font_matrix",
     "field_offset" : 1728,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "font_offset",
     "field_offset" : 1856,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "num_subrs",
     "field_offset" : 1920,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "subrmap_offset",
     "field_offset" : 1952,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sd_bytes",
     "field_offset" : 1984,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "CID_FaceDictRec_",
   "name" : "CID_FaceDictRec_",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 252,
   "source_file" : "/external/freetype/include/freetype/t1tables.h",
   "unique_id" : "CID_FaceDictRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cid_font_name",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "cid_version",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cid_font_type",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "registry",
     "field_offset" : 96,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "ordering",
     "field_offset" : 128,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "supplement",
     "field_offset" : 160,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "font_info",
     "field_offset" : 192,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "font_bbox",
     "field_offset" : 448,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "uid_base",
     "field_offset" : 576,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_xuid",
     "field_offset" : 608,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "xuid",
     "field_offset" : 640,
     "referenced_type" : "type-472"
    },
    {
     "field_name" : "cidmap_offset",
     "field_offset" : 1152,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "fd_bytes",
     "field_offset" : 1184,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "gd_bytes",
     "field_offset" : 1216,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "cid_count",
     "field_offset" : 1248,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_dicts",
     "field_offset" : 1280,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "font_dicts",
     "field_offset" : 1312,
     "referenced_type" : "type-473"
    },
    {
     "field_name" : "data_offset",
     "field_offset" : 1344,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "CID_FaceInfoRec_",
   "name" : "CID_FaceInfoRec_",
   "referenced_type" : "type-471",
   "self_type" : "type-471",
   "size" : 172,
   "source_file" : "/external/freetype/include/freetype/t1tables.h",
   "unique_id" : "CID_FaceInfoRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "count",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "offsets",
     "field_offset" : 96,
     "referenced_type" : "type-435"
    }
   ],
   "linker_set_key" : "TTC_HeaderRec_",
   "name" : "TTC_HeaderRec_",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TTC_HeaderRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format_tag",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_tables",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "search_range",
     "field_offset" : 48,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "entry_selector",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "range_shift",
     "field_offset" : 80,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "offset",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "SFNT_HeaderRec_",
   "name" : "SFNT_HeaderRec_",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "SFNT_HeaderRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Tag",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "CheckSum",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "Offset",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "Length",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "TT_TableRec_",
   "name" : "TT_TableRec_",
   "referenced_type" : "type-477",
   "self_type" : "type-477",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_TableRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "signature",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "flavor",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_tables",
     "field_offset" : 96,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 112,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "totalSfntSize",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "majorVersion",
     "field_offset" : 160,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "minorVersion",
     "field_offset" : 176,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "metaOffset",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "metaLength",
     "field_offset" : 224,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "metaOrigLength",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "privOffset",
     "field_offset" : 288,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "privLength",
     "field_offset" : 320,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "WOFF_HeaderRec_",
   "name" : "WOFF_HeaderRec_",
   "referenced_type" : "type-478",
   "self_type" : "type-478",
   "size" : 44,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "WOFF_HeaderRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "Tag",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "Offset",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "CompLength",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "OrigLength",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "CheckSum",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "OrigOffset",
     "field_offset" : 160,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "WOFF_TableRec_",
   "name" : "WOFF_TableRec_",
   "referenced_type" : "type-479",
   "self_type" : "type-479",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "WOFF_TableRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "glyph_format",
     "field_offset" : 288,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "render_glyph",
     "field_offset" : 320,
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "transform_glyph",
     "field_offset" : 352,
     "referenced_type" : "type-134"
    },
    {
     "field_name" : "get_glyph_cbox",
     "field_offset" : 384,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "set_mode",
     "field_offset" : 416,
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "raster_class",
     "field_offset" : 448,
     "referenced_type" : "type-139"
    }
   ],
   "linker_set_key" : "FT_Renderer_Class_",
   "name" : "FT_Renderer_Class_",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 60,
   "source_file" : "/external/freetype/include/freetype/ftrender.h",
   "unique_id" : "FT_Renderer_Class_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "advance",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "bearing",
     "field_offset" : 16,
     "referenced_type" : "type-59"
    }
   ],
   "linker_set_key" : "TT_LongMetricsRec_",
   "name" : "TT_LongMetricsRec_",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_LongMetricsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "platformID",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "encodingID",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "languageID",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "nameID",
     "field_offset" : 48,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "stringLength",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "stringOffset",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "string",
     "field_offset" : 128,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "TT_NameRec_",
   "name" : "TT_NameRec_",
   "referenced_type" : "type-481",
   "self_type" : "type-481",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_NameRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stringLength",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "stringOffset",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "string",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "TT_LangTagRec_",
   "name" : "TT_LangTagRec_",
   "referenced_type" : "type-482",
   "self_type" : "type-482",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_LangTagRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "numNameRecords",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "storageOffset",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "names",
     "field_offset" : 96,
     "referenced_type" : "type-484"
    },
    {
     "field_name" : "numLangTagRecords",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "langTags",
     "field_offset" : 160,
     "referenced_type" : "type-485"
    },
    {
     "field_name" : "stream",
     "field_offset" : 192,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "TT_NameTableRec_",
   "name" : "TT_NameTableRec_",
   "referenced_type" : "type-483",
   "self_type" : "type-483",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_NameTableRec_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "maxPPEM",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "gaspFlag",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "TT_GaspRangeRec_",
   "name" : "TT_GaspRangeRec_",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_GaspRangeRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "numRanges",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "gaspRanges",
     "field_offset" : 32,
     "referenced_type" : "type-488"
    }
   ],
   "linker_set_key" : "TT_Gasp_",
   "name" : "TT_Gasp_",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_Gasp_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "height",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "width",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "horiBearingX",
     "field_offset" : 32,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "horiBearingY",
     "field_offset" : 48,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "horiAdvance",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "vertBearingX",
     "field_offset" : 80,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "vertBearingY",
     "field_offset" : 96,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "vertAdvance",
     "field_offset" : 112,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "TT_SBit_MetricsRec_",
   "name" : "TT_SBit_MetricsRec_",
   "referenced_type" : "type-489",
   "self_type" : "type-489",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_SBit_MetricsRec_"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "height",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "width",
     "field_offset" : 8,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "bearingX",
     "field_offset" : 16,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "bearingY",
     "field_offset" : 24,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "advance",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "TT_SBit_Small_Metrics_",
   "name" : "TT_SBit_Small_Metrics_",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 5,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_SBit_Small_Metrics_"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "ascender",
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "descender",
     "field_offset" : 8,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "max_width",
     "field_offset" : 16,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "caret_slope_numerator",
     "field_offset" : 24,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "caret_slope_denominator",
     "field_offset" : 32,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "caret_offset",
     "field_offset" : 40,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "min_origin_SB",
     "field_offset" : 48,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "min_advance_SB",
     "field_offset" : 56,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "max_before_BL",
     "field_offset" : 64,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "min_after_BL",
     "field_offset" : 72,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "pads",
     "field_offset" : 80,
     "referenced_type" : "type-492"
    }
   ],
   "linker_set_key" : "TT_SBit_LineMetricsRec_",
   "name" : "TT_SBit_LineMetricsRec_",
   "referenced_type" : "type-491",
   "self_type" : "type-491",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_SBit_LineMetricsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "first_glyph",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "last_glyph",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "index_format",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "image_format",
     "field_offset" : 48,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "image_offset",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "image_size",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "metrics",
     "field_offset" : 128,
     "referenced_type" : "type-489"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 256,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "glyph_offsets",
     "field_offset" : 288,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "glyph_codes",
     "field_offset" : 320,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "table_offset",
     "field_offset" : 352,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "TT_SBit_RangeRec_",
   "name" : "TT_SBit_RangeRec_",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 48,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_SBit_RangeRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_ranges",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "sbit_ranges",
     "field_offset" : 32,
     "referenced_type" : "type-495"
    },
    {
     "field_name" : "ranges_offset",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "color_ref",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "hori",
     "field_offset" : 128,
     "referenced_type" : "type-491"
    },
    {
     "field_name" : "vert",
     "field_offset" : 224,
     "referenced_type" : "type-491"
    },
    {
     "field_name" : "start_glyph",
     "field_offset" : 320,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "end_glyph",
     "field_offset" : 336,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "x_ppem",
     "field_offset" : 352,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "y_ppem",
     "field_offset" : 360,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "bit_depth",
     "field_offset" : 368,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "flags",
     "field_offset" : 376,
     "referenced_type" : "type-127"
    }
   ],
   "linker_set_key" : "TT_SBit_StrikeRec_",
   "name" : "TT_SBit_StrikeRec_",
   "referenced_type" : "type-494",
   "self_type" : "type-494",
   "size" : 48,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_SBit_StrikeRec_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "glyph_code",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "x_offset",
     "field_offset" : 16,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "y_offset",
     "field_offset" : 24,
     "referenced_type" : "type-127"
    }
   ],
   "linker_set_key" : "TT_SBit_ComponentRec_",
   "name" : "TT_SBit_ComponentRec_",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_SBit_ComponentRec_"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "hori",
     "referenced_type" : "type-491"
    },
    {
     "field_name" : "vert",
     "field_offset" : 96,
     "referenced_type" : "type-491"
    },
    {
     "field_name" : "x_ppem",
     "field_offset" : 192,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "y_ppem",
     "field_offset" : 200,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "x_ppem_substitute",
     "field_offset" : 208,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "y_ppem_substitute",
     "field_offset" : 216,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "TT_SBit_ScaleRec_",
   "name" : "TT_SBit_ScaleRec_",
   "referenced_type" : "type-497",
   "self_type" : "type-497",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_SBit_ScaleRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_glyphs",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "num_names",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "glyph_indices",
     "field_offset" : 32,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "glyph_names",
     "field_offset" : 64,
     "referenced_type" : "type-499"
    }
   ],
   "linker_set_key" : "TT_Post_20Rec_",
   "name" : "TT_Post_20Rec_",
   "referenced_type" : "type-498",
   "self_type" : "type-498",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_Post_20Rec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_glyphs",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "offsets",
     "field_offset" : 32,
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "TT_Post_25_",
   "name" : "TT_Post_25_",
   "referenced_type" : "type-501",
   "self_type" : "type-501",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_Post_25_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "loaded",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "names",
     "field_offset" : 32,
     "referenced_type" : "type-503"
    }
   ],
   "linker_set_key" : "TT_Post_NamesRec_",
   "name" : "TT_Post_NamesRec_",
   "referenced_type" : "type-502",
   "self_type" : "type-502",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_Post_NamesRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format_20",
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "format_25",
     "referenced_type" : "type-501"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "TT_Post_NamesRec_::(anonymous union at external/freetype/include/freetype/internal/tttypes.h:949:5) at external/freetype/include/freetype/internal/tttypes.h:949:5",
   "name" : "TT_Post_NamesRec_::(anonymous union at external/freetype/include/freetype/internal/tttypes.h:949:5) at external/freetype/include/freetype/internal/tttypes.h:949:5",
   "record_kind" : "union",
   "referenced_type" : "type-503",
   "self_type" : "type-503",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_Post_NamesRec_::(anonymous union at external/freetype/include/freetype/internal/tttypes.h:949:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "table",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "table_end",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "strings",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "strings_size",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_strikes",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "loaded",
     "field_offset" : 160,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "TT_BDFRec_",
   "name" : "TT_BDFRec_",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_BDFRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "ttc_header",
     "field_offset" : 1056,
     "referenced_type" : "type-475"
    },
    {
     "field_name" : "format_tag",
     "field_offset" : 1184,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_tables",
     "field_offset" : 1216,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "dir_tables",
     "field_offset" : 1248,
     "referenced_type" : "type-507"
    },
    {
     "field_name" : "header",
     "field_offset" : 1280,
     "referenced_type" : "type-438"
    },
    {
     "field_name" : "horizontal",
     "field_offset" : 1728,
     "referenced_type" : "type-440"
    },
    {
     "field_name" : "max_profile",
     "field_offset" : 2080,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "vertical_info",
     "field_offset" : 2336,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "vertical",
     "field_offset" : 2368,
     "referenced_type" : "type-442"
    },
    {
     "field_name" : "num_names",
     "field_offset" : 2720,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "name_table",
     "field_offset" : 2752,
     "referenced_type" : "type-483"
    },
    {
     "field_name" : "os2",
     "field_offset" : 2976,
     "referenced_type" : "type-443"
    },
    {
     "field_name" : "postscript",
     "field_offset" : 3808,
     "referenced_type" : "type-446"
    },
    {
     "field_name" : "cmap_table",
     "field_offset" : 4064,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "cmap_size",
     "field_offset" : 4096,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "goto_table",
     "field_offset" : 4128,
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "access_glyph_frame",
     "field_offset" : 4160,
     "referenced_type" : "type-511"
    },
    {
     "field_name" : "forget_glyph_frame",
     "field_offset" : 4192,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "read_glyph_header",
     "field_offset" : 4224,
     "referenced_type" : "type-522"
    },
    {
     "field_name" : "read_simple_glyph",
     "field_offset" : 4256,
     "referenced_type" : "type-522"
    },
    {
     "field_name" : "read_composite_glyph",
     "field_offset" : 4288,
     "referenced_type" : "type-522"
    },
    {
     "field_name" : "sfnt",
     "field_offset" : 4320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "psnames",
     "field_offset" : 4352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mm",
     "field_offset" : 4384,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "var",
     "field_offset" : 4416,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "psaux",
     "field_offset" : 4448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "gasp",
     "field_offset" : 4480,
     "referenced_type" : "type-487"
    },
    {
     "field_name" : "pclt",
     "field_offset" : 4544,
     "referenced_type" : "type-447"
    },
    {
     "field_name" : "num_sbit_scales",
     "field_offset" : 4992,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sbit_scales",
     "field_offset" : 5024,
     "referenced_type" : "type-524"
    },
    {
     "field_name" : "postscript_names",
     "field_offset" : 5056,
     "referenced_type" : "type-502"
    },
    {
     "field_name" : "palette_data",
     "field_offset" : 5184,
     "referenced_type" : "type-454"
    },
    {
     "field_name" : "palette_index",
     "field_offset" : 5344,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "palette",
     "field_offset" : 5376,
     "referenced_type" : "type-458"
    },
    {
     "field_name" : "have_foreground_color",
     "field_offset" : 5408,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "foreground_color",
     "field_offset" : 5416,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "font_program_size",
     "field_offset" : 5472,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "font_program",
     "field_offset" : 5504,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "cvt_program_size",
     "field_offset" : 5536,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "cvt_program",
     "field_offset" : 5568,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "cvt_size",
     "field_offset" : 5600,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "cvt",
     "field_offset" : 5632,
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "interpreter",
     "field_offset" : 5664,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "extra",
     "field_offset" : 5696,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "postscript_name",
     "field_offset" : 5760,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "glyf_len",
     "field_offset" : 5792,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "glyf_offset",
     "field_offset" : 5824,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "is_cff2",
     "field_offset" : 5856,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "doblend",
     "field_offset" : 5864,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "blend",
     "field_offset" : 5888,
     "referenced_type" : "type-527"
    },
    {
     "field_name" : "variation_support",
     "field_offset" : 5920,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "var_postscript_prefix",
     "field_offset" : 5952,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "var_postscript_prefix_len",
     "field_offset" : 5984,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "horz_metrics_size",
     "field_offset" : 6016,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "vert_metrics_size",
     "field_offset" : 6048,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_locations",
     "field_offset" : 6080,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "glyph_locations",
     "field_offset" : 6112,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "hdmx_table",
     "field_offset" : 6144,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "hdmx_table_size",
     "field_offset" : 6176,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "hdmx_record_count",
     "field_offset" : 6208,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "hdmx_record_size",
     "field_offset" : 6240,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "hdmx_record_sizes",
     "field_offset" : 6272,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "sbit_table",
     "field_offset" : 6304,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "sbit_table_size",
     "field_offset" : 6336,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sbit_table_type",
     "field_offset" : 6368,
     "referenced_type" : "type-505"
    },
    {
     "field_name" : "sbit_num_strikes",
     "field_offset" : 6400,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "sbit_strike_map",
     "field_offset" : 6432,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "kern_table",
     "field_offset" : 6464,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "kern_table_size",
     "field_offset" : 6496,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_kern_tables",
     "field_offset" : 6528,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "kern_avail_bits",
     "field_offset" : 6560,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "kern_order_bits",
     "field_offset" : 6592,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "bdf",
     "field_offset" : 6624,
     "referenced_type" : "type-504"
    },
    {
     "field_name" : "horz_metrics_offset",
     "field_offset" : 6816,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "vert_metrics_offset",
     "field_offset" : 6848,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "ebdt_start",
     "field_offset" : 6880,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "ebdt_size",
     "field_offset" : 6912,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "cpal",
     "field_offset" : 6944,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "colr",
     "field_offset" : 6976,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "TT_FaceRec_",
   "name" : "TT_FaceRec_",
   "referenced_type" : "type-506",
   "self_type" : "type-506",
   "size" : 876,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_FaceRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "face",
     "referenced_type" : "type-510"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "glyph",
     "field_offset" : 64,
     "referenced_type" : "type-52"
    },
    {
     "field_name" : "gloader",
     "field_offset" : 96,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "load_flags",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "glyph_index",
     "field_offset" : 160,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "stream",
     "field_offset" : 192,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "byte_len",
     "field_offset" : 224,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "n_contours",
     "field_offset" : 256,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "bbox",
     "field_offset" : 288,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "left_bearing",
     "field_offset" : 416,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "advance",
     "field_offset" : 448,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "linear",
     "field_offset" : 480,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "linear_def",
     "field_offset" : 512,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "pp1",
     "field_offset" : 544,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "pp2",
     "field_offset" : 608,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "base",
     "field_offset" : 672,
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "zone",
     "field_offset" : 960,
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "exec",
     "field_offset" : 1248,
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "instructions",
     "field_offset" : 1280,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "ins_pos",
     "field_offset" : 1312,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "other",
     "field_offset" : 1344,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "top_bearing",
     "field_offset" : 1376,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "vadvance",
     "field_offset" : 1408,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "pp3",
     "field_offset" : 1440,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "pp4",
     "field_offset" : 1504,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "cursor",
     "field_offset" : 1568,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "limit",
     "field_offset" : 1600,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "composites",
     "field_offset" : 1632,
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "TT_LoaderRec_",
   "name" : "TT_LoaderRec_",
   "referenced_type" : "type-514",
   "self_type" : "type-514",
   "size" : 212,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_LoaderRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "memory",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "max_points",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "max_contours",
     "field_offset" : 48,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "n_points",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "n_contours",
     "field_offset" : 80,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "org",
     "field_offset" : 96,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "cur",
     "field_offset" : 128,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "orus",
     "field_offset" : 160,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "tags",
     "field_offset" : 192,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "contours",
     "field_offset" : 224,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "first_point",
     "field_offset" : 256,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "TT_GlyphZoneRec_",
   "name" : "TT_GlyphZoneRec_",
   "referenced_type" : "type-517",
   "self_type" : "type-517",
   "size" : 36,
   "source_file" : "/external/freetype/include/freetype/internal/tttypes.h",
   "unique_id" : "TT_GlyphZoneRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "goto_table",
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "init_face",
     "field_offset" : 32,
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "load_face",
     "field_offset" : 64,
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "done_face",
     "field_offset" : 96,
     "referenced_type" : "type-532"
    },
    {
     "field_name" : "get_interface",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "load_any",
     "field_offset" : 160,
     "referenced_type" : "type-534"
    },
    {
     "field_name" : "load_head",
     "field_offset" : 192,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_hhea",
     "field_offset" : 224,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "load_cmap",
     "field_offset" : 256,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_maxp",
     "field_offset" : 288,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_os2",
     "field_offset" : 320,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_post",
     "field_offset" : 352,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_name",
     "field_offset" : 384,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "free_name",
     "field_offset" : 416,
     "referenced_type" : "type-532"
    },
    {
     "field_name" : "load_kern",
     "field_offset" : 448,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_gasp",
     "field_offset" : 480,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_pclt",
     "field_offset" : 512,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_bhed",
     "field_offset" : 544,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_sbit_image",
     "field_offset" : 576,
     "referenced_type" : "type-540"
    },
    {
     "field_name" : "get_psname",
     "field_offset" : 608,
     "referenced_type" : "type-544"
    },
    {
     "field_name" : "free_psnames",
     "field_offset" : 640,
     "referenced_type" : "type-532"
    },
    {
     "field_name" : "get_kerning",
     "field_offset" : 672,
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "load_font_dir",
     "field_offset" : 704,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_hmtx",
     "field_offset" : 736,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "load_eblc",
     "field_offset" : 768,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "free_eblc",
     "field_offset" : 800,
     "referenced_type" : "type-532"
    },
    {
     "field_name" : "set_sbit_strike",
     "field_offset" : 832,
     "referenced_type" : "type-549"
    },
    {
     "field_name" : "load_strike_metrics",
     "field_offset" : 864,
     "referenced_type" : "type-551"
    },
    {
     "field_name" : "load_cpal",
     "field_offset" : 896,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "load_colr",
     "field_offset" : 928,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "free_cpal",
     "field_offset" : 960,
     "referenced_type" : "type-532"
    },
    {
     "field_name" : "free_colr",
     "field_offset" : 992,
     "referenced_type" : "type-532"
    },
    {
     "field_name" : "set_palette",
     "field_offset" : 1024,
     "referenced_type" : "type-554"
    },
    {
     "field_name" : "get_colr_layer",
     "field_offset" : 1056,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "colr_blend",
     "field_offset" : 1088,
     "referenced_type" : "type-558"
    },
    {
     "field_name" : "get_metrics",
     "field_offset" : 1120,
     "referenced_type" : "type-560"
    },
    {
     "field_name" : "get_name",
     "field_offset" : 1152,
     "referenced_type" : "type-562"
    },
    {
     "field_name" : "get_name_id",
     "field_offset" : 1184,
     "referenced_type" : "type-564"
    }
   ],
   "linker_set_key" : "SFNT_Interface_",
   "name" : "SFNT_Interface_",
   "referenced_type" : "type-529",
   "self_type" : "type-529",
   "size" : 152,
   "source_file" : "/external/freetype/include/freetype/internal/sfnt.h",
   "unique_id" : "SFNT_Interface_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "library",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "face",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "next",
     "field_offset" : 64,
     "referenced_type" : "type-52"
    },
    {
     "field_name" : "glyph_index",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "generic",
     "field_offset" : 128,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "metrics",
     "field_offset" : 192,
     "referenced_type" : "type-128"
    },
    {
     "field_name" : "linearHoriAdvance",
     "field_offset" : 448,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "linearVertAdvance",
     "field_offset" : 480,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "advance",
     "field_offset" : 512,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "format",
     "field_offset" : 576,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "bitmap",
     "field_offset" : 608,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "bitmap_left",
     "field_offset" : 800,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "bitmap_top",
     "field_offset" : 832,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "outline",
     "field_offset" : 864,
     "referenced_type" : "type-120"
    },
    {
     "field_name" : "num_subglyphs",
     "field_offset" : 1024,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "subglyphs",
     "field_offset" : 1056,
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "control_data",
     "field_offset" : 1088,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "control_len",
     "field_offset" : 1120,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "lsb_delta",
     "field_offset" : 1152,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "rsb_delta",
     "field_offset" : 1184,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "other",
     "field_offset" : 1216,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "internal",
     "field_offset" : 1248,
     "referenced_type" : "type-130"
    }
   ],
   "linker_set_key" : "FT_GlyphSlotRec_",
   "name" : "FT_GlyphSlotRec_",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 160,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_GlyphSlotRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_faces",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "face_index",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "face_flags",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "style_flags",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "family_name",
     "field_offset" : 160,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "style_name",
     "field_offset" : 192,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "num_fixed_sizes",
     "field_offset" : 224,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "available_sizes",
     "field_offset" : 256,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "num_charmaps",
     "field_offset" : 288,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "charmaps",
     "field_offset" : 320,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "generic",
     "field_offset" : 352,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "bbox",
     "field_offset" : 416,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "units_per_EM",
     "field_offset" : 544,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "ascender",
     "field_offset" : 560,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "descender",
     "field_offset" : 576,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "height",
     "field_offset" : 592,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "max_advance_width",
     "field_offset" : 608,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "max_advance_height",
     "field_offset" : 624,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "underline_position",
     "field_offset" : 640,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "underline_thickness",
     "field_offset" : 656,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "glyph",
     "field_offset" : 672,
     "referenced_type" : "type-52"
    },
    {
     "field_name" : "size",
     "field_offset" : 704,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "charmap",
     "field_offset" : 736,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "driver",
     "field_offset" : 768,
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "memory",
     "field_offset" : 800,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "stream",
     "field_offset" : 832,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "sizes_list",
     "field_offset" : 864,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "autohint",
     "field_offset" : 928,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "extensions",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "internal",
     "field_offset" : 1024,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "FT_FaceRec_",
   "name" : "FT_FaceRec_",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 132,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_FaceRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "str",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "FT_Hashkey_",
   "name" : "FT_Hashkey_",
   "record_kind" : "union",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/fthash.h",
   "unique_id" : "FT_Hashkey_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "FT_HashnodeRec_",
   "name" : "FT_HashnodeRec_",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/fthash.h",
   "unique_id" : "FT_HashnodeRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "limit",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "used",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "lookup",
     "field_offset" : 96,
     "referenced_type" : "type-569"
    },
    {
     "field_name" : "compare",
     "field_offset" : 128,
     "referenced_type" : "type-572"
    },
    {
     "field_name" : "table",
     "field_offset" : 160,
     "referenced_type" : "type-574"
    }
   ],
   "linker_set_key" : "FT_HashRec_",
   "name" : "FT_HashRec_",
   "referenced_type" : "type-568",
   "self_type" : "type-568",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/internal/fthash.h",
   "unique_id" : "FT_HashRec_"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "size",
     "field_offset" : 8,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "offset",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "FT_Frame_Field_",
   "name" : "FT_Frame_Field_",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/ftstream.h",
   "unique_id" : "FT_Frame_Field_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "height",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "width",
     "field_offset" : 16,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "x_ppem",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "y_ppem",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_Bitmap_Size_",
   "name" : "FT_Bitmap_Size_",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_Bitmap_Size_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "jump_buffer",
     "referenced_type" : "type-596"
    },
    {
     "field_name" : "base",
     "field_offset" : 320,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "limit",
     "field_offset" : 352,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "level",
     "field_offset" : 384,
     "referenced_type" : "type-594"
    },
    {
     "field_name" : "error",
     "field_offset" : 416,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "FT_ValidatorRec_",
   "name" : "FT_ValidatorRec_",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 56,
   "source_file" : "/external/freetype/include/freetype/internal/ftvalid.h",
   "unique_id" : "FT_ValidatorRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "res_id",
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_RFork_Ref_",
   "name" : "FT_RFork_Ref_",
   "referenced_type" : "type-599",
   "self_type" : "type-599",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/ftrfork.h",
   "unique_id" : "FT_RFork_Ref_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "func",
     "referenced_type" : "type-602"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-600"
    }
   ],
   "linker_set_key" : "ft_raccess_guess_rec_",
   "name" : "ft_raccess_guess_rec_",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/ftrfork.h",
   "unique_id" : "ft_raccess_guess_rec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "create",
     "referenced_type" : "type-605"
    },
    {
     "field_name" : "set_scale",
     "field_offset" : 32,
     "referenced_type" : "type-610"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 64,
     "referenced_type" : "type-612"
    }
   ],
   "linker_set_key" : "PSH_Globals_FuncsRec_",
   "name" : "PSH_Globals_FuncsRec_",
   "referenced_type" : "type-604",
   "self_type" : "type-604",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/pshints.h",
   "unique_id" : "PSH_Globals_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hints",
     "referenced_type" : "type-615"
    },
    {
     "field_name" : "open",
     "field_offset" : 32,
     "referenced_type" : "type-617"
    },
    {
     "field_name" : "close",
     "field_offset" : 64,
     "referenced_type" : "type-619"
    },
    {
     "field_name" : "stem",
     "field_offset" : 96,
     "referenced_type" : "type-621"
    },
    {
     "field_name" : "stem3",
     "field_offset" : 128,
     "referenced_type" : "type-621"
    },
    {
     "field_name" : "reset",
     "field_offset" : 160,
     "referenced_type" : "type-623"
    },
    {
     "field_name" : "apply",
     "field_offset" : 192,
     "referenced_type" : "type-625"
    }
   ],
   "linker_set_key" : "T1_Hints_FuncsRec_",
   "name" : "T1_Hints_FuncsRec_",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/internal/pshints.h",
   "unique_id" : "T1_Hints_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "face",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "platform_id",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "encoding_id",
     "field_offset" : 80,
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "FT_CharMapRec_",
   "name" : "FT_CharMapRec_",
   "referenced_type" : "type-62",
   "self_type" : "type-62",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_CharMapRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hints",
     "referenced_type" : "type-628"
    },
    {
     "field_name" : "open",
     "field_offset" : 32,
     "referenced_type" : "type-630"
    },
    {
     "field_name" : "close",
     "field_offset" : 64,
     "referenced_type" : "type-632"
    },
    {
     "field_name" : "stems",
     "field_offset" : 96,
     "referenced_type" : "type-634"
    },
    {
     "field_name" : "hintmask",
     "field_offset" : 128,
     "referenced_type" : "type-636"
    },
    {
     "field_name" : "counter",
     "field_offset" : 160,
     "referenced_type" : "type-638"
    },
    {
     "field_name" : "apply",
     "field_offset" : 192,
     "referenced_type" : "type-640"
    }
   ],
   "linker_set_key" : "T2_Hints_FuncsRec_",
   "name" : "T2_Hints_FuncsRec_",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/internal/pshints.h",
   "unique_id" : "T2_Hints_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_globals_funcs",
     "referenced_type" : "type-643"
    },
    {
     "field_name" : "get_t1_funcs",
     "field_offset" : 32,
     "referenced_type" : "type-646"
    },
    {
     "field_name" : "get_t2_funcs",
     "field_offset" : 64,
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "PSHinter_Interface_",
   "name" : "PSHinter_Interface_",
   "referenced_type" : "type-642",
   "self_type" : "type-642",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/pshints.h",
   "unique_id" : "PSHinter_Interface_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "finalizer",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "FT_Generic_",
   "name" : "FT_Generic_",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/fttypes.h",
   "unique_id" : "FT_Generic_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "unicode",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "glyph_index",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "PS_UniMap_",
   "name" : "PS_UniMap_",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/services/svpscmap.h",
   "unique_id" : "PS_UniMap_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmap",
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "num_maps",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "maps",
     "field_offset" : 160,
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "PS_UnicodesRec_",
   "name" : "PS_UnicodesRec_",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/internal/services/svpscmap.h",
   "unique_id" : "PS_UnicodesRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "unicode_value",
     "referenced_type" : "type-656"
    },
    {
     "field_name" : "unicodes_init",
     "field_offset" : 32,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "unicodes_char_index",
     "field_offset" : 64,
     "referenced_type" : "type-665"
    },
    {
     "field_name" : "unicodes_char_next",
     "field_offset" : 96,
     "referenced_type" : "type-667"
    },
    {
     "field_name" : "macintosh_name",
     "field_offset" : 128,
     "referenced_type" : "type-669"
    },
    {
     "field_name" : "adobe_std_strings",
     "field_offset" : 160,
     "referenced_type" : "type-669"
    },
    {
     "field_name" : "adobe_std_encoding",
     "field_offset" : 192,
     "referenced_type" : "type-455"
    },
    {
     "field_name" : "adobe_expert_encoding",
     "field_offset" : 224,
     "referenced_type" : "type-455"
    }
   ],
   "linker_set_key" : "FT_Service_PsCMapsRec_",
   "name" : "FT_Service_PsCMapsRec_",
   "referenced_type" : "type-655",
   "self_type" : "type-655",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/internal/services/svpscmap.h",
   "unique_id" : "FT_Service_PsCMapsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "xMin",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "yMin",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "xMax",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "yMax",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_BBox_",
   "name" : "FT_BBox_",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/ftimage.h",
   "unique_id" : "FT_BBox_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_chars",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "code_first",
     "field_offset" : 32,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "code_last",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "char_index",
     "field_offset" : 96,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "char_name",
     "field_offset" : 128,
     "referenced_type" : "type-546"
    }
   ],
   "linker_set_key" : "T1_EncodingRecRec_",
   "name" : "T1_EncodingRecRec_",
   "referenced_type" : "type-671",
   "self_type" : "type-671",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "T1_EncodingRecRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "font_info",
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "font_extra",
     "field_offset" : 256,
     "referenced_type" : "type-223"
    },
    {
     "field_name" : "private_dict",
     "field_offset" : 288,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "font_name",
     "field_offset" : 1856,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "encoding_type",
     "field_offset" : 1888,
     "referenced_type" : "type-474"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 1920,
     "referenced_type" : "type-671"
    },
    {
     "field_name" : "subrs_block",
     "field_offset" : 2080,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "charstrings_block",
     "field_offset" : 2112,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "glyph_names_block",
     "field_offset" : 2144,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "num_subrs",
     "field_offset" : 2176,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "subrs",
     "field_offset" : 2208,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "subrs_len",
     "field_offset" : 2240,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "subrs_hash",
     "field_offset" : 2272,
     "referenced_type" : "type-576"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 2304,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "glyph_names",
     "field_offset" : 2336,
     "referenced_type" : "type-546"
    },
    {
     "field_name" : "charstrings",
     "field_offset" : 2368,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "charstrings_len",
     "field_offset" : 2400,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "paint_type",
     "field_offset" : 2432,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "font_type",
     "field_offset" : 2440,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "font_matrix",
     "field_offset" : 2464,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "font_offset",
     "field_offset" : 2592,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "font_bbox",
     "field_offset" : 2656,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "font_id",
     "field_offset" : 2784,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "stroke_width",
     "field_offset" : 2816,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "T1_FontRec_",
   "name" : "T1_FontRec_",
   "referenced_type" : "type-672",
   "self_type" : "type-672",
   "size" : 356,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "T1_FontRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_subrs",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "code",
     "field_offset" : 32,
     "referenced_type" : "type-580"
    }
   ],
   "linker_set_key" : "CID_SubrsRec_",
   "name" : "CID_SubrsRec_",
   "referenced_type" : "type-673",
   "self_type" : "type-673",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "CID_SubrsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "degree",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "min_ptsize",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "min_kern",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "max_ptsize",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "max_kern",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "AFM_TrackKernRec_",
   "name" : "AFM_TrackKernRec_",
   "referenced_type" : "type-674",
   "self_type" : "type-674",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "AFM_TrackKernRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index1",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "index2",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "x",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "y",
     "field_offset" : 96,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "AFM_KernPairRec_",
   "name" : "AFM_KernPairRec_",
   "referenced_type" : "type-675",
   "self_type" : "type-675",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "AFM_KernPairRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "IsCIDFont",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "FontBBox",
     "field_offset" : 32,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "Ascender",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "Descender",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "TrackKerns",
     "field_offset" : 224,
     "referenced_type" : "type-677"
    },
    {
     "field_name" : "NumTrackKern",
     "field_offset" : 256,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "KernPairs",
     "field_offset" : 288,
     "referenced_type" : "type-678"
    },
    {
     "field_name" : "NumKernPair",
     "field_offset" : 320,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "AFM_FontInfoRec_",
   "name" : "AFM_FontInfoRec_",
   "referenced_type" : "type-676",
   "self_type" : "type-676",
   "size" : 44,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "AFM_FontInfoRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "type1",
     "field_offset" : 1056,
     "referenced_type" : "type-672"
    },
    {
     "field_name" : "psnames",
     "field_offset" : 3904,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "psaux",
     "field_offset" : 3936,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "afm_data",
     "field_offset" : 3968,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "charmaprecs",
     "field_offset" : 4000,
     "referenced_type" : "type-680"
    },
    {
     "field_name" : "charmaps",
     "field_offset" : 4192,
     "referenced_type" : "type-681"
    },
    {
     "field_name" : "blend",
     "field_offset" : 4256,
     "referenced_type" : "type-682"
    },
    {
     "field_name" : "ndv_idx",
     "field_offset" : 4288,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "cdv_idx",
     "field_offset" : 4320,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "len_buildchar",
     "field_offset" : 4352,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "buildchar",
     "field_offset" : 4384,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "pshinter",
     "field_offset" : 4416,
     "referenced_type" : "type-25"
    }
   ],
   "linker_set_key" : "T1_FaceRec_",
   "name" : "T1_FaceRec_",
   "referenced_type" : "type-679",
   "self_type" : "type-679",
   "size" : 556,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "T1_FaceRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "face",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "generic",
     "field_offset" : 32,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "metrics",
     "field_offset" : 96,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "internal",
     "field_offset" : 320,
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "FT_SizeRec_",
   "name" : "FT_SizeRec_",
   "referenced_type" : "type-68",
   "self_type" : "type-68",
   "size" : 44,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_SizeRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "psnames",
     "field_offset" : 1056,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "psaux",
     "field_offset" : 1088,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cid",
     "field_offset" : 1120,
     "referenced_type" : "type-471"
    },
    {
     "field_name" : "font_extra",
     "field_offset" : 2496,
     "referenced_type" : "type-223"
    },
    {
     "field_name" : "subrs",
     "field_offset" : 2528,
     "referenced_type" : "type-684"
    },
    {
     "field_name" : "pshinter",
     "field_offset" : 2560,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "binary_data",
     "field_offset" : 2592,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "cid_stream",
     "field_offset" : 2624,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "CID_FaceRec_",
   "name" : "CID_FaceRec_",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 332,
   "source_file" : "/external/freetype/include/freetype/internal/t1types.h",
   "unique_id" : "CID_FaceRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "start",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "count",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "off_size",
     "field_offset" : 128,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "data_offset",
     "field_offset" : 160,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "data_size",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "offsets",
     "field_offset" : 224,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "bytes",
     "field_offset" : 256,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "CFF_IndexRec_",
   "name" : "CFF_IndexRec_",
   "referenced_type" : "type-685",
   "self_type" : "type-685",
   "size" : 36,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_IndexRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "count",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "sids",
     "field_offset" : 96,
     "referenced_type" : "type-687"
    },
    {
     "field_name" : "codes",
     "field_offset" : 4192,
     "referenced_type" : "type-687"
    }
   ],
   "linker_set_key" : "CFF_EncodingRec_",
   "name" : "CFF_EncodingRec_",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 1036,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_EncodingRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "offset",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "sids",
     "field_offset" : 64,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "cids",
     "field_offset" : 96,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "max_cid",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 160,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "CFF_CharsetRec_",
   "name" : "CFF_CharsetRec_",
   "referenced_type" : "type-688",
   "self_type" : "type-688",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_CharsetRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regionIdxCount",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "regionIndices",
     "field_offset" : 32,
     "referenced_type" : "type-292"
    }
   ],
   "linker_set_key" : "CFF_VarData_",
   "name" : "CFF_VarData_",
   "referenced_type" : "type-689",
   "self_type" : "type-689",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_VarData_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x_ppem",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "y_ppem",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "x_scale",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "y_scale",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ascender",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "descender",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "height",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "max_advance",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "FT_Size_Metrics_",
   "name" : "FT_Size_Metrics_",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_Size_Metrics_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "startCoord",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "peakCoord",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "endCoord",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "CFF_AxisCoords_",
   "name" : "CFF_AxisCoords_",
   "referenced_type" : "type-690",
   "self_type" : "type-690",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_AxisCoords_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "axisList",
     "referenced_type" : "type-692"
    }
   ],
   "linker_set_key" : "CFF_VarRegion_",
   "name" : "CFF_VarRegion_",
   "referenced_type" : "type-691",
   "self_type" : "type-691",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_VarRegion_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dataCount",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "varData",
     "field_offset" : 32,
     "referenced_type" : "type-694"
    },
    {
     "field_name" : "axisCount",
     "field_offset" : 64,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "regionCount",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "varRegionList",
     "field_offset" : 128,
     "referenced_type" : "type-695"
    }
   ],
   "linker_set_key" : "CFF_VStoreRec_",
   "name" : "CFF_VStoreRec_",
   "referenced_type" : "type-693",
   "self_type" : "type-693",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_VStoreRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "builtBV",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "usedBV",
     "field_offset" : 8,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "font",
     "field_offset" : 32,
     "referenced_type" : "type-697"
    },
    {
     "field_name" : "lastVsindex",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "lenNDV",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "lastNDV",
     "field_offset" : 128,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "lenBV",
     "field_offset" : 160,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "BV",
     "field_offset" : 192,
     "referenced_type" : "type-298"
    }
   ],
   "linker_set_key" : "CFF_BlendRec_",
   "name" : "CFF_BlendRec_",
   "referenced_type" : "type-696",
   "self_type" : "type-696",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_BlendRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "library",
     "referenced_type" : "type-35"
    },
    {
     "field_name" : "stream",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "memory",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "base_offset",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "num_faces",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 160,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "version_major",
     "field_offset" : 192,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "version_minor",
     "field_offset" : 200,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "header_size",
     "field_offset" : 208,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "top_dict_length",
     "field_offset" : 224,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "cff2",
     "field_offset" : 256,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "name_index",
     "field_offset" : 288,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "top_dict_index",
     "field_offset" : 576,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "global_subrs_index",
     "field_offset" : 864,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 1152,
     "referenced_type" : "type-686"
    },
    {
     "field_name" : "charset",
     "field_offset" : 9440,
     "referenced_type" : "type-688"
    },
    {
     "field_name" : "charstrings_index",
     "field_offset" : 9632,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "font_dict_index",
     "field_offset" : 9920,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "private_index",
     "field_offset" : 10208,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "local_subrs_index",
     "field_offset" : 10496,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "font_name",
     "field_offset" : 10784,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "global_subrs",
     "field_offset" : 10816,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "num_strings",
     "field_offset" : 10848,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "strings",
     "field_offset" : 10880,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "string_pool",
     "field_offset" : 10912,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "string_pool_size",
     "field_offset" : 10944,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "top_font",
     "field_offset" : 10976,
     "referenced_type" : "type-699"
    },
    {
     "field_name" : "num_subfonts",
     "field_offset" : 16192,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "subfonts",
     "field_offset" : 16224,
     "referenced_type" : "type-705"
    },
    {
     "field_name" : "fd_select",
     "field_offset" : 24416,
     "referenced_type" : "type-706"
    },
    {
     "field_name" : "pshinter",
     "field_offset" : 24640,
     "referenced_type" : "type-707"
    },
    {
     "field_name" : "psnames",
     "field_offset" : 24672,
     "referenced_type" : "type-708"
    },
    {
     "field_name" : "cffload",
     "field_offset" : 24704,
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "font_info",
     "field_offset" : 24736,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "registry",
     "field_offset" : 24768,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "ordering",
     "field_offset" : 24800,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "cf2_instance",
     "field_offset" : 24832,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "vstore",
     "field_offset" : 24896,
     "referenced_type" : "type-693"
    },
    {
     "field_name" : "font_extra",
     "field_offset" : 25056,
     "referenced_type" : "type-222"
    }
   ],
   "linker_set_key" : "CFF_FontRec_",
   "name" : "CFF_FontRec_",
   "referenced_type" : "type-698",
   "self_type" : "type-698",
   "size" : 3136,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_FontRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "font_dict",
     "referenced_type" : "type-700"
    },
    {
     "field_name" : "private_dict",
     "field_offset" : 1504,
     "referenced_type" : "type-701"
    },
    {
     "field_name" : "blend",
     "field_offset" : 4448,
     "referenced_type" : "type-696"
    },
    {
     "field_name" : "lenNDV",
     "field_offset" : 4672,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "NDV",
     "field_offset" : 4704,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "blend_stack",
     "field_offset" : 4736,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "blend_top",
     "field_offset" : 4768,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "blend_used",
     "field_offset" : 4800,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "blend_alloc",
     "field_offset" : 4832,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "local_subrs_index",
     "field_offset" : 4864,
     "referenced_type" : "type-685"
    },
    {
     "field_name" : "local_subrs",
     "field_offset" : 5152,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "random",
     "field_offset" : 5184,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "CFF_SubFontRec_",
   "name" : "CFF_SubFontRec_",
   "referenced_type" : "type-699",
   "self_type" : "type-699",
   "size" : 652,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_SubFontRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "notice",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "copyright",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "full_name",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "family_name",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "weight",
     "field_offset" : 160,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "is_fixed_pitch",
     "field_offset" : 192,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "italic_angle",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "underline_position",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "underline_thickness",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "paint_type",
     "field_offset" : 320,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "charstring_type",
     "field_offset" : 352,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "font_matrix",
     "field_offset" : 384,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "has_font_matrix",
     "field_offset" : 512,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "units_per_em",
     "field_offset" : 544,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "font_offset",
     "field_offset" : 576,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "unique_id",
     "field_offset" : 640,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "font_bbox",
     "field_offset" : 672,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "stroke_width",
     "field_offset" : 800,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "charset_offset",
     "field_offset" : 832,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "encoding_offset",
     "field_offset" : 864,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "charstrings_offset",
     "field_offset" : 896,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "private_offset",
     "field_offset" : 928,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "private_size",
     "field_offset" : 960,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "synthetic_base",
     "field_offset" : 992,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "embedded_postscript",
     "field_offset" : 1024,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "cid_registry",
     "field_offset" : 1056,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "cid_ordering",
     "field_offset" : 1088,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "cid_supplement",
     "field_offset" : 1120,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cid_font_version",
     "field_offset" : 1152,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cid_font_revision",
     "field_offset" : 1184,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cid_font_type",
     "field_offset" : 1216,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cid_count",
     "field_offset" : 1248,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "cid_uid_base",
     "field_offset" : 1280,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "cid_fd_array_offset",
     "field_offset" : 1312,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "cid_fd_select_offset",
     "field_offset" : 1344,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "cid_font_name",
     "field_offset" : 1376,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_designs",
     "field_offset" : 1408,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "num_axes",
     "field_offset" : 1424,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "vstore_offset",
     "field_offset" : 1440,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "maxstack",
     "field_offset" : 1472,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "CFF_FontRecDictRec_",
   "name" : "CFF_FontRecDictRec_",
   "referenced_type" : "type-700",
   "self_type" : "type-700",
   "size" : 188,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_FontRecDictRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_blue_values",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_other_blues",
     "field_offset" : 8,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_family_blues",
     "field_offset" : 16,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_family_other_blues",
     "field_offset" : 24,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "blue_values",
     "field_offset" : 32,
     "referenced_type" : "type-702"
    },
    {
     "field_name" : "other_blues",
     "field_offset" : 480,
     "referenced_type" : "type-596"
    },
    {
     "field_name" : "family_blues",
     "field_offset" : 800,
     "referenced_type" : "type-702"
    },
    {
     "field_name" : "family_other_blues",
     "field_offset" : 1248,
     "referenced_type" : "type-596"
    },
    {
     "field_name" : "blue_scale",
     "field_offset" : 1568,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "blue_shift",
     "field_offset" : 1600,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "blue_fuzz",
     "field_offset" : 1632,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "standard_width",
     "field_offset" : 1664,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "standard_height",
     "field_offset" : 1696,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "num_snap_widths",
     "field_offset" : 1728,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_snap_heights",
     "field_offset" : 1736,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "snap_widths",
     "field_offset" : 1760,
     "referenced_type" : "type-703"
    },
    {
     "field_name" : "snap_heights",
     "field_offset" : 2176,
     "referenced_type" : "type-703"
    },
    {
     "field_name" : "force_bold",
     "field_offset" : 2592,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "force_bold_threshold",
     "field_offset" : 2624,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "lenIV",
     "field_offset" : 2656,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "language_group",
     "field_offset" : 2688,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "expansion_factor",
     "field_offset" : 2720,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "initial_random_seed",
     "field_offset" : 2752,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "local_subrs_offset",
     "field_offset" : 2784,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "default_width",
     "field_offset" : 2816,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nominal_width",
     "field_offset" : 2848,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "vsindex",
     "field_offset" : 2880,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "subfont",
     "field_offset" : 2912,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "CFF_PrivateRec_",
   "name" : "CFF_PrivateRec_",
   "referenced_type" : "type-701",
   "self_type" : "type-701",
   "size" : 368,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_PrivateRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "range_count",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "data_size",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "cache_first",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "cache_count",
     "field_offset" : 160,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "cache_fd",
     "field_offset" : 192,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "CFF_FDSelectRec_",
   "name" : "CFF_FDSelectRec_",
   "referenced_type" : "type-706",
   "self_type" : "type-706",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/internal/cfftypes.h",
   "unique_id" : "CFF_FDSelectRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "module_data",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "autohint_mode",
     "field_offset" : 32,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "autohint_metrics",
     "field_offset" : 64,
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "FT_Size_InternalRec_",
   "name" : "FT_Size_InternalRec_",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 36,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_Size_InternalRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "strike_index",
     "field_offset" : 352,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "CFF_SizeRec_",
   "name" : "CFF_SizeRec_",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 48,
   "source_file" : "/external/freetype/include/freetype/internal/cffotypes.h",
   "unique_id" : "CFF_SizeRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "hint",
     "field_offset" : 1280,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "scaled",
     "field_offset" : 1288,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "x_scale",
     "field_offset" : 1312,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "y_scale",
     "field_offset" : 1344,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "CFF_GlyphSlotRec_",
   "name" : "CFF_GlyphSlotRec_",
   "referenced_type" : "type-711",
   "self_type" : "type-711",
   "size" : 172,
   "source_file" : "/external/freetype/include/freetype/internal/cffotypes.h",
   "unique_id" : "CFF_GlyphSlotRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "topfont",
     "referenced_type" : "type-608"
    },
    {
     "field_name" : "subfonts",
     "field_offset" : 32,
     "referenced_type" : "type-713"
    }
   ],
   "linker_set_key" : "CFF_InternalRec_",
   "name" : "CFF_InternalRec_",
   "referenced_type" : "type-712",
   "self_type" : "type-712",
   "size" : 1028,
   "source_file" : "/external/freetype/include/freetype/internal/cffotypes.h",
   "unique_id" : "CFF_InternalRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "xx",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "xy",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "yx",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "yy",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ox",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "oy",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "CFF_Transform_",
   "name" : "CFF_Transform_",
   "referenced_type" : "type-714",
   "self_type" : "type-714",
   "size" : 24,
   "source_file" : "/external/freetype/include/freetype/internal/cffotypes.h",
   "unique_id" : "CFF_Transform_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "hinting_engine",
     "field_offset" : 224,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "no_stem_darkening",
     "field_offset" : 256,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "darken_params",
     "field_offset" : 288,
     "referenced_type" : "type-716"
    },
    {
     "field_name" : "random_seed",
     "field_offset" : 544,
     "referenced_type" : "type-29"
    }
   ],
   "linker_set_key" : "PS_DriverRec_",
   "name" : "PS_DriverRec_",
   "referenced_type" : "type-715",
   "self_type" : "type-715",
   "size" : 72,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_DriverRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-718"
    },
    {
     "field_name" : "done",
     "field_offset" : 32,
     "referenced_type" : "type-722"
    },
    {
     "field_name" : "add",
     "field_offset" : 64,
     "referenced_type" : "type-724"
    },
    {
     "field_name" : "release",
     "field_offset" : 96,
     "referenced_type" : "type-722"
    }
   ],
   "linker_set_key" : "PS_Table_FuncsRec_",
   "name" : "PS_Table_FuncsRec_",
   "referenced_type" : "type-717",
   "self_type" : "type-717",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_Table_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "block",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "cursor",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "capacity",
     "field_offset" : 64,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "init",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "max_elems",
     "field_offset" : 128,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_elems",
     "field_offset" : 160,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "elements",
     "field_offset" : 192,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "lengths",
     "field_offset" : 224,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "memory",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "funcs",
     "field_offset" : 288,
     "referenced_type" : "type-717"
    }
   ],
   "linker_set_key" : "PS_TableRec_",
   "name" : "PS_TableRec_",
   "referenced_type" : "type-721",
   "self_type" : "type-721",
   "size" : 52,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_TableRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "limit",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "type-726"
    }
   ],
   "linker_set_key" : "T1_TokenRec_",
   "name" : "T1_TokenRec_",
   "referenced_type" : "type-727",
   "self_type" : "type-727",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_TokenRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ident",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "location",
     "field_offset" : 32,
     "referenced_type" : "type-729"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "type-728"
    },
    {
     "field_name" : "reader",
     "field_offset" : 96,
     "referenced_type" : "type-731"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "size",
     "field_offset" : 160,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "array_max",
     "field_offset" : 192,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "count_offset",
     "field_offset" : 224,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "dict",
     "field_offset" : 256,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "T1_FieldRec_",
   "name" : "T1_FieldRec_",
   "referenced_type" : "type-730",
   "self_type" : "type-730",
   "size" : 36,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_FieldRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-734"
    },
    {
     "field_name" : "done",
     "field_offset" : 32,
     "referenced_type" : "type-738"
    },
    {
     "field_name" : "skip_spaces",
     "field_offset" : 64,
     "referenced_type" : "type-738"
    },
    {
     "field_name" : "skip_PS_token",
     "field_offset" : 96,
     "referenced_type" : "type-738"
    },
    {
     "field_name" : "to_int",
     "field_offset" : 128,
     "referenced_type" : "type-740"
    },
    {
     "field_name" : "to_fixed",
     "field_offset" : 160,
     "referenced_type" : "type-742"
    },
    {
     "field_name" : "to_bytes",
     "field_offset" : 192,
     "referenced_type" : "type-744"
    },
    {
     "field_name" : "to_coord_array",
     "field_offset" : 224,
     "referenced_type" : "type-746"
    },
    {
     "field_name" : "to_fixed_array",
     "field_offset" : 256,
     "referenced_type" : "type-748"
    },
    {
     "field_name" : "to_token",
     "field_offset" : 288,
     "referenced_type" : "type-750"
    },
    {
     "field_name" : "to_token_array",
     "field_offset" : 320,
     "referenced_type" : "type-753"
    },
    {
     "field_name" : "load_field",
     "field_offset" : 352,
     "referenced_type" : "type-755"
    },
    {
     "field_name" : "load_field_table",
     "field_offset" : 384,
     "referenced_type" : "type-755"
    }
   ],
   "linker_set_key" : "PS_Parser_FuncsRec_",
   "name" : "PS_Parser_FuncsRec_",
   "referenced_type" : "type-733",
   "self_type" : "type-733",
   "size" : 52,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_Parser_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cursor",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "base",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "limit",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "error",
     "field_offset" : 96,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "memory",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "funcs",
     "field_offset" : 160,
     "referenced_type" : "type-733"
    }
   ],
   "linker_set_key" : "PS_ParserRec_",
   "name" : "PS_ParserRec_",
   "referenced_type" : "type-737",
   "self_type" : "type-737",
   "size" : 72,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_ParserRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "clazz",
     "field_offset" : 96,
     "referenced_type" : "type-75"
    },
    {
     "field_name" : "faces_list",
     "field_offset" : 128,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "glyph_loader",
     "field_offset" : 192,
     "referenced_type" : "type-117"
    }
   ],
   "linker_set_key" : "FT_DriverRec_",
   "name" : "FT_DriverRec_",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 28,
   "source_file" : "/external/freetype/include/freetype/internal/ftobjs.h",
   "unique_id" : "FT_DriverRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-759"
    },
    {
     "field_name" : "done",
     "field_offset" : 32,
     "referenced_type" : "type-764"
    }
   ],
   "linker_set_key" : "PS_Builder_FuncsRec_",
   "name" : "PS_Builder_FuncsRec_",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_Builder_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "root",
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "face_object_size",
     "field_offset" : 288,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "size_object_size",
     "field_offset" : 320,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "slot_object_size",
     "field_offset" : 352,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "init_face",
     "field_offset" : 384,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "done_face",
     "field_offset" : 416,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "init_size",
     "field_offset" : 448,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "done_size",
     "field_offset" : 480,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "init_slot",
     "field_offset" : 512,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "done_slot",
     "field_offset" : 544,
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "load_glyph",
     "field_offset" : 576,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "get_kerning",
     "field_offset" : 608,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "attach_file",
     "field_offset" : 640,
     "referenced_type" : "type-105"
    },
    {
     "field_name" : "get_advances",
     "field_offset" : 672,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "request_size",
     "field_offset" : 704,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "select_size",
     "field_offset" : 736,
     "referenced_type" : "type-115"
    }
   ],
   "linker_set_key" : "FT_Driver_ClassRec_",
   "name" : "FT_Driver_ClassRec_",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 96,
   "source_file" : "/external/freetype/include/freetype/internal/ftdrv.h",
   "unique_id" : "FT_Driver_ClassRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "memory",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "face",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "glyph",
     "field_offset" : 64,
     "referenced_type" : "type-763"
    },
    {
     "field_name" : "loader",
     "field_offset" : 96,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "base",
     "field_offset" : 128,
     "referenced_type" : "type-588"
    },
    {
     "field_name" : "current",
     "field_offset" : 160,
     "referenced_type" : "type-588"
    },
    {
     "field_name" : "pos_x",
     "field_offset" : 192,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "pos_y",
     "field_offset" : 224,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "left_bearing",
     "field_offset" : 256,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "advance",
     "field_offset" : 288,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "bbox",
     "field_offset" : 320,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "path_begun",
     "field_offset" : 352,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "load_points",
     "field_offset" : 360,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "no_recurse",
     "field_offset" : 368,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "metrics_only",
     "field_offset" : 376,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "is_t1",
     "field_offset" : 384,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "funcs",
     "field_offset" : 416,
     "referenced_type" : "type-758"
    }
   ],
   "linker_set_key" : "PS_Builder_",
   "name" : "PS_Builder_",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 60,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_Builder_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "limit",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "cursor",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "PS_Decoder_Zone_",
   "name" : "PS_Decoder_Zone_",
   "referenced_type" : "type-766",
   "self_type" : "type-766",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_Decoder_Zone_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "builder",
     "referenced_type" : "type-762"
    },
    {
     "field_name" : "stack",
     "field_offset" : 480,
     "referenced_type" : "type-768"
    },
    {
     "field_name" : "top",
     "field_offset" : 2048,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "zones",
     "field_offset" : 2080,
     "referenced_type" : "type-769"
    },
    {
     "field_name" : "zone",
     "field_offset" : 3712,
     "referenced_type" : "type-770"
    },
    {
     "field_name" : "flex_state",
     "field_offset" : 3744,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_flex_vectors",
     "field_offset" : 3776,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "flex_vectors",
     "field_offset" : 3808,
     "referenced_type" : "type-771"
    },
    {
     "field_name" : "cff",
     "field_offset" : 4256,
     "referenced_type" : "type-697"
    },
    {
     "field_name" : "current_subfont",
     "field_offset" : 4288,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "cf2_instance",
     "field_offset" : 4320,
     "referenced_type" : "type-772"
    },
    {
     "field_name" : "glyph_width",
     "field_offset" : 4352,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "width_only",
     "field_offset" : 4384,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_hints",
     "field_offset" : 4416,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_locals",
     "field_offset" : 4448,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_globals",
     "field_offset" : 4480,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "locals_bias",
     "field_offset" : 4512,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "globals_bias",
     "field_offset" : 4544,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "locals",
     "field_offset" : 4576,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "globals",
     "field_offset" : 4608,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "glyph_names",
     "field_offset" : 4640,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 4672,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "hint_mode",
     "field_offset" : 4704,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "seac",
     "field_offset" : 4736,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "get_glyph_callback",
     "field_offset" : 4768,
     "referenced_type" : "type-773"
    },
    {
     "field_name" : "free_glyph_callback",
     "field_offset" : 4800,
     "referenced_type" : "type-775"
    },
    {
     "field_name" : "psnames",
     "field_offset" : 4832,
     "referenced_type" : "type-708"
    },
    {
     "field_name" : "lenIV",
     "field_offset" : 4864,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "locals_len",
     "field_offset" : 4896,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "locals_hash",
     "field_offset" : 4928,
     "referenced_type" : "type-576"
    },
    {
     "field_name" : "font_matrix",
     "field_offset" : 4960,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "font_offset",
     "field_offset" : 5088,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "blend",
     "field_offset" : 5152,
     "referenced_type" : "type-682"
    },
    {
     "field_name" : "buildchar",
     "field_offset" : 5184,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "len_buildchar",
     "field_offset" : 5216,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "PS_Decoder_",
   "name" : "PS_Decoder_",
   "referenced_type" : "type-767",
   "self_type" : "type-767",
   "size" : 656,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PS_Decoder_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-780"
    },
    {
     "field_name" : "done",
     "field_offset" : 32,
     "referenced_type" : "type-785"
    },
    {
     "field_name" : "check_points",
     "field_offset" : 64,
     "referenced_type" : "type-787"
    },
    {
     "field_name" : "add_point",
     "field_offset" : 96,
     "referenced_type" : "type-789"
    },
    {
     "field_name" : "add_point1",
     "field_offset" : 128,
     "referenced_type" : "type-791"
    },
    {
     "field_name" : "add_contour",
     "field_offset" : 160,
     "referenced_type" : "type-793"
    },
    {
     "field_name" : "start_point",
     "field_offset" : 192,
     "referenced_type" : "type-791"
    },
    {
     "field_name" : "close_contour",
     "field_offset" : 224,
     "referenced_type" : "type-785"
    }
   ],
   "linker_set_key" : "T1_Builder_FuncsRec_",
   "name" : "T1_Builder_FuncsRec_",
   "referenced_type" : "type-779",
   "self_type" : "type-779",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_Builder_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "memory",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "face",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "glyph",
     "field_offset" : 64,
     "referenced_type" : "type-52"
    },
    {
     "field_name" : "loader",
     "field_offset" : 96,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "base",
     "field_offset" : 128,
     "referenced_type" : "type-588"
    },
    {
     "field_name" : "current",
     "field_offset" : 160,
     "referenced_type" : "type-588"
    },
    {
     "field_name" : "pos_x",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pos_y",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "left_bearing",
     "field_offset" : 256,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "advance",
     "field_offset" : 320,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "bbox",
     "field_offset" : 384,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "parse_state",
     "field_offset" : 512,
     "referenced_type" : "type-784"
    },
    {
     "field_name" : "load_points",
     "field_offset" : 544,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "no_recurse",
     "field_offset" : 552,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "metrics_only",
     "field_offset" : 560,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "hints_funcs",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "hints_globals",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "funcs",
     "field_offset" : 640,
     "referenced_type" : "type-779"
    }
   ],
   "linker_set_key" : "T1_BuilderRec_",
   "name" : "T1_BuilderRec_",
   "referenced_type" : "type-783",
   "self_type" : "type-783",
   "size" : 112,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_BuilderRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cursor",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "base",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "limit",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "T1_Decoder_ZoneRec_",
   "name" : "T1_Decoder_ZoneRec_",
   "referenced_type" : "type-796",
   "self_type" : "type-796",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_Decoder_ZoneRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-798"
    },
    {
     "field_name" : "done",
     "field_offset" : 32,
     "referenced_type" : "type-807"
    },
    {
     "field_name" : "parse_metrics",
     "field_offset" : 64,
     "referenced_type" : "type-809"
    },
    {
     "field_name" : "parse_charstrings",
     "field_offset" : 96,
     "referenced_type" : "type-811"
    }
   ],
   "linker_set_key" : "T1_Decoder_FuncsRec_",
   "name" : "T1_Decoder_FuncsRec_",
   "referenced_type" : "type-797",
   "self_type" : "type-797",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_Decoder_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "descriptor",
     "field_offset" : 96,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "pathname",
     "field_offset" : 128,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "read",
     "field_offset" : 160,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "close",
     "field_offset" : 192,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "memory",
     "field_offset" : 224,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "cursor",
     "field_offset" : 256,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "limit",
     "field_offset" : 288,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "FT_StreamRec_",
   "name" : "FT_StreamRec_",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 40,
   "source_file" : "/external/freetype/include/freetype/ftsystem.h",
   "unique_id" : "FT_StreamRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "builder",
     "referenced_type" : "type-783"
    },
    {
     "field_name" : "stack",
     "field_offset" : 896,
     "referenced_type" : "type-802"
    },
    {
     "field_name" : "top",
     "field_offset" : 9088,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "zones",
     "field_offset" : 9120,
     "referenced_type" : "type-803"
    },
    {
     "field_name" : "zone",
     "field_offset" : 10752,
     "referenced_type" : "type-804"
    },
    {
     "field_name" : "psnames",
     "field_offset" : 10784,
     "referenced_type" : "type-708"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 10816,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "glyph_names",
     "field_offset" : 10848,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "lenIV",
     "field_offset" : 10880,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_subrs",
     "field_offset" : 10912,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "subrs",
     "field_offset" : 10944,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "subrs_len",
     "field_offset" : 10976,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "subrs_hash",
     "field_offset" : 11008,
     "referenced_type" : "type-576"
    },
    {
     "field_name" : "font_matrix",
     "field_offset" : 11040,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "font_offset",
     "field_offset" : 11168,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "flex_state",
     "field_offset" : 11232,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_flex_vectors",
     "field_offset" : 11264,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "flex_vectors",
     "field_offset" : 11296,
     "referenced_type" : "type-771"
    },
    {
     "field_name" : "blend",
     "field_offset" : 11744,
     "referenced_type" : "type-682"
    },
    {
     "field_name" : "hint_mode",
     "field_offset" : 11776,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "parse_callback",
     "field_offset" : 11808,
     "referenced_type" : "type-805"
    },
    {
     "field_name" : "funcs",
     "field_offset" : 11840,
     "referenced_type" : "type-797"
    },
    {
     "field_name" : "buildchar",
     "field_offset" : 11968,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "len_buildchar",
     "field_offset" : 12000,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "seac",
     "field_offset" : 12032,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "cf2_instance",
     "field_offset" : 12064,
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "T1_DecoderRec_",
   "name" : "T1_DecoderRec_",
   "referenced_type" : "type-801",
   "self_type" : "type-801",
   "size" : 1516,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_DecoderRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-815"
    },
    {
     "field_name" : "done",
     "field_offset" : 32,
     "referenced_type" : "type-820"
    },
    {
     "field_name" : "check_points",
     "field_offset" : 64,
     "referenced_type" : "type-822"
    },
    {
     "field_name" : "add_point",
     "field_offset" : 96,
     "referenced_type" : "type-824"
    },
    {
     "field_name" : "add_point1",
     "field_offset" : 128,
     "referenced_type" : "type-826"
    },
    {
     "field_name" : "add_contour",
     "field_offset" : 160,
     "referenced_type" : "type-828"
    },
    {
     "field_name" : "start_point",
     "field_offset" : 192,
     "referenced_type" : "type-826"
    },
    {
     "field_name" : "close_contour",
     "field_offset" : 224,
     "referenced_type" : "type-820"
    }
   ],
   "linker_set_key" : "CFF_Builder_FuncsRec_",
   "name" : "CFF_Builder_FuncsRec_",
   "referenced_type" : "type-814",
   "self_type" : "type-814",
   "size" : 32,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "CFF_Builder_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "memory",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "face",
     "field_offset" : 32,
     "referenced_type" : "type-510"
    },
    {
     "field_name" : "glyph",
     "field_offset" : 64,
     "referenced_type" : "type-763"
    },
    {
     "field_name" : "loader",
     "field_offset" : 96,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "base",
     "field_offset" : 128,
     "referenced_type" : "type-588"
    },
    {
     "field_name" : "current",
     "field_offset" : 160,
     "referenced_type" : "type-588"
    },
    {
     "field_name" : "pos_x",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pos_y",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "left_bearing",
     "field_offset" : 256,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "advance",
     "field_offset" : 320,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "bbox",
     "field_offset" : 384,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "path_begun",
     "field_offset" : 512,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "load_points",
     "field_offset" : 520,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "no_recurse",
     "field_offset" : 528,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "metrics_only",
     "field_offset" : 536,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "hints_funcs",
     "field_offset" : 544,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "hints_globals",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "funcs",
     "field_offset" : 608,
     "referenced_type" : "type-814"
    }
   ],
   "linker_set_key" : "CFF_Builder_",
   "name" : "CFF_Builder_",
   "referenced_type" : "type-818",
   "self_type" : "type-818",
   "size" : 108,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "CFF_Builder_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pointer",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "FT_StreamDesc_",
   "name" : "FT_StreamDesc_",
   "record_kind" : "union",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/ftsystem.h",
   "unique_id" : "FT_StreamDesc_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "limit",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "cursor",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "CFF_Decoder_Zone_",
   "name" : "CFF_Decoder_Zone_",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "CFF_Decoder_Zone_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "builder",
     "referenced_type" : "type-818"
    },
    {
     "field_name" : "cff",
     "field_offset" : 864,
     "referenced_type" : "type-697"
    },
    {
     "field_name" : "stack",
     "field_offset" : 896,
     "referenced_type" : "type-768"
    },
    {
     "field_name" : "top",
     "field_offset" : 2464,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "zones",
     "field_offset" : 2496,
     "referenced_type" : "type-832"
    },
    {
     "field_name" : "zone",
     "field_offset" : 4128,
     "referenced_type" : "type-833"
    },
    {
     "field_name" : "flex_state",
     "field_offset" : 4160,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "num_flex_vectors",
     "field_offset" : 4192,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "flex_vectors",
     "field_offset" : 4224,
     "referenced_type" : "type-771"
    },
    {
     "field_name" : "glyph_width",
     "field_offset" : 4672,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nominal_width",
     "field_offset" : 4704,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "read_width",
     "field_offset" : 4736,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "width_only",
     "field_offset" : 4744,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "num_hints",
     "field_offset" : 4768,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "buildchar",
     "field_offset" : 4800,
     "referenced_type" : "type-834"
    },
    {
     "field_name" : "num_locals",
     "field_offset" : 5824,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "num_globals",
     "field_offset" : 5856,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "locals_bias",
     "field_offset" : 5888,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "globals_bias",
     "field_offset" : 5920,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "locals",
     "field_offset" : 5952,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "globals",
     "field_offset" : 5984,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "glyph_names",
     "field_offset" : 6016,
     "referenced_type" : "type-580"
    },
    {
     "field_name" : "num_glyphs",
     "field_offset" : 6048,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "hint_mode",
     "field_offset" : 6080,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "seac",
     "field_offset" : 6112,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "current_subfont",
     "field_offset" : 6144,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "get_glyph_callback",
     "field_offset" : 6176,
     "referenced_type" : "type-773"
    },
    {
     "field_name" : "free_glyph_callback",
     "field_offset" : 6208,
     "referenced_type" : "type-775"
    }
   ],
   "linker_set_key" : "CFF_Decoder_",
   "name" : "CFF_Decoder_",
   "referenced_type" : "type-831",
   "self_type" : "type-831",
   "size" : 780,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "CFF_Decoder_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-836"
    },
    {
     "field_name" : "prepare",
     "field_offset" : 32,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "parse_charstrings",
     "field_offset" : 64,
     "referenced_type" : "type-811"
    }
   ],
   "linker_set_key" : "CFF_Decoder_FuncsRec_",
   "name" : "CFF_Decoder_FuncsRec_",
   "referenced_type" : "type-835",
   "self_type" : "type-835",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "CFF_Decoder_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "init",
     "referenced_type" : "type-842"
    },
    {
     "field_name" : "done",
     "field_offset" : 32,
     "referenced_type" : "type-851"
    },
    {
     "field_name" : "parse",
     "field_offset" : 64,
     "referenced_type" : "type-853"
    }
   ],
   "linker_set_key" : "AFM_Parser_FuncsRec_",
   "name" : "AFM_Parser_FuncsRec_",
   "referenced_type" : "type-841",
   "self_type" : "type-841",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "AFM_Parser_FuncsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "memory",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "stream",
     "field_offset" : 32,
     "referenced_type" : "type-846"
    },
    {
     "field_name" : "FontInfo",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "get_index",
     "field_offset" : 96,
     "referenced_type" : "type-849"
    },
    {
     "field_name" : "user_data",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "AFM_ParserRec_",
   "name" : "AFM_ParserRec_",
   "referenced_type" : "type-845",
   "self_type" : "type-845",
   "size" : 20,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "AFM_ParserRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "standard",
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "expert",
     "field_offset" : 32,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "custom",
     "field_offset" : 64,
     "referenced_type" : "type-334"
    },
    {
     "field_name" : "unicode",
     "field_offset" : 96,
     "referenced_type" : "type-334"
    }
   ],
   "linker_set_key" : "T1_CMap_ClassesRec_",
   "name" : "T1_CMap_ClassesRec_",
   "referenced_type" : "type-855",
   "self_type" : "type-855",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "T1_CMap_ClassesRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ps_table_funcs",
     "referenced_type" : "type-857"
    },
    {
     "field_name" : "ps_parser_funcs",
     "field_offset" : 32,
     "referenced_type" : "type-859"
    },
    {
     "field_name" : "t1_builder_funcs",
     "field_offset" : 64,
     "referenced_type" : "type-861"
    },
    {
     "field_name" : "t1_decoder_funcs",
     "field_offset" : 96,
     "referenced_type" : "type-863"
    },
    {
     "field_name" : "t1_decrypt",
     "field_offset" : 128,
     "referenced_type" : "type-865"
    },
    {
     "field_name" : "cff_random",
     "field_offset" : 160,
     "referenced_type" : "type-867"
    },
    {
     "field_name" : "ps_decoder_init",
     "field_offset" : 192,
     "referenced_type" : "type-869"
    },
    {
     "field_name" : "t1_make_subfont",
     "field_offset" : 224,
     "referenced_type" : "type-871"
    },
    {
     "field_name" : "t1_cmap_classes",
     "field_offset" : 256,
     "referenced_type" : "type-873"
    },
    {
     "field_name" : "afm_parser_funcs",
     "field_offset" : 288,
     "referenced_type" : "type-875"
    },
    {
     "field_name" : "cff_decoder_funcs",
     "field_offset" : 320,
     "referenced_type" : "type-877"
    }
   ],
   "linker_set_key" : "PSAux_ServiceRec_",
   "name" : "PSAux_ServiceRec_",
   "referenced_type" : "type-856",
   "self_type" : "type-856",
   "size" : 44,
   "source_file" : "/external/freetype/include/freetype/internal/psaux.h",
   "unique_id" : "PSAux_ServiceRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "load_table",
     "referenced_type" : "type-880"
    },
    {
     "field_name" : "get_table",
     "field_offset" : 32,
     "referenced_type" : "type-882"
    },
    {
     "field_name" : "table_info",
     "field_offset" : 64,
     "referenced_type" : "type-884"
    }
   ],
   "linker_set_key" : "FT_Service_SFNT_TableRec_",
   "name" : "FT_Service_SFNT_TableRec_",
   "referenced_type" : "type-879",
   "self_type" : "type-879",
   "size" : 12,
   "source_file" : "/external/freetype/include/freetype/internal/services/svsfnt.h",
   "unique_id" : "FT_Service_SFNT_TableRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_ps_font_name",
     "referenced_type" : "type-887"
    }
   ],
   "linker_set_key" : "FT_Service_PsFontNameRec_",
   "name" : "FT_Service_PsFontNameRec_",
   "referenced_type" : "type-886",
   "self_type" : "type-886",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/services/svpostnm.h",
   "unique_id" : "FT_Service_PsFontNameRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_name",
     "referenced_type" : "type-890"
    },
    {
     "field_name" : "name_index",
     "field_offset" : 32,
     "referenced_type" : "type-892"
    }
   ],
   "linker_set_key" : "FT_Service_GlyphDictRec_",
   "name" : "FT_Service_GlyphDictRec_",
   "referenced_type" : "type-889",
   "self_type" : "type-889",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/services/svgldict.h",
   "unique_id" : "FT_Service_GlyphDictRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "FT_Parameter_",
   "name" : "FT_Parameter_",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/freetype.h",
   "unique_id" : "FT_Parameter_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "language",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "TT_CMapInfo_",
   "name" : "TT_CMapInfo_",
   "referenced_type" : "type-894",
   "self_type" : "type-894",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/internal/services/svttcmap.h",
   "unique_id" : "TT_CMapInfo_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_cmap_info",
     "referenced_type" : "type-896"
    }
   ],
   "linker_set_key" : "FT_Service_TTCMapsRec_",
   "name" : "FT_Service_TTCMapsRec_",
   "referenced_type" : "type-895",
   "self_type" : "type-895",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/services/svttcmap.h",
   "unique_id" : "FT_Service_TTCMapsRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_track",
     "referenced_type" : "type-900"
    }
   ],
   "linker_set_key" : "FT_Service_KerningRec_",
   "name" : "FT_Service_KerningRec_",
   "referenced_type" : "type-899",
   "self_type" : "type-899",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/services/svkern.h",
   "unique_id" : "FT_Service_KerningRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "engine_type",
     "referenced_type" : "type-304"
    }
   ],
   "linker_set_key" : "FT_Service_TrueTypeEngineRec_",
   "name" : "FT_Service_TrueTypeEngineRec_",
   "referenced_type" : "type-902",
   "self_type" : "type-902",
   "size" : 4,
   "source_file" : "/external/freetype/include/freetype/internal/services/svtteng.h",
   "unique_id" : "FT_Service_TrueTypeEngineRec_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "platform_id",
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "encoding_id",
     "field_offset" : 16,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "language_id",
     "field_offset" : 32,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "name_id",
     "field_offset" : 48,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "string",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "string_len",
     "field_offset" : 96,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "FT_SfntName_",
   "name" : "FT_SfntName_",
   "referenced_type" : "type-903",
   "self_type" : "type-903",
   "size" : 16,
   "source_file" : "/external/freetype/include/freetype/ftsnames.h",
   "unique_id" : "FT_SfntName_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "string",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "string_len",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "FT_SfntLangTag_",
   "name" : "FT_SfntLangTag_",
   "referenced_type" : "type-905",
   "self_type" : "type-905",
   "size" : 8,
   "source_file" : "/external/freetype/include/freetype/ftsnames.h",
   "unique_id" : "FT_SfntLangTag_"
  }
 ],
 "rvalue_reference_types" : []
}
