{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "Timestamp [2]",
   "name" : "Timestamp [2]",
   "referenced_type" : "type-11",
   "self_type" : "type-10",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AAudioUtilities.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "aaudio::SharedMemoryParcelable [32]",
   "name" : "aaudio::SharedMemoryParcelable [32]",
   "referenced_type" : "type-20",
   "self_type" : "type-19",
   "size" : 512,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AudioEndpointParcelable.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [2]",
   "name" : "int [2]",
   "referenced_type" : "type-4",
   "self_type" : "type-166",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libaaudio/src/fifo/FifoBuffer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "void *[2]",
   "name" : "void *[2]",
   "referenced_type" : "type-51",
   "self_type" : "type-165",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libaaudio/src/fifo/FifoBuffer.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 1
  },
  {

   "referenced_type" : "type-827",
   "self_type" : "type-826",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioBinderClient.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::wp<android::IBinder>",
   "name" : "const android::wp<android::IBinder>",
   "referenced_type" : "type-832",
   "self_type" : "type-831",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioBinderClient.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::String16",
   "name" : "const android::String16",
   "referenced_type" : "type-835",
   "self_type" : "type-834",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioClient.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::sp<android::IBinder>",
   "name" : "const android::sp<android::IBinder>",
   "referenced_type" : "type-837",
   "self_type" : "type-836",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioService.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const MonotonicCounter",
   "name" : "const MonotonicCounter",
   "referenced_type" : "type-83",
   "self_type" : "type-175",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/MonotonicCounter.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::unique_ptr<android::IAAudioService, std::default_delete<android::IAAudioService> >",
   "name" : "const std::unique_ptr<android::IAAudioService, std::default_delete<android::IAAudioService> >",
   "referenced_type" : "type-845",
   "self_type" : "type-844",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioService.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::Parcel",
   "name" : "const android::Parcel",
   "referenced_type" : "type-848",
   "self_type" : "type-847",
   "size" : 52,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioService.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::Parcel",
   "name" : "const android::Parcel",
   "referenced_type" : "type-858",
   "self_type" : "type-857",
   "size" : 52,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/RingBufferParcelable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::sp<aaudio::AudioStreamLegacy::StreamDeviceCallback>",
   "name" : "const android::sp<aaudio::AudioStreamLegacy::StreamDeviceCallback>",
   "referenced_type" : "type-85",
   "self_type" : "type-84",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaaudio/src/legacy/AudioStreamLegacy.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "const android::base::unique_fd_impl<android::base::DefaultCloser>",
   "referenced_type" : "type-863",
   "self_type" : "type-862",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/SharedMemoryParcelable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::Parcel",
   "name" : "const android::Parcel",
   "referenced_type" : "type-870",
   "self_type" : "type-869",
   "size" : 52,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/SharedMemoryParcelable.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::Parcel",
   "name" : "const android::Parcel",
   "referenced_type" : "type-879",
   "self_type" : "type-878",
   "size" : 52,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/SharedRegionParcelable.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const aaudio::AudioStreamRecord",
   "name" : "const aaudio::AudioStreamRecord",
   "referenced_type" : "type-92",
   "self_type" : "type-97",
   "size" : 248,
   "source_file" : "/frameworks/av/media/libaaudio/src/legacy/AudioStreamRecord.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const SimpleDoubleBuffer<Timestamp>",
   "name" : "const SimpleDoubleBuffer<Timestamp>",
   "referenced_type" : "type-9",
   "self_type" : "type-519",
   "size" : 36,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AAudioUtilities.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "AAudioDataConverter",
   "name" : "AAudioDataConverter",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AAudioUtilities.h",
   "unique_id" : "_ZTS19AAudioDataConverter"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "FixedBlockReader",
   "name" : "FixedBlockReader",
   "record_kind" : "class",
   "referenced_type" : "type-100",
   "self_type" : "type-100",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/FixedBlockReader.h",
   "unique_id" : "_ZTS16FixedBlockReader",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16FixedBlockReader"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16FixedBlockReaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16FixedBlockReaderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN16FixedBlockReader4openEi"
    },
    {
     "mangled_component_name" : "_ZN16FixedBlockReader20processVariableBlockEPhi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-82"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAudioTrack",
     "field_offset" : 1664,
     "referenced_type" : "type-103"
    },
    {
     "access" : "private",
     "field_name" : "mFixedBlockReader",
     "field_offset" : 1696,
     "referenced_type" : "type-100"
    },
    {
     "access" : "private",
     "field_name" : "mPositionWhenPausing",
     "field_offset" : 1856,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamTrack",
   "name" : "aaudio::AudioStreamTrack",
   "record_kind" : "class",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 240,
   "source_file" : "/frameworks/av/media/libaaudio/src/legacy/AudioStreamTrack.h",
   "unique_id" : "_ZTSN6aaudio16AudioStreamTrackE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio16AudioStreamTrackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack12requestStartEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16AudioStreamTrack16isFlushSupportedEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16AudioStreamTrack16isPauseSupportedEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack12requestPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack12requestFlushEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack11requestStopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack12getTimestampEiPxS1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack18updateStateMachineEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream18waitForStateChangeEiPix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack4openERKNS_18AudioStreamBuilderE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack5closeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack13setBufferSizeEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12createThreadExPFPvS1_ES1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream14registerThreadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream16unregisterThreadEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16AudioStreamTrack13getBufferSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16AudioStreamTrack17getBufferCapacityEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16AudioStreamTrack17getFramesPerBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16AudioStreamTrack12getXRunCountEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream6isMMapEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream18getPerformanceModeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio16AudioStreamTrack12getDirectionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy16getFramesWrittenEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack13getFramesReadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack5writeEPKvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream4readEPvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack11doSetVolumeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream22maybeConvertDeviceDataEPKvi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack15processCallbackEiPv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy19onProcessFixedBlockEPhi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio16AudioStreamTrack27incrementClientFrameCounterEi"
    },
    {
     "component_value" : -132,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio16AudioStreamTrackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn132_N6aaudio16AudioStreamTrackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn132_N6aaudio16AudioStreamTrackD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn132_N6aaudio17AudioStreamLegacy19onProcessFixedBlockEPhi"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-109"
    },
    {
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "aaudio::AAudioStreamConfiguration",
   "name" : "aaudio::AAudioStreamConfiguration",
   "record_kind" : "class",
   "referenced_type" : "type-108",
   "self_type" : "type-108",
   "size" : 52,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioStreamConfiguration.h",
   "unique_id" : "_ZTSN6aaudio25AAudioStreamConfigurationE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio25AAudioStreamConfigurationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio25AAudioStreamConfigurationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio25AAudioStreamConfigurationD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio22AAudioStreamParameters8validateEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio25AAudioStreamConfiguration13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio25AAudioStreamConfiguration14readFromParcelEPKN7android6ParcelE"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio25AAudioStreamConfigurationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N6aaudio25AAudioStreamConfigurationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn48_N6aaudio25AAudioStreamConfigurationD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn48_NK6aaudio25AAudioStreamConfiguration13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZThn48_N6aaudio25AAudioStreamConfiguration14readFromParcelEPKN7android6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSamplesPerFrame",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSampleRate",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDeviceId",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSharingMode",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mAudioFormat",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDirection",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mUsage",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mContentType",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mInputPreset",
     "field_offset" : 288,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mBufferCapacity",
     "field_offset" : 320,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSessionId",
     "field_offset" : 352,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "aaudio::AAudioStreamParameters",
   "name" : "aaudio::AAudioStreamParameters",
   "record_kind" : "class",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libaaudio/src/core/AAudioStreamParameters.h",
   "unique_id" : "_ZTSN6aaudio22AAudioStreamParametersE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio22AAudioStreamParametersE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22AAudioStreamParametersD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22AAudioStreamParametersD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio22AAudioStreamParameters8validateEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPosition",
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mNanoseconds",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "Timestamp",
   "name" : "Timestamp",
   "record_kind" : "class",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AAudioUtilities.h",
   "unique_id" : "_ZTS9Timestamp"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-112"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mConfiguration",
     "field_offset" : 32,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "mUserId",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "mProcessId",
     "field_offset" : 480,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mSharingModeMatchRequired",
     "field_offset" : 512,
     "referenced_type" : "type-32"
    },
    {
     "access" : "protected",
     "field_name" : "mInService",
     "field_offset" : 520,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "aaudio::AAudioStreamRequest",
   "name" : "aaudio::AAudioStreamRequest",
   "record_kind" : "class",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 68,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioStreamRequest.h",
   "unique_id" : "_ZTSN6aaudio19AAudioStreamRequestE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio19AAudioStreamRequestE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio19AAudioStreamRequestD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio19AAudioStreamRequestD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AAudioStreamRequest13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AAudioStreamRequest14readFromParcelEPKN7android6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-120"
    }
   ],
   "linker_set_key" : "android::IAAudioClient",
   "name" : "android::IAAudioClient",
   "record_kind" : "class",
   "referenced_type" : "type-119",
   "self_type" : "type-119",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioClient.h",
   "unique_id" : "_ZTSN7android13IAAudioClientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13IAAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13IAAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13IAAudioClientD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android13IAAudioClient22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13IAAudioClient14onStreamChangeEiii"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13IAAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android13IAAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android13IAAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android::BnAAudioClient",
   "name" : "android::BnAAudioClient",
   "record_kind" : "class",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioClient.h",
   "unique_id" : "_ZTSN7android14BnAAudioClientE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14BnAAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14BnAAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14BnAAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IAAudioClientEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_13IAAudioClientEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13IAAudioClient14onStreamChangeEiii"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IAAudioClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android14BnAAudioClient10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14BnAAudioClientE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_13IAAudioClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_13IAAudioClientEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android14BnAAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android14BnAAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android14BnAAudioClient10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14BnAAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14BnAAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14BnAAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-127"
    }
   ],
   "linker_set_key" : "android::IAAudioService",
   "name" : "android::IAAudioService",
   "record_kind" : "class",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioService.h",
   "unique_id" : "_ZTSN7android14IAAudioServiceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14IAAudioServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14IAAudioServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14IAAudioServiceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14IAAudioService22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService14registerClientERKNS_2spINS_13IAAudioClientEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService10openStreamERKN6aaudio19AAudioStreamRequestERNS1_25AAudioStreamConfigurationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11closeStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService20getStreamDescriptionEiRN6aaudio23AudioEndpointParcelableE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11startStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11pauseStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService10stopStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11flushStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService19registerAudioThreadEiix"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService21unregisterAudioThreadEii"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14IAAudioServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14IAAudioServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android14IAAudioServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-129"
    }
   ],
   "linker_set_key" : "android::BnAAudioService",
   "name" : "android::BnAAudioService",
   "record_kind" : "class",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/IAAudioService.h",
   "unique_id" : "_ZTSN7android15BnAAudioServiceE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15BnAAudioServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15BnAAudioServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15BnAAudioServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IAAudioServiceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_14IAAudioServiceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService14registerClientERKNS_2spINS_13IAAudioClientEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService10openStreamERKN6aaudio19AAudioStreamRequestERNS1_25AAudioStreamConfigurationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11closeStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService20getStreamDescriptionEiRN6aaudio23AudioEndpointParcelableE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11startStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11pauseStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService10stopStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService11flushStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService19registerAudioThreadEiix"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android14IAAudioService21unregisterAudioThreadEii"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_14IAAudioServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android15BnAAudioService10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15BnAAudioServiceE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_14IAAudioServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_14IAAudioServiceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android15BnAAudioServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android15BnAAudioServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android15BnAAudioService10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15BnAAudioServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15BnAAudioServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android15BnAAudioServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-25"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mUpMessageQueueParcelable",
     "field_offset" : 32,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mDownMessageQueueParcelable",
     "field_offset" : 576,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mUpDataQueueParcelable",
     "field_offset" : 1120,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mDownDataQueueParcelable",
     "field_offset" : 1664,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mNumSharedMemories",
     "field_offset" : 2208,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSharedMemories",
     "field_offset" : 2240,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "aaudio::AudioEndpointParcelable",
   "name" : "aaudio::AudioEndpointParcelable",
   "record_kind" : "class",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 792,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AudioEndpointParcelable.h",
   "unique_id" : "_ZTSN6aaudio23AudioEndpointParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio23AudioEndpointParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio23AudioEndpointParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio23AudioEndpointParcelableD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio23AudioEndpointParcelable13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioEndpointParcelable14readFromParcelEPKN7android6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-134"
    },
    {
     "referenced_type" : "type-8"
    },
    {
     "referenced_type" : "type-135"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mServiceLock",
     "field_offset" : 32,
     "referenced_type" : "type-131"
    },
    {
     "access" : "private",
     "field_name" : "mAAudioService",
     "field_offset" : 64,
     "referenced_type" : "type-132"
    },
    {
     "access" : "private",
     "field_name" : "mAAudioClient",
     "field_offset" : 96,
     "referenced_type" : "type-133"
    }
   ],
   "linker_set_key" : "aaudio::AAudioBinderClient",
   "name" : "aaudio::AAudioBinderClient",
   "record_kind" : "class",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioBinderClient.h",
   "unique_id" : "_ZTSN6aaudio18AAudioBinderClientE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio18AAudioBinderClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient14registerClientERKN7android2spINS1_13IAAudioClientEEE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient10openStreamERKNS_19AAudioStreamRequestERNS_25AAudioStreamConfigurationE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient11closeStreamEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient20getStreamDescriptionEiRNS_23AudioEndpointParcelableE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient11startStreamEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient11pauseStreamEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient10stopStreamEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient11flushStreamEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient19registerAudioThreadEiix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient21unregisterAudioThreadEii"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient11startClientEiRKN7android11AudioClientEPi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient10stopClientEii"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio18AAudioBinderClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N6aaudio18AAudioBinderClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N6aaudio18AAudioBinderClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReadCounterParcelable",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mWriteCounterParcelable",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mDataParcelable",
     "field_offset" : 288,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mBytesPerFrame",
     "field_offset" : 416,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mFramesPerBurst",
     "field_offset" : 448,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mCapacityInFrames",
     "field_offset" : 480,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 512,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "aaudio::RingBufferParcelable",
   "name" : "aaudio::RingBufferParcelable",
   "record_kind" : "class",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 68,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/RingBufferParcelable.h",
   "unique_id" : "_ZTSN6aaudio20RingBufferParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio20RingBufferParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio20RingBufferParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio20RingBufferParcelableD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio20RingBufferParcelable13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio20RingBufferParcelable14readFromParcelEPKN7android6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-145"
    },
    {
     "referenced_type" : "type-123"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBinderClient",
     "field_offset" : 160,
     "referenced_type" : "type-144"
    }
   ],
   "linker_set_key" : "aaudio::AAudioBinderClient::AAudioClient",
   "name" : "aaudio::AAudioBinderClient::AAudioClient",
   "record_kind" : "class",
   "referenced_type" : "type-143",
   "self_type" : "type-143",
   "size" : 36,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioBinderClient.h",
   "unique_id" : "_ZTSN6aaudio18AAudioBinderClient12AAudioClientE",
   "vtable_components" :
   [
    {
     "component_value" : 28,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio18AAudioBinderClient12AAudioClientE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient12AAudioClient10binderDiedERKN7android2wpINS2_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient12AAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient12AAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio18AAudioBinderClient12AAudioClient14onStreamChangeEiii"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio18AAudioBinderClient12AAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N6aaudio18AAudioBinderClient12AAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N6aaudio18AAudioBinderClient12AAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IAAudioClientEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_13IAAudioClientEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZThn4_N6aaudio18AAudioBinderClient12AAudioClient14onStreamChangeEiii"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IAAudioClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android14BnAAudioClient10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio18AAudioBinderClient12AAudioClientE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_13IAAudioClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_13IAAudioClientEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N6aaudio18AAudioBinderClient12AAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N6aaudio18AAudioBinderClient12AAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android14BnAAudioClient10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio18AAudioBinderClient12AAudioClientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N6aaudio18AAudioBinderClient12AAudioClientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N6aaudio18AAudioBinderClient12AAudioClientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-16"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSharedMemoryIndex",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mOffsetInBytes",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mSizeInBytes",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "aaudio::SharedRegionParcelable",
   "name" : "aaudio::SharedRegionParcelable",
   "record_kind" : "class",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/SharedRegionParcelable.h",
   "unique_id" : "_ZTSN6aaudio22SharedRegionParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio22SharedRegionParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22SharedRegionParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22SharedRegionParcelableD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio22SharedRegionParcelable13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio22SharedRegionParcelable14readFromParcelEPKN7android6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "position",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "aaudio::AAudioMessageTimestamp",
   "name" : "aaudio::AAudioMessageTimestamp",
   "referenced_type" : "type-153",
   "self_type" : "type-153",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h",
   "unique_id" : "_ZTSN6aaudio22AAudioMessageTimestampE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "event",
     "referenced_type" : "type-154"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-156"
    }
   ],
   "linker_set_key" : "aaudio::AAudioMessageEvent",
   "name" : "aaudio::AAudioMessageEvent",
   "referenced_type" : "type-155",
   "self_type" : "type-155",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h",
   "unique_id" : "_ZTSN6aaudio18AAudioMessageEventE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dataDouble",
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "dataLong",
     "referenced_type" : "type-3"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "aaudio::AAudioMessageEvent::(anonymous union at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:46:5) at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:46:5",
   "name" : "aaudio::AAudioMessageEvent::(anonymous union at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:46:5) at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:46:5",
   "record_kind" : "union",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h",
   "unique_id" : "_ZTSN6aaudio18AAudioMessageEventUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "what",
     "referenced_type" : "type-159"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-160"
    }
   ],
   "linker_set_key" : "aaudio::AAudioServiceMessage_s",
   "name" : "aaudio::AAudioServiceMessage_s",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h",
   "unique_id" : "_ZTSN6aaudio22AAudioServiceMessage_sE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "event",
     "referenced_type" : "type-155"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "aaudio::AAudioServiceMessage_s::(anonymous union at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:61:5) at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:61:5",
   "name" : "aaudio::AAudioServiceMessage_s::(anonymous union at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:61:5) at frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h:61:5",
   "record_kind" : "union",
   "referenced_type" : "type-160",
   "self_type" : "type-160",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceMessage.h",
   "unique_id" : "_ZTSN6aaudio22AAudioServiceMessage_sUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "numFrames",
     "field_offset" : 64,
     "referenced_type" : "type-166"
    }
   ],
   "linker_set_key" : "android::WrappingBuffer",
   "name" : "android::WrappingBuffer",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/fifo/FifoBuffer.h",
   "unique_id" : "_ZTSN7android14WrappingBufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMarkerFramePosition",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mMarkerNanoTime",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mFramesPerBurst",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mMaxLatenessInNanos",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 256,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "aaudio::IsochronousClockModel",
   "name" : "aaudio::IsochronousClockModel",
   "record_kind" : "class",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 36,
   "source_file" : "/frameworks/av/media/libaaudio/src/client/IsochronousClockModel.h",
   "unique_id" : "_ZTSN6aaudio21IsochronousClockModelE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio21IsochronousClockModelE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio21IsochronousClockModelD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio21IsochronousClockModelD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-24"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFd",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "access" : "protected",
     "field_name" : "mSizeInBytes",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mResolvedAddress",
     "field_offset" : 96,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "aaudio::SharedMemoryParcelable",
   "name" : "aaudio::SharedMemoryParcelable",
   "record_kind" : "class",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/SharedMemoryParcelable.h",
   "unique_id" : "_ZTSN6aaudio22SharedMemoryParcelableE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio22SharedMemoryParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22SharedMemoryParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22SharedMemoryParcelableD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio22SharedMemoryParcelable13writeToParcelEPN7android6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio22SharedMemoryParcelable14readFromParcelEPKN7android6ParcelE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-109"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mSharingModeMatchRequired",
     "field_offset" : 384,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mPerformanceMode",
     "field_offset" : 416,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDataCallbackProc",
     "field_offset" : 448,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mDataCallbackUserData",
     "field_offset" : 480,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mFramesPerDataCallback",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCallbackProc",
     "field_offset" : 544,
     "referenced_type" : "type-54"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCallbackUserData",
     "field_offset" : 576,
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamBuilder",
   "name" : "aaudio::AudioStreamBuilder",
   "record_kind" : "class",
   "referenced_type" : "type-212",
   "self_type" : "type-212",
   "size" : 76,
   "source_file" : "/frameworks/av/media/libaaudio/src/core/AudioStreamBuilder.h",
   "unique_id" : "_ZTSN6aaudio18AudioStreamBuilderE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio18AudioStreamBuilderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio18AudioStreamBuilderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio18AudioStreamBuilderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio18AudioStreamBuilder8validateEv"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-216"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mParent",
     "field_offset" : 416,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mResult",
     "field_offset" : 448,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mRegistered",
     "field_offset" : 480,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "aaudio::AudioStream::MyPlayerBase",
   "name" : "aaudio::AudioStream::MyPlayerBase",
   "record_kind" : "class",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 72,
   "source_file" : "/frameworks/av/media/libaaudio/src/core/AudioStream.h",
   "unique_id" : "_ZTSN6aaudio11AudioStream12MyPlayerBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 64,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio11AudioStream12MyPlayerBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio11AudioStream12MyPlayerBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio11AudioStream12MyPlayerBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media7IPlayerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_5media7IPlayerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android10PlayerBase5startEv"
    },
    {
     "mangled_component_name" : "_ZN7android10PlayerBase5pauseEv"
    },
    {
     "mangled_component_name" : "_ZN7android10PlayerBase4stopEv"
    },
    {
     "mangled_component_name" : "_ZN7android10PlayerBase9setVolumeEf"
    },
    {
     "mangled_component_name" : "_ZN7android10PlayerBase6setPanEf"
    },
    {
     "mangled_component_name" : "_ZN7android10PlayerBase15setStartDelayMsEi"
    },
    {
     "mangled_component_name" : "_ZN7android10PlayerBase17applyVolumeShaperERKNS_5media12VolumeShaper13ConfigurationERKNS2_9OperationE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_5media7IPlayerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android5media8BnPlayer10onTransactEjRKNS_6ParcelEPS2_j"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12MyPlayerBase7destroyEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12MyPlayerBase11playerStartEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12MyPlayerBase11playerPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12MyPlayerBase10playerStopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12MyPlayerBase15playerSetVolumeEv"
    },
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio11AudioStream12MyPlayerBaseE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_5media7IPlayerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_5media7IPlayerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N6aaudio11AudioStream12MyPlayerBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N6aaudio11AudioStream12MyPlayerBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android5media8BnPlayer10onTransactEjRKNS_6ParcelEPS2_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio11AudioStream12MyPlayerBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N6aaudio11AudioStream12MyPlayerBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N6aaudio11AudioStream12MyPlayerBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "AudioClock",
   "name" : "AudioClock",
   "record_kind" : "class",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AudioClock.h",
   "unique_id" : "_ZTS10AudioClock"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mClockModel",
     "field_offset" : 1056,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mAudioEndpoint",
     "field_offset" : 1344,
     "referenced_type" : "type-28"
    },
    {
     "access" : "protected",
     "field_name" : "mServiceStreamHandle",
     "field_offset" : 1600,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mFramesPerBurst",
     "field_offset" : 1632,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mXRunCount",
     "field_offset" : 1664,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mFramesOffsetFromService",
     "field_offset" : 1696,
     "referenced_type" : "type-3"
    },
    {
     "access" : "protected",
     "field_name" : "mCallbackBuffer",
     "field_offset" : 1760,
     "referenced_type" : "type-22"
    },
    {
     "access" : "protected",
     "field_name" : "mCallbackFrames",
     "field_offset" : 1792,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mInService",
     "field_offset" : 1824,
     "referenced_type" : "type-32"
    },
    {
     "access" : "protected",
     "field_name" : "mServiceInterface",
     "field_offset" : 1856,
     "referenced_type" : "type-7"
    },
    {
     "access" : "protected",
     "field_name" : "mAtomicTimestamp",
     "field_offset" : 1888,
     "referenced_type" : "type-9"
    },
    {
     "access" : "protected",
     "field_name" : "mNeedCatchUp",
     "field_offset" : 2176,
     "referenced_type" : "type-35"
    },
    {
     "access" : "protected",
     "field_name" : "mStreamVolume",
     "field_offset" : 2240,
     "referenced_type" : "type-38"
    },
    {
     "access" : "private",
     "field_name" : "mWakeupDelayNanos",
     "field_offset" : 2272,
     "referenced_type" : "type-31"
    },
    {
     "access" : "private",
     "field_name" : "mMinimumSleepNanos",
     "field_offset" : 2304,
     "referenced_type" : "type-31"
    },
    {
     "access" : "private",
     "field_name" : "mEndPointParcelable",
     "field_offset" : 2336,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mEndpointDescriptor",
     "field_offset" : 8672,
     "referenced_type" : "type-39"
    },
    {
     "access" : "private",
     "field_name" : "mServiceLatencyNanos",
     "field_offset" : 9344,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mDeviceChannelCount",
     "field_offset" : 9408,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamInternal",
   "name" : "aaudio::AudioStreamInternal",
   "record_kind" : "class",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 1184,
   "source_file" : "/frameworks/av/media/libaaudio/src/client/AudioStreamInternal.h",
   "unique_id" : "_ZTSN6aaudio19AudioStreamInternalE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio19AudioStreamInternalE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternalD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternalD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal12requestStartEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isFlushSupportedEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isPauseSupportedEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestFlushEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal11requestStopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal12getTimestampEiPxS1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal18updateStateMachineEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream18waitForStateChangeEiPix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal4openERKNS_18AudioStreamBuilderE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal5closeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal13setBufferSizeEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12createThreadExPFPvS1_ES1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal14registerThreadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal16unregisterThreadEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal13getBufferSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal17getBufferCapacityEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal17getFramesPerBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal12getXRunCountEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal6isMMapEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream18getPerformanceModeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6aaudio11AudioStream12getDirectionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream16getFramesWrittenEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream13getFramesReadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream5writeEPKvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream4readEPvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream11doSetVolumeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream22maybeConvertDeviceDataEPKvi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal12callbackLoopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal14processDataNowEPvixPx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal34advanceClientToMatchServerPositionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal17onFlushFromServerEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mUpCommandQueue",
     "field_offset" : 32,
     "referenced_type" : "type-29"
    },
    {
     "access" : "private",
     "field_name" : "mDataQueue",
     "field_offset" : 64,
     "referenced_type" : "type-29"
    },
    {
     "access" : "private",
     "field_name" : "mFreeRunning",
     "field_offset" : 96,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mDataReadCounter",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mDataWriteCounter",
     "field_offset" : 192,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "aaudio::AudioEndpoint",
   "name" : "aaudio::AudioEndpoint",
   "record_kind" : "class",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libaaudio/src/client/AudioEndpoint.h",
   "unique_id" : "_ZTSN6aaudio13AudioEndpointE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio13AudioEndpointE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio13AudioEndpointD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio13AudioEndpointD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameCapacity",
     "referenced_type" : "type-31"
    },
    {
     "access" : "private",
     "field_name" : "mBytesPerFrame",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-22"
    },
    {
     "access" : "private",
     "field_name" : "mStorageOwned",
     "field_offset" : 96,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mFifo",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "access" : "private",
     "field_name" : "mFramesReadCount",
     "field_offset" : 160,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mFramesUnderrunCount",
     "field_offset" : 224,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mUnderrunCount",
     "field_offset" : 288,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mLastReadSize",
     "field_offset" : 320,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::FifoBuffer",
   "name" : "android::FifoBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 44,
   "source_file" : "/frameworks/av/media/libaaudio/src/fifo/FifoBuffer.h",
   "unique_id" : "_ZTSN7android10FifoBufferE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCapacity",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mThreshold",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "android::FifoControllerBase",
   "name" : "android::FifoControllerBase",
   "record_kind" : "class",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libaaudio/src/fifo/FifoControllerBase.h",
   "unique_id" : "_ZTSN7android18FifoControllerBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android18FifoControllerBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android18FifoControllerBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android18FifoControllerBaseD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android18FifoControllerBase14getReadCounterEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android18FifoControllerBase14setReadCounterEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android18FifoControllerBase15getWriteCounterEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android18FifoControllerBase15setWriteCounterEx"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReadCounterAddress",
     "field_offset" : 96,
     "referenced_type" : "type-349"
    },
    {
     "access" : "private",
     "field_name" : "mWriteCounterAddress",
     "field_offset" : 128,
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::FifoControllerIndirect",
   "name" : "android::FifoControllerIndirect",
   "record_kind" : "class",
   "referenced_type" : "type-348",
   "self_type" : "type-348",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaaudio/src/fifo/FifoControllerIndirect.h",
   "unique_id" : "_ZTSN7android22FifoControllerIndirectE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22FifoControllerIndirectE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android22FifoControllerIndirectD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android22FifoControllerIndirectD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android22FifoControllerIndirect14getReadCounterEv"
    },
    {
     "mangled_component_name" : "_ZN7android22FifoControllerIndirect14setReadCounterEx"
    },
    {
     "mangled_component_name" : "_ZN7android22FifoControllerIndirect15getWriteCounterEv"
    },
    {
     "mangled_component_name" : "_ZN7android22FifoControllerIndirect15setWriteCounterEx"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRequested",
     "referenced_type" : "type-36"
    },
    {
     "access" : "private",
     "field_name" : "mAcknowledged",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "AtomicRequestor",
   "name" : "AtomicRequestor",
   "record_kind" : "class",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AAudioUtilities.h",
   "unique_id" : "_ZTS15AtomicRequestor"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-34"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReadCounter",
     "field_offset" : 128,
     "referenced_type" : "type-356"
    },
    {
     "access" : "private",
     "field_name" : "mWriteCounter",
     "field_offset" : 192,
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "android::FifoController",
   "name" : "android::FifoController",
   "record_kind" : "class",
   "referenced_type" : "type-355",
   "self_type" : "type-355",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libaaudio/src/fifo/FifoController.h",
   "unique_id" : "_ZTSN7android14FifoControllerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14FifoControllerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14FifoControllerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14FifoControllerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android14FifoController14getReadCounterEv"
    },
    {
     "mangled_component_name" : "_ZN7android14FifoController14setReadCounterEx"
    },
    {
     "mangled_component_name" : "_ZN7android14FifoController15getWriteCounterEv"
    },
    {
     "mangled_component_name" : "_ZN7android14FifoController15setWriteCounterEx"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "upMessageQueueDescriptor",
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "downMessageQueueDescriptor",
     "field_offset" : 224,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "dataQueueDescriptor",
     "field_offset" : 448,
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "aaudio::EndpointDescriptor_s",
   "name" : "aaudio::EndpointDescriptor_s",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 84,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceDefinitions.h",
   "unique_id" : "_ZTSN6aaudio20EndpointDescriptor_sE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dataAddress",
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "writeCounterAddress",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "readCounterAddress",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "bytesPerFrame",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "framesPerBurst",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "capacityInFrames",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "aaudio::RingBufferDescriptor_s",
   "name" : "aaudio::RingBufferDescriptor_s",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 28,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceDefinitions.h",
   "unique_id" : "_ZTSN6aaudio22RingBufferDescriptor_sE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mCallbackEnabled",
     "field_offset" : 32,
     "referenced_type" : "type-43"
    },
    {
     "access" : "protected",
     "field_name" : "mDuckAndMuteVolume",
     "field_offset" : 64,
     "referenced_type" : "type-38"
    },
    {
     "access" : "private",
     "field_name" : "mStreamLock",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "access" : "private",
     "field_name" : "mPlayerBase",
     "field_offset" : 128,
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "mSamplesPerFrame",
     "field_offset" : 160,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSampleRate",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDeviceId",
     "field_offset" : 224,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSharingMode",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSharingModeMatchRequired",
     "field_offset" : 288,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mFormat",
     "field_offset" : 320,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 352,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mPerformanceMode",
     "field_offset" : 384,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mUsage",
     "field_offset" : 416,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mContentType",
     "field_offset" : 448,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mInputPreset",
     "field_offset" : 480,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mSessionId",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDeviceFormat",
     "field_offset" : 544,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDataCallbackProc",
     "field_offset" : 576,
     "referenced_type" : "type-47"
    },
    {
     "access" : "private",
     "field_name" : "mDataCallbackUserData",
     "field_offset" : 608,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mFramesPerDataCallback",
     "field_offset" : 640,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mDataCallbackThread",
     "field_offset" : 672,
     "referenced_type" : "type-53"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCallbackProc",
     "field_offset" : 704,
     "referenced_type" : "type-54"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCallbackUserData",
     "field_offset" : 736,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCallbackThread",
     "field_offset" : 768,
     "referenced_type" : "type-56"
    },
    {
     "access" : "private",
     "field_name" : "mHasThread",
     "field_offset" : 800,
     "referenced_type" : "type-32"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 832,
     "referenced_type" : "type-57"
    },
    {
     "access" : "private",
     "field_name" : "mPeriodNanoseconds",
     "field_offset" : 896,
     "referenced_type" : "type-58"
    },
    {
     "access" : "private",
     "field_name" : "mThreadProc",
     "field_offset" : 960,
     "referenced_type" : "type-59"
    },
    {
     "access" : "private",
     "field_name" : "mThreadArg",
     "field_offset" : 992,
     "referenced_type" : "type-51"
    },
    {
     "access" : "private",
     "field_name" : "mThreadRegistrationResult",
     "field_offset" : 1024,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "aaudio::AudioStream",
   "name" : "aaudio::AudioStream",
   "record_kind" : "class",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 136,
   "source_file" : "/frameworks/av/media/libaaudio/src/core/AudioStream.h",
   "unique_id" : "_ZTSN6aaudio11AudioStreamE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio11AudioStreamE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio11AudioStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio11AudioStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestStartEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isFlushSupportedEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isPauseSupportedEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestFlushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream11requestStopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream12getTimestampEiPxS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream18updateStateMachineEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream18waitForStateChangeEiPix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream4openERKNS_18AudioStreamBuilderE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream13setBufferSizeEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12createThreadExPFPvS1_ES1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream14registerThreadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream16unregisterThreadEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream13getBufferSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream17getBufferCapacityEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream17getFramesPerBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream12getXRunCountEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream6isMMapEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream18getPerformanceModeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6aaudio11AudioStream12getDirectionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream16getFramesWrittenEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream13getFramesReadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream5writeEPKvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream4readEPvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream11doSetVolumeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream22maybeConvertDeviceDataEPKvi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-27"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLastFramesWritten",
     "field_offset" : 9440,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamInternalCapture",
   "name" : "aaudio::AudioStreamInternalCapture",
   "record_kind" : "class",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 1192,
   "source_file" : "/frameworks/av/media/libaaudio/src/client/AudioStreamInternalCapture.h",
   "unique_id" : "_ZTSN6aaudio26AudioStreamInternalCaptureE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio26AudioStreamInternalCaptureE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCaptureD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCaptureD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal12requestStartEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isFlushSupportedEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isPauseSupportedEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestFlushEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal11requestStopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal12getTimestampEiPxS1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal18updateStateMachineEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream18waitForStateChangeEiPix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal4openERKNS_18AudioStreamBuilderE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal5closeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal13setBufferSizeEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12createThreadExPFPvS1_ES1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal14registerThreadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal16unregisterThreadEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal13getBufferSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal17getBufferCapacityEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal17getFramesPerBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal12getXRunCountEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal6isMMapEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream18getPerformanceModeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio26AudioStreamInternalCapture12getDirectionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCapture16getFramesWrittenEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCapture13getFramesReadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream5writeEPKvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCapture4readEPvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream11doSetVolumeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream22maybeConvertDeviceDataEPKvi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCapture12callbackLoopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCapture14processDataNowEPvixPx"
    },
    {
     "mangled_component_name" : "_ZN6aaudio26AudioStreamInternalCapture34advanceClientToMatchServerPositionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal17onFlushFromServerEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-27"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLastFramesRead",
     "field_offset" : 9440,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mVolumeRamp",
     "field_offset" : 9504,
     "referenced_type" : "type-68"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamInternalPlay",
   "name" : "aaudio::AudioStreamInternalPlay",
   "record_kind" : "class",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 1208,
   "source_file" : "/frameworks/av/media/libaaudio/src/client/AudioStreamInternalPlay.h",
   "unique_id" : "_ZTSN6aaudio23AudioStreamInternalPlayE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio23AudioStreamInternalPlayE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlayD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlayD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal12requestStartEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio23AudioStreamInternalPlay16isFlushSupportedEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio23AudioStreamInternalPlay16isPauseSupportedEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay12requestPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay12requestFlushEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal11requestStopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal12getTimestampEiPxS1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal18updateStateMachineEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream18waitForStateChangeEiPix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay4openERKNS_18AudioStreamBuilderE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal5closeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal13setBufferSizeEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12createThreadExPFPvS1_ES1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal14registerThreadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal16unregisterThreadEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal13getBufferSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal17getBufferCapacityEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal17getFramesPerBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio19AudioStreamInternal12getXRunCountEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio19AudioStreamInternal6isMMapEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream18getPerformanceModeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio23AudioStreamInternalPlay12getDirectionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay16getFramesWrittenEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay13getFramesReadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay5writeEPKvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream4readEPvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay11doSetVolumeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream22maybeConvertDeviceDataEPKvi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay12callbackLoopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay14processDataNowEPvixPx"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay34advanceClientToMatchServerPositionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio23AudioStreamInternalPlay17onFlushFromServerEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTarget",
     "referenced_type" : "type-69"
    },
    {
     "access" : "private",
     "field_name" : "mLengthInFrames",
     "field_offset" : 32,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mRemaining",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mLevelFrom",
     "field_offset" : 96,
     "referenced_type" : "type-38"
    },
    {
     "access" : "private",
     "field_name" : "mLevelTo",
     "field_offset" : 128,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "LinearRamp",
   "name" : "LinearRamp",
   "record_kind" : "class",
   "referenced_type" : "type-68",
   "self_type" : "type-68",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/LinearRamp.h",
   "unique_id" : "_ZTS10LinearRamp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "channelCount",
     "field_offset" : 64,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "AAudioDataConverter::FormattedData",
   "name" : "AAudioDataConverter::FormattedData",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AAudioUtilities.h",
   "unique_id" : "_ZTSN19AAudioDataConverter13FormattedDataE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "FixedBlockProcessor",
   "name" : "FixedBlockProcessor",
   "record_kind" : "class",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/FixedBlockAdapter.h",
   "unique_id" : "_ZTS19FixedBlockProcessor",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI19FixedBlockProcessor"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN19FixedBlockProcessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN19FixedBlockProcessorD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN19FixedBlockProcessor19onProcessFixedBlockEPhi"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFixedBlockProcessor",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "access" : "protected",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-22"
    },
    {
     "access" : "protected",
     "field_name" : "mSize",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mPosition",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "FixedBlockAdapter",
   "name" : "FixedBlockAdapter",
   "record_kind" : "class",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/FixedBlockAdapter.h",
   "unique_id" : "_ZTS17FixedBlockAdapter",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI17FixedBlockAdapter"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN17FixedBlockAdapterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN17FixedBlockAdapterD0Ev"
    },
    {
     "mangled_component_name" : "_ZN17FixedBlockAdapter4openEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN17FixedBlockAdapter20processVariableBlockEPhi"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "aaudio::AAudioServiceInterface",
   "name" : "aaudio::AAudioServiceInterface",
   "record_kind" : "class",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libaaudio/src/binding/AAudioServiceInterface.h",
   "unique_id" : "_ZTSN6aaudio22AAudioServiceInterfaceE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio22AAudioServiceInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface14registerClientERKN7android2spINS1_13IAAudioClientEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface10openStreamERKNS_19AAudioStreamRequestERNS_25AAudioStreamConfigurationE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface11closeStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface20getStreamDescriptionEiRNS_23AudioEndpointParcelableE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface11startStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface11pauseStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface10stopStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface11flushStreamEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface19registerAudioThreadEiix"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface21unregisterAudioThreadEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface11startClientEiRKN7android11AudioClientEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio22AAudioServiceInterface10stopClientEii"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-42"
    },
    {
     "referenced_type" : "type-77"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFramesWritten",
     "field_offset" : 1088,
     "referenced_type" : "type-83"
    },
    {
     "access" : "protected",
     "field_name" : "mFramesRead",
     "field_offset" : 1216,
     "referenced_type" : "type-83"
    },
    {
     "access" : "protected",
     "field_name" : "mTimestampPosition",
     "field_offset" : 1344,
     "referenced_type" : "type-83"
    },
    {
     "access" : "protected",
     "field_name" : "mBlockAdapter",
     "field_offset" : 1472,
     "referenced_type" : "type-81"
    },
    {
     "access" : "protected",
     "field_name" : "mPositionWhenStarting",
     "field_offset" : 1504,
     "referenced_type" : "type-6"
    },
    {
     "access" : "protected",
     "field_name" : "mCallbackBufferSize",
     "field_offset" : 1536,
     "referenced_type" : "type-4"
    },
    {
     "access" : "protected",
     "field_name" : "mDeviceCallback",
     "field_offset" : 1568,
     "referenced_type" : "type-84"
    },
    {
     "access" : "protected",
     "field_name" : "mRequestDisconnect",
     "field_offset" : 1600,
     "referenced_type" : "type-35"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamLegacy",
   "name" : "aaudio::AudioStreamLegacy",
   "record_kind" : "class",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 208,
   "source_file" : "/frameworks/av/media/libaaudio/src/legacy/AudioStreamLegacy.h",
   "unique_id" : "_ZTSN6aaudio17AudioStreamLegacyE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio17AudioStreamLegacyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacyD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestStartEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isFlushSupportedEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isPauseSupportedEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestFlushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream11requestStopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream12getTimestampEiPxS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream18updateStateMachineEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream18waitForStateChangeEiPix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream4openERKNS_18AudioStreamBuilderE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio11AudioStream13setBufferSizeEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12createThreadExPFPvS1_ES1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream14registerThreadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream16unregisterThreadEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream13getBufferSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream17getBufferCapacityEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream17getFramesPerBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream12getXRunCountEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream6isMMapEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream18getPerformanceModeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK6aaudio11AudioStream12getDirectionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy16getFramesWrittenEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy13getFramesReadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream5writeEPKvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream4readEPvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream11doSetVolumeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream22maybeConvertDeviceDataEPKvi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy15processCallbackEiPv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy19onProcessFixedBlockEPhi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy27incrementClientFrameCounterEi"
    },
    {
     "component_value" : -132,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio17AudioStreamLegacyE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn132_N6aaudio17AudioStreamLegacyD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn132_N6aaudio17AudioStreamLegacyD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn132_N6aaudio17AudioStreamLegacy19onProcessFixedBlockEPhi"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCounter64",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mCounter32",
     "field_offset" : 96,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "MonotonicCounter",
   "name" : "MonotonicCounter",
   "record_kind" : "class",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/MonotonicCounter.h",
   "unique_id" : "_ZTS16MonotonicCounter",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16MonotonicCounter"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16MonotonicCounterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16MonotonicCounterD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-88"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mParent",
     "field_offset" : 64,
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamLegacy::StreamDeviceCallback",
   "name" : "aaudio::AudioStreamLegacy::StreamDeviceCallback",
   "record_kind" : "class",
   "referenced_type" : "type-87",
   "self_type" : "type-87",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libaaudio/src/legacy/AudioStreamLegacy.h",
   "unique_id" : "_ZTSN6aaudio17AudioStreamLegacy20StreamDeviceCallbackE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio17AudioStreamLegacy20StreamDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy20StreamDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy20StreamDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy20StreamDeviceCallback19onAudioDeviceUpdateEii"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mValues",
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mCounter",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SimpleDoubleBuffer<Timestamp>",
   "name" : "SimpleDoubleBuffer<Timestamp>",
   "record_kind" : "class",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 36,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/AAudioUtilities.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTS18SimpleDoubleBufferI9TimestampE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "FixedBlockWriter",
   "name" : "FixedBlockWriter",
   "record_kind" : "class",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 20,
   "source_file" : "/frameworks/av/media/libaaudio/src/utility/FixedBlockWriter.h",
   "unique_id" : "_ZTS16FixedBlockWriter",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16FixedBlockWriter"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16FixedBlockWriterD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16FixedBlockWriterD0Ev"
    },
    {
     "mangled_component_name" : "_ZN17FixedBlockAdapter4openEi"
    },
    {
     "mangled_component_name" : "_ZN16FixedBlockWriter20processVariableBlockEPhi"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-82"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAudioRecord",
     "field_offset" : 1664,
     "referenced_type" : "type-93"
    },
    {
     "access" : "private",
     "field_name" : "mFixedBlockWriter",
     "field_offset" : 1696,
     "referenced_type" : "type-90"
    },
    {
     "access" : "private",
     "field_name" : "mOpPackageName",
     "field_offset" : 1856,
     "referenced_type" : "type-94"
    },
    {
     "access" : "private",
     "field_name" : "mFormatConversionBufferFloat",
     "field_offset" : 1888,
     "referenced_type" : "type-95"
    },
    {
     "access" : "private",
     "field_name" : "mFormatConversionBufferI16",
     "field_offset" : 1920,
     "referenced_type" : "type-96"
    },
    {
     "access" : "private",
     "field_name" : "mFormatConversionBufferSizeInFrames",
     "field_offset" : 1952,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "aaudio::AudioStreamRecord",
   "name" : "aaudio::AudioStreamRecord",
   "record_kind" : "class",
   "referenced_type" : "type-92",
   "self_type" : "type-92",
   "size" : 248,
   "source_file" : "/frameworks/av/media/libaaudio/src/legacy/AudioStreamRecord.h",
   "unique_id" : "_ZTSN6aaudio17AudioStreamRecordE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio17AudioStreamRecordE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecordD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecordD0Ev"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord12requestStartEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isFlushSupportedEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream16isPauseSupportedEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestPauseEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12requestFlushEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord11requestStopEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord12getTimestampEiPxS1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord18updateStateMachineEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream18waitForStateChangeEiPix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord4openERKNS_18AudioStreamBuilderE"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord5closeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord13setBufferSizeEi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream12createThreadExPFPvS1_ES1_"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream14registerThreadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream16unregisterThreadEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio17AudioStreamRecord13getBufferSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio17AudioStreamRecord17getBufferCapacityEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio17AudioStreamRecord17getFramesPerBurstEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio17AudioStreamRecord12getXRunCountEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream6isMMapEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio11AudioStream18getPerformanceModeEv"
    },
    {
     "mangled_component_name" : "_ZNK6aaudio17AudioStreamRecord12getDirectionEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord16getFramesWrittenEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy13getFramesReadEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream5writeEPKvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord4readEPvix"
    },
    {
     "mangled_component_name" : "_ZN6aaudio11AudioStream11doSetVolumeEv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord22maybeConvertDeviceDataEPKvi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord15processCallbackEiPv"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamLegacy19onProcessFixedBlockEPhi"
    },
    {
     "mangled_component_name" : "_ZN6aaudio17AudioStreamRecord27incrementClientFrameCounterEi"
    },
    {
     "component_value" : -132,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN6aaudio17AudioStreamRecordE"
    },
    {
     "kind" : "complete_dtor_pointer",
