{
 "array_types" :
 [
  {
   "linker_set_key" : "void (*[])(const SkMatrix &, float, float, SkPoint *)",
   "name" : "void (*[])(const SkMatrix &, float, float, SkPoint *)",
   "referenced_type" : "type-1185",
   "self_type" : "type-1189",
   "source_file" : "/external/skia/include/core/SkMatrix.h"
  },
  {
   "linker_set_key" : "void (*[])(const SkMatrix &, SkPoint *, const SkPoint *, int)",
   "name" : "void (*[])(const SkMatrix &, SkPoint *, const SkPoint *, int)",
   "referenced_type" : "type-1187",
   "self_type" : "type-1191",
   "source_file" : "/external/skia/include/core/SkMatrix.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float [4][4]",
   "name" : "float [4][4]",
   "referenced_type" : "type-1194",
   "self_type" : "type-1200",
   "size" : 64,
   "source_file" : "/external/skia/include/core/SkMatrix44.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [29]",
   "name" : "int [29]",
   "referenced_type" : "type-13",
   "self_type" : "type-908",
   "size" : 116,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [8]",
   "name" : "int [8]",
   "referenced_type" : "type-13",
   "self_type" : "type-658",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [1]",
   "name" : "int [1]",
   "referenced_type" : "type-13",
   "self_type" : "type-660",
   "size" : 4,

   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<char16_t>",
   "name" : "const std::hash<char16_t>",
   "referenced_type" : "type-819",
   "self_type" : "type-820",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<char32_t>",
   "name" : "const std::hash<char32_t>",
   "referenced_type" : "type-822",
   "self_type" : "type-823",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<wchar_t>",
   "name" : "const std::hash<wchar_t>",
   "referenced_type" : "type-825",
   "self_type" : "type-826",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<short>",
   "name" : "const std::hash<short>",
   "referenced_type" : "type-828",
   "self_type" : "type-829",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<unsigned short>",
   "name" : "const std::hash<unsigned short>",
   "referenced_type" : "type-831",
   "self_type" : "type-832",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<int>",
   "name" : "const std::hash<int>",
   "referenced_type" : "type-834",
   "self_type" : "type-835",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<unsigned int>",
   "name" : "const std::hash<unsigned int>",
   "referenced_type" : "type-837",
   "self_type" : "type-838",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<long>",
   "name" : "const std::hash<long>",
   "referenced_type" : "type-840",
   "self_type" : "type-841",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<unsigned long>",
   "name" : "const std::hash<unsigned long>",
   "referenced_type" : "type-843",
   "self_type" : "type-844",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<float>",
   "name" : "const std::hash<float>",
   "referenced_type" : "type-848",
   "self_type" : "type-849",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<double>",
   "name" : "const std::hash<double>",
   "referenced_type" : "type-851",
   "self_type" : "type-852",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<long double>",
   "name" : "const std::hash<long double>",
   "referenced_type" : "type-854",
   "self_type" : "type-855",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::hash<nullptr_t>",
   "name" : "const std::hash<nullptr_t>",
   "referenced_type" : "type-857",
   "self_type" : "type-858",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const JNINativeInterface",
   "name" : "const JNINativeInterface",
   "referenced_type" : "type-8",
   "self_type" : "type-7",
   "size" : 932,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const char *const[65]",
   "name" : "const char *const[65]",
   "referenced_type" : "type-956",
   "self_type" : "type-957",
   "size" : 260,
   "source_file" : "/bionic/libc/include/signal.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::type_info",
   "name" : "const std::type_info",
   "referenced_type" : "type-966",
   "self_type" : "type-968",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::allocator_arg_t",
   "name" : "const std::allocator_arg_t",
   "referenced_type" : "type-975",
   "self_type" : "type-976",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::float_round_style",
   "name" : "const std::float_round_style",
   "referenced_type" : "type-983",
   "self_type" : "type-986",
   "size" : 4,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::float_denorm_style",
   "name" : "const std::float_denorm_style",
   "referenced_type" : "type-984",
   "self_type" : "type-985",
   "size" : 4,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__ignore_t<unsigned char>",
   "name" : "const std::__ignore_t<unsigned char>",
   "referenced_type" : "type-999",
   "self_type" : "type-1000",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-9",
   "self_type" : "type-704",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_equal<0>",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "type-1001",
   "self_type" : "type-1001",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_equalILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_less<0>",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "type-1002",
   "self_type" : "type-1002",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__112__tuple_lessILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_cat_return<>",
   "name" : "std::__tuple_cat_return<>",
   "referenced_type" : "type-1003",
   "self_type" : "type-1003",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__118__tuple_cat_returnIJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "std::__libcpp_refstring",
   "name" : "std::__libcpp_refstring",
   "record_kind" : "class",
   "referenced_type" : "type-1004",
   "self_type" : "type-1004",
   "size" : 4,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSNSt3__118__libcpp_refstringE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 32,
     "referenced_type" : "type-1004"
    }
   ],
   "linker_set_key" : "std::logic_error",
   "name" : "std::logic_error",
   "record_kind" : "class",
   "referenced_type" : "type-1007",
   "self_type" : "type-1007",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11logic_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11logic_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 32,
     "referenced_type" : "type-1004"
    }
   ],
   "linker_set_key" : "std::runtime_error",
   "name" : "std::runtime_error",
   "record_kind" : "class",
   "referenced_type" : "type-1008",
   "self_type" : "type-1008",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt13runtime_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13runtime_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1007"
    }
   ],
   "linker_set_key" : "std::domain_error",
   "name" : "std::domain_error",
   "record_kind" : "class",
   "referenced_type" : "type-1009",
   "self_type" : "type-1009",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12domain_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12domain_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1007"
    }
   ],
   "linker_set_key" : "std::invalid_argument",
   "name" : "std::invalid_argument",
   "record_kind" : "class",
   "referenced_type" : "type-1014",
   "self_type" : "type-1014",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt16invalid_argument",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16invalid_argument"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1007"
    }
   ],
   "linker_set_key" : "std::length_error",
   "name" : "std::length_error",
   "record_kind" : "class",
   "referenced_type" : "type-1016",
   "self_type" : "type-1016",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12length_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12length_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1007"
    }
   ],
   "linker_set_key" : "std::out_of_range",
   "name" : "std::out_of_range",
   "record_kind" : "class",
   "referenced_type" : "type-1018",
   "self_type" : "type-1018",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12out_of_range",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12out_of_range"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1008"
    }
   ],
   "linker_set_key" : "std::range_error",
   "name" : "std::range_error",
   "record_kind" : "class",
   "referenced_type" : "type-1020",
   "self_type" : "type-1020",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11range_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11range_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1008"
    }
   ],
   "linker_set_key" : "std::overflow_error",
   "name" : "std::overflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1022",
   "self_type" : "type-1022",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt14overflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt14overflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1008"
    }
   ],
   "linker_set_key" : "std::underflow_error",
   "name" : "std::underflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1024",
   "self_type" : "type-1024",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt15underflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt15underflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-1033"
    }
   ],
   "linker_set_key" : "std::atomic_flag",
   "name" : "std::atomic_flag",
   "referenced_type" : "type-1032",
   "self_type" : "type-1032",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic",
   "unique_id" : "_ZTSNSt3__111atomic_flagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<void>",
   "name" : "std::allocator<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1039",
   "self_type" : "type-1039",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__19allocatorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<const void>",
   "name" : "std::allocator<const void>",
   "record_kind" : "class",
   "referenced_type" : "type-1040",
   "self_type" : "type-1040",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-671" ],
   "unique_id" : "_ZTSNSt3__19allocatorIKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__second_tag",
   "name" : "std::__second_tag",
   "referenced_type" : "type-1041",
   "self_type" : "type-1041",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__second_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "std::__destruct_n",
   "name" : "std::__destruct_n",
   "referenced_type" : "type-1042",
   "self_type" : "type-1042",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__destruct_nE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "linker_set_key" : "std::bad_weak_ptr",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-1045",
   "self_type" : "type-1045",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112bad_weak_ptrE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 32,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "std::__shared_count",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "type-1046",
   "self_type" : "type-1046",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114__shared_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1046"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__shared_weak_owners_",
     "field_offset" : 64,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "std::__shared_weak_count",
   "name" : "std::__shared_weak_count",
   "record_kind" : "class",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 12,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__119__shared_weak_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__119__shared_weak_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__119__shared_weak_count21__on_zero_shared_weakEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "name" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "record_kind" : "class",
   "referenced_type" : "type-1054",
   "self_type" : "type-1054",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-1055" ],
   "unique_id" : "_ZTSNSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::owner_less<void>",
   "name" : "std::owner_less<void>",
   "referenced_type" : "type-1056",
   "self_type" : "type-1056",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110owner_lessIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__lx",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "std::__sp_mut",
   "name" : "std::__sp_mut",
   "record_kind" : "class",
   "referenced_type" : "type-1057",
   "self_type" : "type-1057",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__18__sp_mutE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "type-1059"
    }
   ],
   "linker_set_key" : "std::pointer_safety",
   "name" : "std::pointer_safety",
   "referenced_type" : "type-1058",
   "self_type" : "type-1058",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114pointer_safetyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::plus<void>",
   "name" : "std::plus<void>",
   "referenced_type" : "type-1063",
   "self_type" : "type-1063",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__14plusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::minus<void>",
   "name" : "std::minus<void>",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__15minusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::multiplies<void>",
   "name" : "std::multiplies<void>",
   "referenced_type" : "type-1065",
   "self_type" : "type-1065",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110multipliesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::divides<void>",
   "name" : "std::divides<void>",
   "referenced_type" : "type-1066",
   "self_type" : "type-1066",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17dividesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::modulus<void>",
   "name" : "std::modulus<void>",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17modulusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::negate<void>",
   "name" : "std::negate<void>",
   "referenced_type" : "type-1068",
   "self_type" : "type-1068",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__16negateIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::equal_to<void>",
   "name" : "std::equal_to<void>",
   "referenced_type" : "type-1069",
   "self_type" : "type-1069",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__18equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::not_equal_to<void>",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "type-1070",
   "self_type" : "type-1070",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__112not_equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater<void>",
   "name" : "std::greater<void>",
   "referenced_type" : "type-1071",
   "self_type" : "type-1071",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17greaterIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater_equal<void>",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "type-1072",
   "self_type" : "type-1072",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__113greater_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less_equal<void>",
   "name" : "std::less_equal<void>",
   "referenced_type" : "type-1073",
   "self_type" : "type-1073",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110less_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_and<void>",
   "name" : "std::logical_and<void>",
   "referenced_type" : "type-1074",
   "self_type" : "type-1074",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__111logical_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_or<void>",
   "name" : "std::logical_or<void>",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110logical_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_not<void>",
   "name" : "std::logical_not<void>",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__111logical_notIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_and<void>",
   "name" : "std::bit_and<void>",
   "referenced_type" : "type-1077",
   "self_type" : "type-1077",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17bit_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_or<void>",
   "name" : "std::bit_or<void>",
   "referenced_type" : "type-1078",
   "self_type" : "type-1078",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__16bit_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_xor<void>",
   "name" : "std::bit_xor<void>",
   "referenced_type" : "type-1079",
   "self_type" : "type-1079",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17bit_xorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_not<void>",
   "name" : "std::bit_not<void>",
   "referenced_type" : "type-1080",
   "self_type" : "type-1080",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17bit_notIvEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "linker_set_key" : "std::bad_function_call",
   "name" : "std::bad_function_call",
   "record_kind" : "class",
   "referenced_type" : "type-1081",
   "self_type" : "type-1081",
   "size" : 4,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__117bad_function_callE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__117bad_function_callE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<1>",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "type-1082",
   "self_type" : "type-1082",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<2>",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "type-1083",
   "self_type" : "type-1083",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<3>",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "type-1084",
   "self_type" : "type-1084",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi3EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<4>",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "type-1085",
   "self_type" : "type-1085",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<5>",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "type-1086",
   "self_type" : "type-1086",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi5EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<6>",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "type-1087",
   "self_type" : "type-1087",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi6EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<7>",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "type-1088",
   "self_type" : "type-1088",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi7EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<8>",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "type-1089",
   "self_type" : "type-1089",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<9>",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "type-1090",
   "self_type" : "type-1090",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi9EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<10>",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "type-1091",
   "self_type" : "type-1091",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi10EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__less<unsigned int, unsigned int>",
   "name" : "std::__less<unsigned int, unsigned int>",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-525", "type-525" ],
   "unique_id" : "_ZTSNSt3__16__lessIjjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__p_",
     "referenced_type" : "type-1110"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<int>",
   "name" : "std::uniform_int_distribution<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1109",
   "self_type" : "type-1109",
   "size" : 8,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__a_",
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "__b_",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<int>::param_type",
   "name" : "std::uniform_int_distribution<int>::param_type",
   "record_kind" : "class",
   "referenced_type" : "type-1110",
   "self_type" : "type-1110",
   "size" : 8,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIiE10param_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__return_temporary_buffer",
   "name" : "std::__return_temporary_buffer",
   "referenced_type" : "type-1111",
   "self_type" : "type-1111",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__125__return_temporary_bufferE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<>",
   "name" : "skstd::index_sequence<>",
   "referenced_type" : "type-1112",
   "self_type" : "type-1112",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<0>",
   "name" : "skstd::index_sequence<0>",
   "referenced_type" : "type-1113",
   "self_type" : "type-1113",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJLj0EEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1112"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<0>",
   "name" : "skstd::make_index_sequence<0>",
   "referenced_type" : "type-1114",
   "self_type" : "type-1114",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILj0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1113"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<1>",
   "name" : "skstd::make_index_sequence<1>",
   "referenced_type" : "type-1115",
   "self_type" : "type-1115",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILj1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "name" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "referenced_type" : "type-1116",
   "self_type" : "type-1116",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-1117", "type-1118", "type-1119", "type-1120" ],
   "unique_id" : "_ZTSN9sktfitsin7Private6SkTMuxILb1ELb1ENS0_23SkTFitsIn_Signed2SignedIsiEENS0_25SkTFitsIn_Signed2UnsignedIsiEENS0_25SkTFitsIn_Unsigned2SignedIsiEENS0_26SkTFitsIn_Unsigned2UnsigedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>",
   "name" : "sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>",
   "referenced_type" : "type-1117",
   "self_type" : "type-1117",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "referenced_type" : "type-1121",
   "self_type" : "type-1121",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIsiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "referenced_type" : "type-1122",
   "self_type" : "type-1122",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-13", "type-78" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIisEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "name" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "referenced_type" : "type-1123",
   "self_type" : "type-1123",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private9SkTFitsInIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<int, false>",
   "name" : "sktfitsin::Private::underlying_type<int, false>",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIiLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<short, false>",
   "name" : "sktfitsin::Private::underlying_type<short, false>",
   "referenced_type" : "type-1125",
   "self_type" : "type-1125",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIsLb0EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fFloat",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fSignBitInt",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "SkFloatIntUnion",
   "name" : "SkFloatIntUnion",
   "record_kind" : "union",
   "referenced_type" : "type-1134",
   "self_type" : "type-1134",
   "size" : 4,
   "source_file" : "/external/skia/include/private/SkFloatBits.h",
   "unique_id" : "_ZTS15SkFloatIntUnion"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "SkColor4f",
   "name" : "SkColor4f",
   "referenced_type" : "type-1136",
   "self_type" : "type-1136",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColor.h",
   "unique_id" : "_ZTS9SkColor4f"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "fY",
     "field_offset" : 16,
     "referenced_type" : "type-78"
    }
   ],
   "linker_set_key" : "SkIPoint16",
   "name" : "SkIPoint16",
   "referenced_type" : "type-1141",
   "self_type" : "type-1141",
   "size" : 4,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS10SkIPoint16"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "SkIPoint",
   "name" : "SkIPoint",
   "referenced_type" : "type-1145",
   "self_type" : "type-1145",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS8SkIPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "SkPoint",
   "name" : "SkPoint",
   "referenced_type" : "type-1150",
   "self_type" : "type-1150",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS7SkPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "SkISize",
   "name" : "SkISize",
   "referenced_type" : "type-1156",
   "self_type" : "type-1156",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS7SkISize"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "SkSize",
   "name" : "SkSize",
   "referenced_type" : "type-1160",
   "self_type" : "type-1160",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS6SkSize"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "SkIRect",
   "name" : "SkIRect",
   "referenced_type" : "type-1166",
   "self_type" : "type-1166",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS7SkIRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "SkRect",
   "name" : "SkRect",
   "referenced_type" : "type-1172",
   "self_type" : "type-1172",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS6SkRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-1178"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 288,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "SkMatrix",
   "name" : "SkMatrix",
   "record_kind" : "class",
   "referenced_type" : "type-1177",
   "self_type" : "type-1177",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkMatrix.h",
   "unique_id" : "_ZTS8SkMatrix"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fData",
     "referenced_type" : "type-1194"
    }
   ],
   "linker_set_key" : "SkVector4",
   "name" : "SkVector4",
   "referenced_type" : "type-1193",
   "self_type" : "type-1193",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS9SkVector4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-1200"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 512,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "SkMatrix44",
   "name" : "SkMatrix44",
   "record_kind" : "class",
   "referenced_type" : "type-1199",
   "self_type" : "type-1199",
   "size" : 68,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS10SkMatrix44"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-1217"
    }
   ],
   "linker_set_key" : "sk_sp<SkPixelRef>",
   "name" : "sk_sp<SkPixelRef>",
   "record_kind" : "class",
   "referenced_type" : "type-1216",
   "self_type" : "type-1216",
   "size" : 4,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-1219" ],
   "unique_id" : "_ZTS5sk_spI10SkPixelRefE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fRX",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fRY",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fGX",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fGY",
     "field_offset" : 96,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fBX",
     "field_offset" : 128,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fBY",
     "field_offset" : 160,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fWX",
     "field_offset" : 192,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fWY",
     "field_offset" : 224,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "SkColorSpacePrimaries",
   "name" : "SkColorSpacePrimaries",
   "referenced_type" : "type-1224",
   "self_type" : "type-1224",
   "size" : 32,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS21SkColorSpacePrimaries"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fG",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fA",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fC",
     "field_offset" : 96,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fD",
     "field_offset" : 128,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fE",
     "field_offset" : 160,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fF",
     "field_offset" : 192,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "SkColorSpaceTransferFn",
   "name" : "SkColorSpaceTransferFn",
   "referenced_type" : "type-1225",
   "self_type" : "type-1225",
   "size" : 28,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS22SkColorSpaceTransferFn"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fColorSpace",
     "referenced_type" : "type-544"
    },
    {
     "access" : "private",
     "field_name" : "fWidth",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "fHeight",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "fColorType",
     "field_offset" : 96,
     "referenced_type" : "type-1237"
    },
    {
     "access" : "private",
     "field_name" : "fAlphaType",
     "field_offset" : 128,
     "referenced_type" : "type-1236"
    }
   ],
   "linker_set_key" : "SkImageInfo",
   "name" : "SkImageInfo",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 20,
   "source_file" : "/external/skia/include/core/SkImageInfo.h",
   "unique_id" : "_ZTS11SkImageInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixels",
     "referenced_type" : "type-670"
    },
    {
     "access" : "private",
     "field_name" : "fRowBytes",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    },
    {
     "access" : "private",
     "field_name" : "fInfo",
     "field_offset" : 64,
     "referenced_type" : "type-1239"
    }
   ],
   "linker_set_key" : "SkPixmap",
   "name" : "SkPixmap",
   "record_kind" : "class",
   "referenced_type" : "type-1245",
   "self_type" : "type-1245",
   "size" : 28,
   "source_file" : "/external/skia/include/core/SkPixmap.h",
   "unique_id" : "_ZTS8SkPixmap"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixelRef",
     "referenced_type" : "type-1216"
    },
    {
     "access" : "private",
     "field_name" : "fPixmap",
     "field_offset" : 32,
     "referenced_type" : "type-1245"
    },
    {
     "access" : "private",
     "field_name" : "fFlags",
     "field_offset" : 256,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "SkBitmap",
   "name" : "SkBitmap",
   "record_kind" : "class",
   "referenced_type" : "type-1256",
   "self_type" : "type-1256",
   "size" : 36,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTS8SkBitmap"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-547"
    }
   ],
   "linker_set_key" : "SkBitmap::Allocator",
   "name" : "SkBitmap::Allocator",
   "record_kind" : "class",
   "referenced_type" : "type-1262",
   "self_type" : "type-1262",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap9AllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap9AllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkBitmap9Allocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1262"
    }
   ],
   "linker_set_key" : "SkBitmap::HeapAllocator",
   "name" : "SkBitmap::HeapAllocator",
   "record_kind" : "class",
   "referenced_type" : "type-1267",
   "self_type" : "type-1267",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap13HeapAllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap13HeapAllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "group",
     "field_offset" : 64,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "type-1270",
   "self_type" : "type-1270",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS16JavaVMAttachArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "type-1271",
   "self_type" : "type-1271",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12JavaVMOption"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "type-1273"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 96,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "type-1272",
   "self_type" : "type-1272",
   "size" : 16,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14JavaVMInitArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "AndroidBitmapInfo",
   "name" : "AndroidBitmapInfo",
   "referenced_type" : "type-1275",
   "self_type" : "type-1275",
   "size" : 20,
   "source_file" : "/frameworks/native/include/android/bitmap.h",
   "unique_id" : "AndroidBitmapInfo"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int> >",
   "referenced_type" : "type-1279",
   "self_type" : "type-1279",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1117", "type-1280" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1EN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEENS2_25SkTFitsIn_Signed2UnsignedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "referenced_type" : "type-1281",
   "self_type" : "type-1281",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1282", "type-1283" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1EN9sktfitsin7Private25SkTFitsIn_Unsigned2SignedIsiEENS2_26SkTFitsIn_Unsigned2UnsigedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int> >",
   "referenced_type" : "type-1284",
   "self_type" : "type-1284",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1117", "type-1285" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1EN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEENS2_25SkTFitsIn_Unsigned2SignedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<false, sktfitsin::Private::SkTInRange_True<int>, sktfitsin::Private::SkTInRange_Cast<short, int> >",
   "name" : "std::conditional<false, sktfitsin::Private::SkTInRange_True<int>, sktfitsin::Private::SkTInRange_Cast<short, int> >",
   "referenced_type" : "type-1286",
   "self_type" : "type-1286",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1287", "type-1288" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb0EN9sktfitsin7Private15SkTInRange_TrueIiEENS2_15SkTInRange_CastIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTInRange_Cast<short, int>",
   "name" : "sktfitsin::Private::SkTInRange_Cast<short, int>",
   "referenced_type" : "type-1288",
   "self_type" : "type-1288",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15SkTInRange_CastIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, double>",
   "name" : "std::enable_if<false, double>",
   "referenced_type" : "type-1289",
   "self_type" : "type-1289",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, int>",
   "name" : "std::enable_if<false, int>",
   "referenced_type" : "type-1290",
   "self_type" : "type-1290",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0EiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, long long>",
   "name" : "std::enable_if<false, long long>",
   "referenced_type" : "type-1291",
   "self_type" : "type-1291",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0ExEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, long>",
   "name" : "std::enable_if<false, long>",
   "referenced_type" : "type-1292",
   "self_type" : "type-1292",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-631" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0ElEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<true, void>",
   "name" : "std::enable_if<true, void>",
   "referenced_type" : "type-1293",
   "self_type" : "type-1293",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb1EvEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-1295"
    }
   ],
   "linker_set_key" : "std::__two",
   "name" : "std::__two",
   "referenced_type" : "type-1294",
   "self_type" : "type-1294",
   "size" : 2,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__twoE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned int, 0>",
   "name" : "std::integral_constant<unsigned int, 0>",
   "referenced_type" : "type-1297",
   "self_type" : "type-1297",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIjLj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 0>",
   "name" : "std::integral_constant<int, 0>",
   "referenced_type" : "type-1298",
   "self_type" : "type-1298",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 1>",
   "name" : "std::integral_constant<int, 1>",
   "referenced_type" : "type-1299",
   "self_type" : "type-1299",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 2>",
   "name" : "std::integral_constant<int, 2>",
   "referenced_type" : "type-1300",
   "self_type" : "type-1300",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__lazy_and_impl<true>",
   "name" : "std::__lazy_and_impl<true>",
   "referenced_type" : "type-1301",
   "self_type" : "type-1301",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115__lazy_and_implILb1EJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::__lazy_or_impl<false>",
   "name" : "std::__lazy_or_impl<false>",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__lazy_or_implILb0EJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__and_<>",
   "name" : "std::__and_<>",
   "referenced_type" : "type-1303",
   "self_type" : "type-1303",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__16__and_IJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::__or_<>",
   "name" : "std::__or_<>",
   "referenced_type" : "type-1304",
   "self_type" : "type-1304",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__or_IJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<int>",
   "name" : "std::remove_const<int>",
   "referenced_type" : "type-1305",
   "self_type" : "type-1305",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__112remove_constIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<double>",
   "name" : "std::remove_const<double>",
   "referenced_type" : "type-1306",
   "self_type" : "type-1306",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__112remove_constIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<float>",
   "name" : "std::remove_const<float>",
   "referenced_type" : "type-1307",
   "self_type" : "type-1307",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__112remove_constIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<short>",
   "name" : "std::remove_const<short>",
   "referenced_type" : "type-1308",
   "self_type" : "type-1308",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__112remove_constIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<int>",
   "name" : "std::remove_volatile<int>",
   "referenced_type" : "type-1309",
   "self_type" : "type-1309",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<double>",
   "name" : "std::remove_volatile<double>",
   "referenced_type" : "type-1310",
   "self_type" : "type-1310",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<float>",
   "name" : "std::remove_volatile<float>",
   "referenced_type" : "type-1311",
   "self_type" : "type-1311",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<short>",
   "name" : "std::remove_volatile<short>",
   "referenced_type" : "type-1312",
   "self_type" : "type-1312",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<int>",
   "name" : "std::remove_cv<int>",
   "referenced_type" : "type-1313",
   "self_type" : "type-1313",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<double>",
   "name" : "std::remove_cv<double>",
   "referenced_type" : "type-1314",
   "self_type" : "type-1314",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<float>",
   "name" : "std::remove_cv<float>",
   "referenced_type" : "type-1315",
   "self_type" : "type-1315",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<short>",
   "name" : "std::remove_cv<short>",
   "referenced_type" : "type-1316",
   "self_type" : "type-1316",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<void>",
   "name" : "std::__libcpp_is_void<void>",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidIvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<nullptr_t>",
   "name" : "std::__is_nullptr_t_impl<nullptr_t>",
   "referenced_type" : "type-1318",
   "self_type" : "type-1318",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-540" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implIDnEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<double>",
   "name" : "std::__libcpp_is_integral<double>",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<float>",
   "name" : "std::__libcpp_is_integral<float>",
   "referenced_type" : "type-1320",
   "self_type" : "type-1320",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<bool>",
   "name" : "std::__libcpp_is_integral<bool>",
   "referenced_type" : "type-1321",
   "self_type" : "type-1321",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-529" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char>",
   "name" : "std::__libcpp_is_integral<char>",
   "referenced_type" : "type-1322",
   "self_type" : "type-1322",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<signed char>",
   "name" : "std::__libcpp_is_integral<signed char>",
   "referenced_type" : "type-1323",
   "self_type" : "type-1323",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIaEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned char>",
   "name" : "std::__libcpp_is_integral<unsigned char>",
   "referenced_type" : "type-1324",
   "self_type" : "type-1324",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<wchar_t>",
   "name" : "std::__libcpp_is_integral<wchar_t>",
   "referenced_type" : "type-1325",
   "self_type" : "type-1325",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-780" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char16_t>",
   "name" : "std::__libcpp_is_integral<char16_t>",
   "referenced_type" : "type-1326",
   "self_type" : "type-1326",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-776" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char32_t>",
   "name" : "std::__libcpp_is_integral<char32_t>",
   "referenced_type" : "type-1327",
   "self_type" : "type-1327",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-778" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<short>",
   "name" : "std::__libcpp_is_integral<short>",
   "referenced_type" : "type-1328",
   "self_type" : "type-1328",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned short>",
   "name" : "std::__libcpp_is_integral<unsigned short>",
   "referenced_type" : "type-1329",
   "self_type" : "type-1329",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<int>",
   "name" : "std::__libcpp_is_integral<int>",
   "referenced_type" : "type-1330",
   "self_type" : "type-1330",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned int>",
   "name" : "std::__libcpp_is_integral<unsigned int>",
   "referenced_type" : "type-1331",
   "self_type" : "type-1331",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<long>",
   "name" : "std::__libcpp_is_integral<long>",
   "referenced_type" : "type-1332",
   "self_type" : "type-1332",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-631" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned long>",
   "name" : "std::__libcpp_is_integral<unsigned long>",
   "referenced_type" : "type-1333",
   "self_type" : "type-1333",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<long long>",
   "name" : "std::__libcpp_is_integral<long long>",
   "referenced_type" : "type-1334",
   "self_type" : "type-1334",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned long long>",
   "name" : "std::__libcpp_is_integral<unsigned long long>",
   "referenced_type" : "type-1335",
   "self_type" : "type-1335",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1330"
    }
   ],
   "linker_set_key" : "std::is_integral<int>",
   "name" : "std::is_integral<int>",
   "referenced_type" : "type-1336",
   "self_type" : "type-1336",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__111is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1319"
    }
   ],
   "linker_set_key" : "std::is_integral<double>",
   "name" : "std::is_integral<double>",
   "referenced_type" : "type-1337",
   "self_type" : "type-1337",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__111is_integralIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1320"
    }
   ],
   "linker_set_key" : "std::is_integral<float>",
   "name" : "std::is_integral<float>",
   "referenced_type" : "type-1338",
   "self_type" : "type-1338",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__111is_integralIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1328"
    }
   ],
   "linker_set_key" : "std::is_integral<short>",
   "name" : "std::is_integral<short>",
   "referenced_type" : "type-1339",
   "self_type" : "type-1339",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__111is_integralIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<__fp16>",
   "name" : "std::__libcpp_is_floating_point<__fp16>",
   "referenced_type" : "type-1340",
   "self_type" : "type-1340",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1341" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<_Float16>",
   "name" : "std::__libcpp_is_floating_point<_Float16>",
   "referenced_type" : "type-1342",
   "self_type" : "type-1342",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1343" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDF16_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<float>",
   "name" : "std::__libcpp_is_floating_point<float>",
   "referenced_type" : "type-1344",
   "self_type" : "type-1344",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<double>",
   "name" : "std::__libcpp_is_floating_point<double>",
   "referenced_type" : "type-1345",
   "self_type" : "type-1345",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<long double>",
   "name" : "std::__libcpp_is_floating_point<long double>",
   "referenced_type" : "type-1346",
   "self_type" : "type-1346",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jclass"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jobject"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jstring"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "type-357",
   "self_type" : "type-357",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jarray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jobjectArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "type-369",
   "self_type" : "type-369",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14_jbooleanArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "type-373",
   "self_type" : "type-373",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jbyteArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "type-377",
   "self_type" : "type-377",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jcharArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "type-381",
   "self_type" : "type-381",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jshortArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "type-385",
   "self_type" : "type-385",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS10_jintArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jlongArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "type-393",
   "self_type" : "type-393",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jfloatArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-357"
    }
   ],
   "linker_set_key" : "_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jdoubleArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jthrowable"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "signature",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "type-485",
   "self_type" : "type-485",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS15JNINativeMethod"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-495"
    }
   ],
   "linker_set_key" : "_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "type-494",
   "self_type" : "type-494",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JavaVM"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 96,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 128,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 160,
     "referenced_type" : "type-498"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 192,
     "referenced_type" : "type-503"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 224,
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "type-497",
   "self_type" : "type-497",
   "size" : 32,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNIInvokeInterface"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JNIEnv"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-527"
    }
   ],
   "linker_set_key" : "std::is_floating_point<int>",
   "name" : "std::is_floating_point<int>",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<int>",
   "name" : "std::__libcpp_is_floating_point<int>",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<bool, false>",
   "name" : "std::integral_constant<bool, false>",
   "referenced_type" : "type-528",
   "self_type" : "type-528",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-529" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIbLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-531"
    }
   ],
   "linker_set_key" : "std::is_floating_point<short>",
   "name" : "std::is_floating_point<short>",
   "referenced_type" : "type-530",
   "self_type" : "type-530",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<short>",
   "name" : "std::__libcpp_is_floating_point<short>",
   "referenced_type" : "type-531",
   "self_type" : "type-531",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::is_same<int, bool>",
   "name" : "std::is_same<int, bool>",
   "referenced_type" : "type-532",
   "self_type" : "type-532",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13", "type-529" ],
   "unique_id" : "_ZTSNSt3__17is_sameIibEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_is_function_imp::__dummy_type",
   "name" : "std::__libcpp_is_function_imp::__dummy_type",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__124__libcpp_is_function_imp12__dummy_typeE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::is_enum<int>",
   "name" : "std::is_enum<int>",
   "referenced_type" : "type-534",
   "self_type" : "type-534",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__17is_enumIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::is_enum<short>",
   "name" : "std::is_enum<short>",
   "referenced_type" : "type-535",
   "self_type" : "type-535",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__17is_enumIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<int>",
   "name" : "std::is_arithmetic<int>",
   "referenced_type" : "type-536",
   "self_type" : "type-536",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<bool, true>",
   "name" : "std::integral_constant<bool, true>",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-529" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIbLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<short>",
   "name" : "std::is_arithmetic<short>",
   "referenced_type" : "type-538",
   "self_type" : "type-538",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::is_scalar<nullptr_t>",
   "name" : "std::is_scalar<nullptr_t>",
   "referenced_type" : "type-539",
   "self_type" : "type-539",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-540" ],
   "unique_id" : "_ZTSNSt3__19is_scalarIDnEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_referenceable_impl",
   "name" : "std::__is_referenceable_impl",
   "referenced_type" : "type-541",
   "self_type" : "type-541",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__is_referenceable_implE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<sk_sp<SkColorSpace> &>",
   "name" : "std::remove_reference<sk_sp<SkColorSpace> &>",
   "referenced_type" : "type-542",
   "self_type" : "type-542",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-543" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIR5sk_spI12SkColorSpaceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "sk_sp<SkColorSpace>",
   "name" : "sk_sp<SkColorSpace>",
   "record_kind" : "class",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 4,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-546" ],
   "unique_id" : "_ZTS5sk_spI12SkColorSpaceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-547"
    }
   ],
   "linker_set_key" : "SkColorSpace",
   "name" : "SkColorSpace",
   "record_kind" : "class",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS12SkColorSpace",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkColorSpace"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkColorSpaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkColorSpaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace15makeLinearGammaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace13makeSRGBGammaEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace13makeColorSpinEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace10onToXYZD50Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace14onToXYZD50HashEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace12onFromXYZD50Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace12onGammaNamedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace18onGammaCloseToSRGBEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace15onGammaIsLinearEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace23onIsNumericalTransferFnEP22SkColorSpaceTransferFn"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace8onIsCMYKEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace13onProfileDataEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-548"
    }
   ],
   "linker_set_key" : "SkRefCnt",
   "name" : "SkRefCnt",
   "record_kind" : "class",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS8SkRefCnt",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkRefCnt"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-553"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "field_offset" : 32,
     "referenced_type" : "type-549"
    }
   ],
   "linker_set_key" : "SkRefCntBase",
   "name" : "SkRefCntBase",
   "record_kind" : "class",
   "referenced_type" : "type-548",
   "self_type" : "type-548",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS12SkRefCntBase",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkRefCntBase"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-550"
    }
   ],
   "linker_set_key" : "std::atomic<int>",
   "name" : "std::atomic<int>",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__16atomicIiEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-551"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, true>",
   "name" : "std::__atomic_base<int, true>",
   "referenced_type" : "type-550",
   "self_type" : "type-550",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-552"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, false>",
   "name" : "std::__atomic_base<int, false>",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "SkNoncopyable",
   "name" : "SkNoncopyable",
   "record_kind" : "class",
   "referenced_type" : "type-553",
   "self_type" : "type-553",
   "size" : 1,
   "source_file" : "/external/skia/include/core/SkTypes.h",
   "unique_id" : "_ZTS13SkNoncopyable"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<int &>",
   "name" : "std::remove_reference<int &>",
   "referenced_type" : "type-554",
   "self_type" : "type-554",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<float &>",
   "name" : "std::remove_reference<float &>",
   "referenced_type" : "type-556",
   "self_type" : "type-556",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-557" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__any",
   "name" : "std::__any",
   "referenced_type" : "type-558",
   "self_type" : "type-558",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__anyE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::is_abstract<SkColorSpace *>",
   "name" : "std::is_abstract<SkColorSpace *>",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-545" ],
   "unique_id" : "_ZTSNSt3__111is_abstractIP12SkColorSpaceEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-537"
    }
   ],
   "linker_set_key" : "std::is_convertible<SkColorSpace *, SkColorSpace *>",
   "name" : "std::is_convertible<SkColorSpace *, SkColorSpace *>",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-545", "type-545" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleIP12SkColorSpaceS2_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-562"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned char>",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "type-561",
   "self_type" : "type-561",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned int, 1>",
   "name" : "std::integral_constant<unsigned int, 1>",
   "referenced_type" : "type-562",
   "self_type" : "type-562",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIjLj1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-564"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned short>",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned int, 2>",
   "name" : "std::integral_constant<unsigned int, 2>",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIjLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned int>",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned int, 4>",
   "name" : "std::integral_constant<unsigned int, 4>",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIjLj4EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long>",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long long>",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned int, 8>",
   "name" : "std::integral_constant<unsigned int, 8>",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIjLj8EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::alignment_of<double>",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "type-572",
   "self_type" : "type-572",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::alignment_of<long double>",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "type-573",
   "self_type" : "type-573",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double>",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "type-574",
   "self_type" : "type-574",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-575" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "std::__struct_double",
   "name" : "std::__struct_double",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 8,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115__struct_doubleE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double4>",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "type-576",
   "self_type" : "type-576",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-577" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_16__struct_double4EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-578"
    }
   ],
   "linker_set_key" : "std::__struct_double4",
   "name" : "std::__struct_double4",
   "referenced_type" : "type-577",
   "self_type" : "type-577",
   "size" : 32,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__116__struct_double4E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::alignment_of<int *>",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "type-579",
   "self_type" : "type-579",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-411" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIPiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat> > > > >",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat> > > > >",
   "referenced_type" : "type-580",
   "self_type" : "type-580",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-25", "type-581" ],
   "unique_id" : "_ZTSNSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat> > > > >",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat> > > > >",
   "referenced_type" : "type-582",
   "self_type" : "type-582",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38", "type-583" ],
   "unique_id" : "_ZTSNSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__nat",
   "name" : "std::__nat",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__natE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned char>",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned short>",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "type-586",
   "self_type" : "type-586",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__112__align_typeItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned int>",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long>",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "type-588",
   "self_type" : "type-588",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSNSt3__112__align_typeImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long long>",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "type-589",
   "self_type" : "type-589",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<double>",
   "name" : "std::__align_type<double>",
   "referenced_type" : "type-590",
   "self_type" : "type-590",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<long double>",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "type-591",
   "self_type" : "type-591",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIeEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double>",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "type-592",
   "self_type" : "type-592",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-575" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double4>",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-577" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_16__struct_double4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<int *>",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "type-594",
   "self_type" : "type-594",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-411" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIPiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 12>",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-596" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 12>",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-598" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 12>",
   "referenced_type" : "type-599",
   "self_type" : "type-599",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-600" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 12>",
   "referenced_type" : "type-601",
   "self_type" : "type-601",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-602" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 12>",
   "referenced_type" : "type-603",
   "self_type" : "type-603",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 12>",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-606" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 12>",
   "referenced_type" : "type-607",
   "self_type" : "type-607",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-608" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 12>",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 12>",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-612" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELj12EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 12>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 12>",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-614" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELj12EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 4, 4>",
   "name" : "std::__select_align<12, 4, 4>",
   "referenced_type" : "type-615",
   "self_type" : "type-615",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj4ELj4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 8, 4>",
   "name" : "std::__select_align<12, 8, 4>",
   "referenced_type" : "type-616",
   "self_type" : "type-616",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj8ELj4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 8, 8>",
   "name" : "std::__select_align<12, 8, 8>",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj8ELj8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 4, 8>",
   "name" : "std::__select_align<12, 4, 8>",
   "referenced_type" : "type-618",
   "self_type" : "type-618",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj4ELj8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 2, 8>",
   "name" : "std::__select_align<12, 2, 8>",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj2ELj8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<12, 1, 8>",
   "name" : "std::__select_align<12, 1, 8>",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILj12ELj1ELj8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::aligned_storage<12, 8>",
   "name" : "std::aligned_storage<12, 8>",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILj12ELj8EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-623"
    }
   ],
   "linker_set_key" : "std::aligned_storage<12, 8>::type",
   "name" : "std::aligned_storage<12, 8>::type",
   "referenced_type" : "type-622",
   "self_type" : "type-622",
   "size" : 16,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILj12ELj8EE4typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__numeric_type<void>",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__114__numeric_typeIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<bool, true>",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-529" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<short, true>",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "type-626",
   "self_type" : "type-626",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned short, true>",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__113__make_signedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<int, true>",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "type-628",
   "self_type" : "type-628",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned int, true>",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long, true>",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "type-630",
   "self_type" : "type-630",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-631" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long, true>",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "type-632",
   "self_type" : "type-632",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSNSt3__113__make_signedImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long long, true>",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "type-633",
   "self_type" : "type-633",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long long, true>",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIyLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<bool, true>",
   "name" : "std::__make_unsigned<bool, true>",
   "referenced_type" : "type-635",
   "self_type" : "type-635",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-529" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<short, true>",
   "name" : "std::__make_unsigned<short, true>",
   "referenced_type" : "type-636",
   "self_type" : "type-636",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned short, true>",
   "name" : "std::__make_unsigned<unsigned short, true>",
   "referenced_type" : "type-637",
   "self_type" : "type-637",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<int, true>",
   "name" : "std::__make_unsigned<int, true>",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned int, true>",
   "name" : "std::__make_unsigned<unsigned int, true>",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long, true>",
   "name" : "std::__make_unsigned<long, true>",
   "referenced_type" : "type-640",
   "self_type" : "type-640",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-631" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long, true>",
   "name" : "std::__make_unsigned<unsigned long, true>",
   "referenced_type" : "type-641",
   "self_type" : "type-641",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long long, true>",
   "name" : "std::__make_unsigned<long long, true>",
   "referenced_type" : "type-642",
   "self_type" : "type-642",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long long, true>",
   "name" : "std::__make_unsigned<unsigned long long, true>",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIyLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "std::is_destructible<void>",
   "name" : "std::is_destructible<void>",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__115is_destructibleIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_construct::__nat",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__is_construct5__natE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_fail_tag",
   "name" : "std::__extract_key_fail_tag",
   "referenced_type" : "type-649",
   "self_type" : "type-649",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_fail_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_self_tag",
   "name" : "std::__extract_key_self_tag",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_self_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_first_tag",
   "name" : "std::__extract_key_first_tag",
   "referenced_type" : "type-651",
   "self_type" : "type-651",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__extract_key_first_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-653"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-655"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-654",
   "self_type" : "type-654",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-656",
   "self_type" : "type-656",
   "size" : 24,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-658"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-657",
   "self_type" : "type-657",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS17pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-660"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-659",
   "self_type" : "type-659",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-660"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-661",
   "self_type" : "type-661",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-663"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-655"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-664",
   "self_type" : "type-664",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS18pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-667",
   "self_type" : "type-667",
   "size" : 40,
   "source_file" : "/bionic/libc/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-684",
   "self_type" : "type-684",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "std::exception",
   "name" : "std::exception",
   "record_kind" : "class",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 4,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt9exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "linker_set_key" : "std::bad_exception",
   "name" : "std::bad_exception",
   "record_kind" : "class",
   "referenced_type" : "type-687",
   "self_type" : "type-687",
   "size" : 4,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt13bad_exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13bad_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13bad_exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "std::exception_ptr",
   "name" : "std::exception_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-689",
   "self_type" : "type-689",
   "size" : 4,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt13exception_ptr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "field_offset" : 32,
     "referenced_type" : "type-689"
    }
   ],
   "linker_set_key" : "std::nested_exception",
   "name" : "std::nested_exception",
   "record_kind" : "class",
   "referenced_type" : "type-694",
   "self_type" : "type-694",
   "size" : 8,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt16nested_exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16nested_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::nothrow_t",
   "name" : "std::nothrow_t",
   "referenced_type" : "type-697",
   "self_type" : "type-697",
   "size" : 1,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt9nothrow_t"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "linker_set_key" : "std::bad_alloc",
   "name" : "std::bad_alloc",
   "record_kind" : "class",
   "referenced_type" : "type-699",
   "self_type" : "type-699",
   "size" : 4,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt9bad_alloc",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9bad_alloc"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9bad_alloc4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-699"
    }
   ],
   "linker_set_key" : "std::bad_array_new_length",
   "name" : "std::bad_array_new_length",
   "record_kind" : "class",
   "referenced_type" : "type-700",
   "self_type" : "type-700",
   "size" : 4,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt20bad_array_new_length",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt20bad_array_new_length"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt20bad_array_new_length4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-699"
    }
   ],
   "linker_set_key" : "std::bad_array_length",
   "name" : "std::bad_array_length",
   "record_kind" : "class",
   "referenced_type" : "type-701",
   "self_type" : "type-701",
   "size" : 4,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt16bad_array_length",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16bad_array_length"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16bad_array_lengthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16bad_array_lengthD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt16bad_array_length4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_indices<>",
   "name" : "std::__tuple_indices<>",
   "referenced_type" : "type-707",
   "self_type" : "type-707",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__115__tuple_indicesIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__integer_sequence<unsigned int>",
   "name" : "std::__integer_sequence<unsigned int>",
   "referenced_type" : "type-708",
   "self_type" : "type-708",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__118__integer_sequenceIjJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_tuple_indices<0, 0>",
   "name" : "std::__make_tuple_indices<0, 0>",
   "referenced_type" : "type-709",
   "self_type" : "type-709",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__make_tuple_indicesILj0ELj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_types<>",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_typesIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, false>",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "type-711",
   "self_type" : "type-711",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, false>",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "type-712",
   "self_type" : "type-712",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, true>",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "type-713",
   "self_type" : "type-713",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, true>",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "type-714",
   "self_type" : "type-714",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, false>",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "type-715",
   "self_type" : "type-715",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, false>",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "type-716",
   "self_type" : "type-716",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, true>",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "type-717",
   "self_type" : "type-717",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, true>",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "type-718",
   "self_type" : "type-718",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_sfinae_base",
   "name" : "std::__tuple_sfinae_base",
   "referenced_type" : "type-719",
   "self_type" : "type-719",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__119__tuple_sfinae_baseE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__check_tuple_constructor_fail",
   "name" : "std::__check_tuple_constructor_fail",
   "referenced_type" : "type-720",
   "self_type" : "type-720",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__130__check_tuple_constructor_failE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_ctor_base<false, false>",
   "name" : "std::__sfinae_ctor_base<false, false>",
   "referenced_type" : "type-721",
   "self_type" : "type-721",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__118__sfinae_ctor_baseILb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_ctor_base<true, false>",
   "name" : "std::__sfinae_ctor_base<true, false>",
   "referenced_type" : "type-727",
   "self_type" : "type-727",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__118__sfinae_ctor_baseILb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_ctor_base<false, true>",
   "name" : "std::__sfinae_ctor_base<false, true>",
   "referenced_type" : "type-733",
   "self_type" : "type-733",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__118__sfinae_ctor_baseILb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<false, false>",
   "name" : "std::__sfinae_assign_base<false, false>",
   "referenced_type" : "type-739",
   "self_type" : "type-739",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<true, false>",
   "name" : "std::__sfinae_assign_base<true, false>",
   "referenced_type" : "type-744",
   "self_type" : "type-744",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<false, true>",
   "name" : "std::__sfinae_assign_base<false, true>",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb0ELb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__file_",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "__line_",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "__pred_",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "__msg_",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "std::__libcpp_debug_info",
   "name" : "std::__libcpp_debug_info",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__debug",
   "unique_id" : "_ZTSNSt3__119__libcpp_debug_infoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "b",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "c",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "s",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "i",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "j",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "f",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "l",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS6jvalue"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::piecewise_construct_t",
   "name" : "std::piecewise_construct_t",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__121piecewise_construct_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<0>",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "type-764",
   "self_type" : "type-764",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<1>",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILj1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::in_place_t",
   "name" : "std::in_place_t",
   "referenced_type" : "type-766",
   "self_type" : "type-766",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110in_place_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<std::_PairT, unsigned int>",
   "name" : "std::unary_function<std::_PairT, unsigned int>",
   "referenced_type" : "type-769",
   "self_type" : "type-769",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-770", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionINS_6_PairTEjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "second",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "std::_PairT",
   "name" : "std::_PairT",
   "referenced_type" : "type-770",
   "self_type" : "type-770",
   "size" : 8,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__16_PairTE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<bool, unsigned int>",
   "name" : "std::unary_function<bool, unsigned int>",
   "referenced_type" : "type-771",
   "self_type" : "type-771",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-529", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIbjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char, unsigned int>",
   "name" : "std::unary_function<char, unsigned int>",
   "referenced_type" : "type-772",
   "self_type" : "type-772",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-21", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIcjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<signed char, unsigned int>",
   "name" : "std::unary_function<signed char, unsigned int>",
   "referenced_type" : "type-773",
   "self_type" : "type-773",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-25", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIajEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned char, unsigned int>",
   "name" : "std::unary_function<unsigned char, unsigned int>",
   "referenced_type" : "type-774",
   "self_type" : "type-774",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIhjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char16_t, unsigned int>",
   "name" : "std::unary_function<char16_t, unsigned int>",
   "referenced_type" : "type-775",
   "self_type" : "type-775",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-776", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDsjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char32_t, unsigned int>",
   "name" : "std::unary_function<char32_t, unsigned int>",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-778", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDijEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<wchar_t, unsigned int>",
   "name" : "std::unary_function<wchar_t, unsigned int>",
   "referenced_type" : "type-779",
   "self_type" : "type-779",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-780", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIwjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<short, unsigned int>",
   "name" : "std::unary_function<short, unsigned int>",
   "referenced_type" : "type-781",
   "self_type" : "type-781",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-78", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIsjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned short, unsigned int>",
   "name" : "std::unary_function<unsigned short, unsigned int>",
   "referenced_type" : "type-782",
   "self_type" : "type-782",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-77", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionItjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<int, unsigned int>",
   "name" : "std::unary_function<int, unsigned int>",
   "referenced_type" : "type-783",
   "self_type" : "type-783",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-13", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIijEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned int, unsigned int>",
   "name" : "std::unary_function<unsigned int, unsigned int>",
   "referenced_type" : "type-784",
   "self_type" : "type-784",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-525", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long, unsigned int>",
   "name" : "std::unary_function<long, unsigned int>",
   "referenced_type" : "type-785",
   "self_type" : "type-785",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-631", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIljEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long, unsigned int>",
   "name" : "std::unary_function<unsigned long, unsigned int>",
   "referenced_type" : "type-786",
   "self_type" : "type-786",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-568", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionImjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long long, unsigned int>",
   "name" : "std::unary_function<long long, unsigned int>",
   "referenced_type" : "type-787",
   "self_type" : "type-787",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIxjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long long, unsigned int>",
   "name" : "std::unary_function<unsigned long long, unsigned int>",
   "referenced_type" : "type-788",
   "self_type" : "type-788",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-571", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIyjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<float, unsigned int>",
   "name" : "std::unary_function<float, unsigned int>",
   "referenced_type" : "type-789",
   "self_type" : "type-789",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIfjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<double, unsigned int>",
   "name" : "std::unary_function<double, unsigned int>",
   "referenced_type" : "type-790",
   "self_type" : "type-790",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIdjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long double, unsigned int>",
   "name" : "std::unary_function<long double, unsigned int>",
   "referenced_type" : "type-791",
   "self_type" : "type-791",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIejEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<nullptr_t, unsigned int>",
   "name" : "std::unary_function<nullptr_t, unsigned int>",
   "referenced_type" : "type-792",
   "self_type" : "type-792",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-540", "type-525" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDnjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__murmur2_or_cityhash<unsigned int, 32>",
   "name" : "std::__murmur2_or_cityhash<unsigned int, 32>",
   "referenced_type" : "type-793",
   "self_type" : "type-793",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__121__murmur2_or_cityhashIjLj32EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-769"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<std::_PairT, 2>",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "type-795",
   "self_type" : "type-795",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-770" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashINS_6_PairTELj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-787"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long long, 2>",
   "name" : "std::__scalar_hash<long long, 2>",
   "referenced_type" : "type-798",
   "self_type" : "type-798",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIxLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-788"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<unsigned long long, 2>",
   "name" : "std::__scalar_hash<unsigned long long, 2>",
   "referenced_type" : "type-799",
   "self_type" : "type-799",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIyLj2EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 160,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 192,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 224,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 256,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 288,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 320,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 352,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 384,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 416,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 448,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 480,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 512,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 544,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 576,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 608,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 640,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 672,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 704,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 736,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 768,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 800,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 832,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 864,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 896,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 928,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 960,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 992,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 1024,
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 1056,
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 1088,
     "referenced_type" : "type-87"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 1120,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 1152,
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 1184,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 1216,
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 1248,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 1280,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 1312,
     "referenced_type" : "type-101"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 1344,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 1376,
     "referenced_type" : "type-105"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 1408,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 1440,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 1472,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 1504,
     "referenced_type" : "type-113"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 1536,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 1568,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 1600,
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 1632,
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 1664,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 1696,
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 1728,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 1760,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 1792,
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 1824,
     "referenced_type" : "type-133"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 1856,
     "referenced_type" : "type-135"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 1888,
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 1920,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 1952,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 1984,
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 2016,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 2048,
     "referenced_type" : "type-147"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 2080,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 2112,
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 2144,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 2176,
     "referenced_type" : "type-155"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 2208,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 2240,
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 2272,
     "referenced_type" : "type-161"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 2304,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 2336,
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 2368,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 2400,
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 2432,
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 2464,
     "referenced_type" : "type-173"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 2496,
     "referenced_type" : "type-175"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 2528,
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 2560,
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 2592,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 2624,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 2656,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 2688,
     "referenced_type" : "type-187"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 2720,
     "referenced_type" : "type-189"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 2752,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 2784,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 2816,
     "referenced_type" : "type-195"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 2848,
     "referenced_type" : "type-197"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 2880,
     "referenced_type" : "type-199"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 2912,
     "referenced_type" : "type-201"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 2944,
     "referenced_type" : "type-203"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 2976,
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 3008,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 3040,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 3072,
     "referenced_type" : "type-211"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 3104,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 3136,
     "referenced_type" : "type-215"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 3168,
     "referenced_type" : "type-217"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 3200,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 3232,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 3264,
     "referenced_type" : "type-223"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 3296,
     "referenced_type" : "type-225"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 3328,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 3360,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 3392,
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 3424,
     "referenced_type" : "type-233"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 3456,
     "referenced_type" : "type-235"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 3488,
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 3520,
     "referenced_type" : "type-239"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 3552,
     "referenced_type" : "type-241"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 3584,
     "referenced_type" : "type-243"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 3616,
     "referenced_type" : "type-85"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 3648,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 3680,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 3712,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 3744,
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 3776,
     "referenced_type" : "type-247"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 3808,
     "referenced_type" : "type-249"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 3840,
     "referenced_type" : "type-251"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 3872,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 3904,
     "referenced_type" : "type-255"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 3936,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 3968,
     "referenced_type" : "type-259"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 4000,
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 4032,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 4064,
     "referenced_type" : "type-265"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 4096,
     "referenced_type" : "type-267"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 4128,
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 4160,
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 4192,
     "referenced_type" : "type-273"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 4224,
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 4256,
     "referenced_type" : "type-277"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 4288,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 4320,
     "referenced_type" : "type-281"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 4352,
     "referenced_type" : "type-283"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 4384,
     "referenced_type" : "type-285"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 4416,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 4448,
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 4480,
     "referenced_type" : "type-291"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 4512,
     "referenced_type" : "type-293"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 4544,
     "referenced_type" : "type-295"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 4576,
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 4608,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 4640,
     "referenced_type" : "type-299"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 4672,
     "referenced_type" : "type-301"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 4704,
     "referenced_type" : "type-303"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 4736,
     "referenced_type" : "type-305"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 4768,
     "referenced_type" : "type-307"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 4800,
     "referenced_type" : "type-309"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 4832,
     "referenced_type" : "type-311"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 4864,
     "referenced_type" : "type-313"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 4896,
     "referenced_type" : "type-315"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 4928,
     "referenced_type" : "type-317"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 4960,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 4992,
     "referenced_type" : "type-321"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 5024,
     "referenced_type" : "type-323"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 5056,
     "referenced_type" : "type-325"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 5088,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 5120,
     "referenced_type" : "type-329"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 5152,
     "referenced_type" : "type-331"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 5184,
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 5216,
     "referenced_type" : "type-335"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 5248,
     "referenced_type" : "type-341"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 5280,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 5312,
     "referenced_type" : "type-346"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 5344,
     "referenced_type" : "type-348"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 5376,
     "referenced_type" : "type-341"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 5408,
     "referenced_type" : "type-350"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 5440,
     "referenced_type" : "type-352"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 5472,
     "referenced_type" : "type-354"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 5504,
     "referenced_type" : "type-358"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 5536,
     "referenced_type" : "type-362"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 5568,
     "referenced_type" : "type-364"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 5600,
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 5632,
     "referenced_type" : "type-370"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 5664,
     "referenced_type" : "type-374"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 5696,
     "referenced_type" : "type-378"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 5728,
     "referenced_type" : "type-382"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 5760,
     "referenced_type" : "type-386"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 5792,
     "referenced_type" : "type-390"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 5824,
     "referenced_type" : "type-394"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 5856,
     "referenced_type" : "type-398"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 5888,
     "referenced_type" : "type-400"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 5920,
     "referenced_type" : "type-403"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 5952,
     "referenced_type" : "type-406"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 5984,
     "referenced_type" : "type-409"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 6016,
     "referenced_type" : "type-412"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 6048,
     "referenced_type" : "type-415"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 6080,
     "referenced_type" : "type-418"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 6112,
     "referenced_type" : "type-421"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 6144,
     "referenced_type" : "type-423"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 6176,
     "referenced_type" : "type-425"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 6208,
     "referenced_type" : "type-427"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 6240,
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 6272,
     "referenced_type" : "type-431"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 6304,
     "referenced_type" : "type-433"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 6336,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 6368,
     "referenced_type" : "type-437"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 6400,
     "referenced_type" : "type-439"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 6432,
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 6464,
     "referenced_type" : "type-443"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 6496,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 6528,
     "referenced_type" : "type-447"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 6560,
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 6592,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 6624,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 6656,
     "referenced_type" : "type-457"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 6688,
     "referenced_type" : "type-459"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 6720,
     "referenced_type" : "type-461"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 6752,
     "referenced_type" : "type-465"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 6784,
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 6816,
     "referenced_type" : "type-473"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 6848,
     "referenced_type" : "type-477"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 6880,
     "referenced_type" : "type-481"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 6912,
     "referenced_type" : "type-486"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 6944,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 6976,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 7008,
     "referenced_type" : "type-490"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 7040,
     "referenced_type" : "type-506"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 7072,
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 7104,
     "referenced_type" : "type-510"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 7136,
     "referenced_type" : "type-512"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 7168,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 7200,
     "referenced_type" : "type-346"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 7232,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 7264,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 7296,
     "referenced_type" : "type-514"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 7328,
     "referenced_type" : "type-516"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 7360,
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 7392,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 7424,
     "referenced_type" : "type-522"
    }
   ],
   "linker_set_key" : "JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 932,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNINativeInterface"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-789"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<float, 1>",
   "name" : "std::__scalar_hash<float, 1>",
   "referenced_type" : "type-800",
   "self_type" : "type-800",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIfLj1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-790"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<double, 2>",
   "name" : "std::__scalar_hash<double, 2>",
   "referenced_type" : "type-803",
   "self_type" : "type-803",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIdLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-791"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long double, 2>",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "type-806",
   "self_type" : "type-806",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIeLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-771"
    }
   ],
   "linker_set_key" : "std::hash<bool>",
   "name" : "std::hash<bool>",
   "referenced_type" : "type-807",
   "self_type" : "type-807",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-529" ],
   "unique_id" : "_ZTSNSt3__14hashIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-772"
    }
   ],
   "linker_set_key" : "std::hash<char>",
   "name" : "std::hash<char>",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSNSt3__14hashIcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-773"
    }
   ],
   "linker_set_key" : "std::hash<signed char>",
   "name" : "std::hash<signed char>",
   "referenced_type" : "type-813",
   "self_type" : "type-813",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSNSt3__14hashIaEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-774"
    }
   ],
   "linker_set_key" : "std::hash<unsigned char>",
   "name" : "std::hash<unsigned char>",
   "referenced_type" : "type-816",
   "self_type" : "type-816",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__14hashIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-775"
    }
   ],
   "linker_set_key" : "std::hash<char16_t>",
   "name" : "std::hash<char16_t>",
   "referenced_type" : "type-819",
   "self_type" : "type-819",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-776" ],
   "unique_id" : "_ZTSNSt3__14hashIDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-777"
    }
   ],
   "linker_set_key" : "std::hash<char32_t>",
   "name" : "std::hash<char32_t>",
   "referenced_type" : "type-822",
   "self_type" : "type-822",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-778" ],
   "unique_id" : "_ZTSNSt3__14hashIDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-779"
    }
   ],
   "linker_set_key" : "std::hash<wchar_t>",
   "name" : "std::hash<wchar_t>",
   "referenced_type" : "type-825",
   "self_type" : "type-825",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-780" ],
   "unique_id" : "_ZTSNSt3__14hashIwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-781"
    }
   ],
   "linker_set_key" : "std::hash<short>",
   "name" : "std::hash<short>",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__14hashIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-782"
    }
   ],
   "linker_set_key" : "std::hash<unsigned short>",
   "name" : "std::hash<unsigned short>",
   "referenced_type" : "type-831",
   "self_type" : "type-831",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__14hashItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-783"
    }
   ],
   "linker_set_key" : "std::hash<int>",
   "name" : "std::hash<int>",
   "referenced_type" : "type-834",
   "self_type" : "type-834",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__14hashIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-784"
    }
   ],
   "linker_set_key" : "std::hash<unsigned int>",
   "name" : "std::hash<unsigned int>",
   "referenced_type" : "type-837",
   "self_type" : "type-837",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-525" ],
   "unique_id" : "_ZTSNSt3__14hashIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-785"
    }
   ],
   "linker_set_key" : "std::hash<long>",
   "name" : "std::hash<long>",
   "referenced_type" : "type-840",
   "self_type" : "type-840",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-631" ],
   "unique_id" : "_ZTSNSt3__14hashIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-786"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long>",
   "name" : "std::hash<unsigned long>",
   "referenced_type" : "type-843",
   "self_type" : "type-843",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-568" ],
   "unique_id" : "_ZTSNSt3__14hashImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-798"
    }
   ],
   "linker_set_key" : "std::hash<long long>",
   "name" : "std::hash<long long>",
   "referenced_type" : "type-846",
   "self_type" : "type-846",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__14hashIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-799"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long long>",
   "name" : "std::hash<unsigned long long>",
   "referenced_type" : "type-847",
   "self_type" : "type-847",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-571" ],
   "unique_id" : "_ZTSNSt3__14hashIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-800"
    }
   ],
   "linker_set_key" : "std::hash<float>",
   "name" : "std::hash<float>",
   "referenced_type" : "type-848",
   "self_type" : "type-848",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__14hashIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-803"
    }
   ],
   "linker_set_key" : "std::hash<double>",
   "name" : "std::hash<double>",
   "referenced_type" : "type-851",
   "self_type" : "type-851",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__14hashIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-806"
    }
   ],
   "linker_set_key" : "std::hash<long double>",
   "name" : "std::hash<long double>",
   "referenced_type" : "type-854",
   "self_type" : "type-854",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__14hashIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-792"
    }
   ],
   "linker_set_key" : "std::hash<nullptr_t>",
   "name" : "std::hash<nullptr_t>",
   "referenced_type" : "type-857",
   "self_type" : "type-857",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-540" ],
   "unique_id" : "_ZTSNSt3__14hashIDnEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-860",
   "self_type" : "type-860",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-861",
   "self_type" : "type-861",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-862",
   "self_type" : "type-862",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-860"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-860"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-863",
   "self_type" : "type-863",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-861"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-861"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-864",
   "self_type" : "type-864",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-865"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-865"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-866",
   "self_type" : "type-866",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic1",
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "extended_size",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "xfeatures",
     "field_offset" : 64,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "xstate_size",
     "field_offset" : 128,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "padding",
     "field_offset" : 160,
     "referenced_type" : "type-869"
    }
   ],
   "linker_set_key" : "_fpx_sw_bytes",
   "name" : "_fpx_sw_bytes",
   "referenced_type" : "type-868",
   "self_type" : "type-868",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13_fpx_sw_bytes"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-871"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "_fpreg",
   "name" : "_fpreg",
   "referenced_type" : "type-870",
   "self_type" : "type-870",
   "size" : 10,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS6_fpreg"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-871"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "padding",
     "field_offset" : 80,
     "referenced_type" : "type-873"
    }
   ],
   "linker_set_key" : "_fpxreg",
   "name" : "_fpxreg",
   "referenced_type" : "type-872",
   "self_type" : "type-872",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_fpxreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-875"
    }
   ],
   "linker_set_key" : "_xmmreg",
   "name" : "_xmmreg",
   "referenced_type" : "type-874",
   "self_type" : "type-874",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xmmreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-877"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "magic",
     "field_offset" : 880,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "_fxsr_env",
     "field_offset" : 896,
     "referenced_type" : "type-878"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 1088,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1120,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "_fxsr_st",
     "field_offset" : 1152,
     "referenced_type" : "type-879"
    },
    {
     "field_name" : "_xmm",
     "field_offset" : 2176,
     "referenced_type" : "type-880"
    },
    {
     "field_offset" : 3200,
     "referenced_type" : "type-881"
    },
    {
     "field_offset" : 4608,
     "referenced_type" : "type-883"
    }
   ],
   "linker_set_key" : "_fpstate_32",
   "name" : "_fpstate_32",
   "referenced_type" : "type-876",
   "self_type" : "type-876",
   "size" : 624,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding1",
     "referenced_type" : "type-882"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "type-882"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "record_kind" : "union",
   "referenced_type" : "type-881",
   "self_type" : "type-881",
   "size" : 176,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding2",
     "referenced_type" : "type-884"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-868"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "record_kind" : "union",
   "referenced_type" : "type-883",
   "self_type" : "type-883",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "twd",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "mxcsr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-886"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-887"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 3328,
     "referenced_type" : "type-884"
    },
    {
     "field_offset" : 3712,
     "referenced_type" : "type-888"
    }
   ],
   "linker_set_key" : "_fpstate_64",
   "name" : "_fpstate_64",
   "referenced_type" : "type-885",
   "self_type" : "type-885",
   "size" : 512,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved3",
     "referenced_type" : "type-884"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-868"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "name" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "record_kind" : "union",
   "referenced_type" : "type-888",
   "self_type" : "type-888",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "xfeatures",
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-890"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 192,
     "referenced_type" : "type-891"
    }
   ],
   "linker_set_key" : "_header",
   "name" : "_header",
   "referenced_type" : "type-889",
   "self_type" : "type-889",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ymmh_space",
     "referenced_type" : "type-887"
    }
   ],
   "linker_set_key" : "_ymmh_state",
   "name" : "_ymmh_state",
   "referenced_type" : "type-892",
   "self_type" : "type-892",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_ymmh_state"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpstate",
     "referenced_type" : "type-876"
    },
    {
     "field_name" : "xstate_hdr",
     "field_offset" : 4992,
     "referenced_type" : "type-889"
    },
    {
     "field_name" : "ymmh",
     "field_offset" : 5504,
     "referenced_type" : "type-892"
    }
   ],
   "linker_set_key" : "_xstate",
   "name" : "_xstate",
   "referenced_type" : "type-893",
   "self_type" : "type-893",
   "size" : 944,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__gsh",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__fsh",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__esh",
     "field_offset" : 80,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__dsh",
     "field_offset" : 112,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "di",
     "field_offset" : 128,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "si",
     "field_offset" : 160,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "bp",
     "field_offset" : 192,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "sp",
     "field_offset" : 224,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "bx",
     "field_offset" : 256,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "dx",
     "field_offset" : 288,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "cx",
     "field_offset" : 320,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ax",
     "field_offset" : 352,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ip",
     "field_offset" : 448,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__csh",
     "field_offset" : 496,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "flags",
     "field_offset" : 512,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "sp_at_signal",
     "field_offset" : 544,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ss",
     "field_offset" : 576,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__ssh",
     "field_offset" : 592,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 608,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "sigcontext_32",
   "name" : "sigcontext_32",
   "referenced_type" : "type-894",
   "self_type" : "type-894",
   "size" : 88,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13sigcontext_32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "di",
     "field_offset" : 512,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "si",
     "field_offset" : 576,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "bp",
     "field_offset" : 640,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "bx",
     "field_offset" : 704,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "dx",
     "field_offset" : 768,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "ax",
     "field_offset" : 832,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "cx",
     "field_offset" : 896,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "sp",
     "field_offset" : 960,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "ip",
     "field_offset" : 1024,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1088,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1152,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1168,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1184,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "ss",
     "field_offset" : 1200,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 1472,
     "referenced_type" : "type-571"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-896"
    }
   ],
   "linker_set_key" : "sigcontext_64",
   "name" : "sigcontext_64",
   "referenced_type" : "type-895",
   "self_type" : "type-895",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13sigcontext_64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__gsh",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__fsh",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__esh",
     "field_offset" : 80,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__dsh",
     "field_offset" : 112,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "edi",
     "field_offset" : 128,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "esi",
     "field_offset" : 160,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ebp",
     "field_offset" : 192,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "esp",
     "field_offset" : 224,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ebx",
     "field_offset" : 256,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "edx",
     "field_offset" : 288,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ecx",
     "field_offset" : 320,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "eax",
     "field_offset" : 352,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "eip",
     "field_offset" : 448,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__csh",
     "field_offset" : 496,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 512,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "esp_at_signal",
     "field_offset" : 544,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "ss",
     "field_offset" : 576,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__ssh",
     "field_offset" : 592,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 608,
     "referenced_type" : "type-898"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-897",
   "self_type" : "type-897",
   "size" : 88,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-900"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-899",
   "self_type" : "type-899",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-901"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-903"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3) at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3) at bionic/libc/kernel/uapi/asm-x86/asm/signal.h:81:3",
   "record_kind" : "union",
   "referenced_type" : "type-900",
   "self_type" : "type-900",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "type-907"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-906",
   "self_type" : "type-906",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-908"
    },
    {
     "field_name" : "_kill",
     "referenced_type" : "type-909"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-910"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-912"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-913"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-914"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-919"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-920"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "record_kind" : "union",
   "referenced_type" : "type-907",
   "self_type" : "type-907",
   "size" : 116,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "referenced_type" : "type-909",
   "self_type" : "type-909",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-911"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "referenced_type" : "type-910",
   "self_type" : "type-910",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-911",
   "self_type" : "type-911",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-911"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "referenced_type" : "type-912",
   "self_type" : "type-912",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-631"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "referenced_type" : "type-913",
   "self_type" : "type-913",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-915"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "referenced_type" : "type-914",
   "self_type" : "type-914",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-916"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-918"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "record_kind" : "union",
   "referenced_type" : "type-915",
   "self_type" : "type-915",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-917"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "referenced_type" : "type-916",
   "self_type" : "type-916",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-917"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "referenced_type" : "type-918",
   "self_type" : "type-918",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "referenced_type" : "type-919",
   "self_type" : "type-919",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-525"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "referenced_type" : "type-920",
   "self_type" : "type-920",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-911"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "type-924"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-923",
   "self_type" : "type-923",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-925"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-926"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "record_kind" : "union",
   "referenced_type" : "type-924",
   "self_type" : "type-924",
   "size" : 52,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-927"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "referenced_type" : "type-926",
   "self_type" : "type-926",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-930"
    }
   ],
   "linker_set_key" : "sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "type-929",
   "self_type" : "type-929",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS10sigset64_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-932"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-931",
   "self_type" : "type-931",
   "size" : 16,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-901"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-903"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:105:3) at bionic/libc/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:105:3) at bionic/libc/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-932",
   "self_type" : "type-932",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-934"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-921"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-929"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-933",
   "self_type" : "type-933",
   "size" : 20,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-901"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-903"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:116:3) at bionic/libc/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:116:3) at bionic/libc/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-934",
   "self_type" : "type-934",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "swd",
     "field_offset" : 32,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "twd",
     "field_offset" : 64,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "fip",
     "field_offset" : 96,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "fcs",
     "field_offset" : 128,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "foo",
     "field_offset" : 160,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "fos",
     "field_offset" : 192,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 224,
     "referenced_type" : "type-936"
    }
   ],
   "linker_set_key" : "user_fpregs_struct",
   "name" : "user_fpregs_struct",
   "referenced_type" : "type-935",
   "self_type" : "type-935",
   "size" : 108,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_fpregs_struct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "twd",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "fip",
     "field_offset" : 64,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "fcs",
     "field_offset" : 96,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "foo",
     "field_offset" : 128,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "fos",
     "field_offset" : 160,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 224,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-938"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-938"
    },
    {
     "field_name" : "padding",
     "field_offset" : 2304,
     "referenced_type" : "type-939"
    }
   ],
   "linker_set_key" : "user_fpxregs_struct",
   "name" : "user_fpxregs_struct",
   "referenced_type" : "type-937",
   "self_type" : "type-937",
   "size" : 512,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_fpxregs_struct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ebx",
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "ecx",
     "field_offset" : 32,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "edx",
     "field_offset" : 64,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "esi",
     "field_offset" : 96,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "edi",
     "field_offset" : 128,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "ebp",
     "field_offset" : 160,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "eax",
     "field_offset" : 192,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "xds",
     "field_offset" : 224,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "xes",
     "field_offset" : 256,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "xfs",
     "field_offset" : 288,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "xgs",
     "field_offset" : 320,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "orig_eax",
     "field_offset" : 352,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "eip",
     "field_offset" : 384,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "xcs",
     "field_offset" : 416,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 448,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "esp",
     "field_offset" : 480,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "xss",
     "field_offset" : 512,
     "referenced_type" : "type-631"
    }
   ],
   "linker_set_key" : "user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "type-940",
   "self_type" : "type-940",
   "size" : 68,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_regs_struct"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-940"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 544,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "i387",
     "field_offset" : 576,
     "referenced_type" : "type-935"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 1440,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 1472,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 1504,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 1536,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 1568,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "signal",
     "field_offset" : 1600,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1632,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 1664,
     "referenced_type" : "type-942"
    },
    {
     "field_name" : "u_fpstate",
     "field_offset" : 1696,
     "referenced_type" : "type-943"
    },
    {
     "field_name" : "magic",
     "field_offset" : 1728,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 1760,
     "referenced_type" : "type-944"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 2016,
     "referenced_type" : "type-658"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-941",
   "self_type" : "type-941",
   "size" : 284,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-871"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "_libc_fpreg",
   "name" : "_libc_fpreg",
   "referenced_type" : "type-945",
   "self_type" : "type-945",
   "size" : 10,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "_libc_fpreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-947"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-568"
    }
   ],
   "linker_set_key" : "_libc_fpstate",
   "name" : "_libc_fpstate",
   "referenced_type" : "type-946",
   "self_type" : "type-946",
   "size" : 112,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "_libc_fpstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gregs",
     "referenced_type" : "type-949"
    },
    {
     "field_name" : "fpregs",
     "field_offset" : 608,
     "referenced_type" : "type-950"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-568"
    }
   ],
   "linker_set_key" : "mcontext_t",
   "name" : "mcontext_t",
   "referenced_type" : "type-948",
   "self_type" : "type-948",
   "size" : 88,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "mcontext_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-952"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-953"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-948"
    },
    {
     "field_offset" : 864,
     "referenced_type" : "type-954"
    },
    {
     "field_name" : "__fpregs_mem",
     "field_offset" : 928,
     "referenced_type" : "type-946"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-951",
   "self_type" : "type-951",
   "size" : 228,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-953",
   "self_type" : "type-953",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-955"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-929"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:205:3) at bionic/libc/include/sys/ucontext.h:205:3",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:205:3) at bionic/libc/include/sys/ucontext.h:205:3",
   "record_kind" : "union",
   "referenced_type" : "type-954",
   "self_type" : "type-954",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:205:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-568"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "type-525"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:205:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:206:5) at bionic/libc/include/sys/ucontext.h:206:5",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:205:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:206:5) at bionic/libc/include/sys/ucontext.h:206:5",
   "referenced_type" : "type-955",
   "self_type" : "type-955",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:205:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:206:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-653"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-958",
   "self_type" : "type-958",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "type-631"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-960",
   "self_type" : "type-960",
   "size" : 44,
   "source_file" : "/bionic/libc/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-962"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-961",
   "self_type" : "type-961",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__type_name",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "std::type_info",
   "name" : "std::type_info",
   "record_kind" : "class",
   "referenced_type" : "type-966",
   "self_type" : "type-966",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt9type_info",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9type_info"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "linker_set_key" : "std::bad_cast",
   "name" : "std::bad_cast",
   "record_kind" : "class",
   "referenced_type" : "type-971",
   "self_type" : "type-971",
   "size" : 4,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt8bad_cast",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt8bad_cast"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt8bad_cast4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-686"
    }
   ],
   "linker_set_key" : "std::bad_typeid",
   "name" : "std::bad_typeid",
   "record_kind" : "class",
   "referenced_type" : "type-972",
   "self_type" : "type-972",
   "size" : 4,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt10bad_typeid",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt10bad_typeid"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt10bad_typeid4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less<void>",
   "name" : "std::less<void>",
   "referenced_type" : "type-973",
   "self_type" : "type-973",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__14lessIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__invoke_void_return_wrapper<void>",
   "name" : "std::__invoke_void_return_wrapper<void>",
   "referenced_type" : "type-974",
   "self_type" : "type-974",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__128__invoke_void_return_wrapperIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator_arg_t",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "type-975",
   "self_type" : "type-975",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "unique_id" : "_ZTSNSt3__115allocator_arg_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::input_iterator_tag",
   "name" : "std::input_iterator_tag",
   "referenced_type" : "type-977",
   "self_type" : "type-977",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__118input_iterator_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::output_iterator_tag",
   "name" : "std::output_iterator_tag",
   "referenced_type" : "type-978",
   "self_type" : "type-978",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
