{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "PsshEntry [0]",
   "name" : "PsshEntry [0]",
   "referenced_type" : "type-198",
   "self_type" : "type-201",
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [16]",
   "name" : "unsigned char [16]",
   "referenced_type" : "type-39",
   "self_type" : "type-199",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-56",
   "self_type" : "type-56",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "double",
   "name" : "double",
   "referenced_type" : "type-16",
   "self_type" : "type-16",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float",
   "name" : "float",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,

   "name" : "void (*)(AMediaCodec *, void *, media_status_t, int, const char *)",
   "referenced_type" : "type-82",
   "self_type" : "type-99",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaCodec *",
   "name" : "AMediaCodec *",
   "referenced_type" : "type-84",
   "self_type" : "type-83",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaFormat *",
   "name" : "AMediaFormat *",
   "referenced_type" : "type-86",
   "self_type" : "type-85",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaCrypto *",
   "name" : "AMediaCrypto *",
   "referenced_type" : "type-88",
   "self_type" : "type-87",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCrypto.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaDataSource *",
   "name" : "AMediaDataSource *",
   "referenced_type" : "type-90",
   "self_type" : "type-89",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDataSource.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaCodec *",
   "name" : "AMediaCodec *",
   "referenced_type" : "type-92",
   "self_type" : "type-91",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaFormat *",
   "name" : "AMediaFormat *",
   "referenced_type" : "type-94",
   "self_type" : "type-93",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaExtractor *",
   "name" : "AMediaExtractor *",
   "referenced_type" : "type-96",
   "self_type" : "type-95",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "AMediaDataSource *",
   "name" : "AMediaDataSource *",
   "referenced_type" : "type-98",
   "self_type" : "type-97",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "const AMediaFormat",
   "name" : "const AMediaFormat",
   "referenced_type" : "type-103",
   "self_type" : "type-102",
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const AMediaFormat",
   "name" : "const AMediaFormat",
   "referenced_type" : "type-113",
   "self_type" : "type-112",
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaMuxer.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-11",
   "self_type" : "type-173",
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCrypto.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AImage",
   "name" : "const AImage",
   "referenced_type" : "type-122",
   "self_type" : "type-121",
   "size" : 56,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImage.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AImageReader",
   "name" : "const AImageReader",
   "referenced_type" : "type-148",
   "self_type" : "type-147",
   "size" : 104,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImageReader.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-15",
   "self_type" : "type-14",
   "size" : 1,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const AMediaFormat",
   "name" : "const AMediaFormat",
   "referenced_type" : "type-29",
   "self_type" : "type-28",
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaMuxer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AMediaDrmKeyValuePair",
   "name" : "const AMediaDrmKeyValuePair",
   "referenced_type" : "type-33",
   "self_type" : "type-62",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AMediaDrmKeyStatus",
   "name" : "const AMediaDrmKeyStatus",
   "referenced_type" : "type-35",
   "self_type" : "type-55",
   "size" : 12,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AMediaDrmByteArray",
   "name" : "const AMediaDrmByteArray",
   "referenced_type" : "type-36",
   "self_type" : "type-48",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-39",
   "self_type" : "type-38",
   "size" : 1,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCrypto.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const AMediaCodecBufferInfo",
   "name" : "const AMediaCodecBufferInfo",
   "referenced_type" : "type-4",
   "self_type" : "type-31",
   "size" : 20,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaMuxer.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const AMediaFormat",
   "name" : "const AMediaFormat",
   "referenced_type" : "type-72",
   "self_type" : "type-71",
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "AImageCropRect",
   "name" : "AImageCropRect",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImage.h",
   "unique_id" : "AImageCropRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "onImageAvailable",
     "field_offset" : 32,
     "referenced_type" : "type-133"
    }
   ],
   "linker_set_key" : "AImageReader_ImageListener",
   "name" : "AImageReader_ImageListener",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImageReader.h",
   "unique_id" : "AImageReader_ImageListener"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "onBufferRemoved",
     "field_offset" : 32,
     "referenced_type" : "type-139"
    }
   ],
   "linker_set_key" : "AImageReader_BufferRemovedListener",
   "name" : "AImageReader_BufferRemovedListener",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImageReader.h",
   "unique_id" : "AImageReader_BufferRemovedListener"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encryptBlocks",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "skipBlocks",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "cryptoinfo_pattern_t",
   "name" : "cryptoinfo_pattern_t",
   "referenced_type" : "type-169",
   "self_type" : "type-169",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h",
   "unique_id" : "cryptoinfo_pattern_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "onAsyncInputAvailable",
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "onAsyncOutputAvailable",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "onAsyncFormatChanged",
     "field_offset" : 64,
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "onAsyncError",
     "field_offset" : 96,
     "referenced_type" : "type-99"
    }
   ],
   "linker_set_key" : "AMediaCodecOnAsyncNotifyCallback",
   "name" : "AMediaCodecOnAsyncNotifyCallback",
   "referenced_type" : "type-171",
   "self_type" : "type-171",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h",
   "unique_id" : "AMediaCodecOnAsyncNotifyCallback"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uuid",
     "referenced_type" : "type-199"
    },
    {
     "field_name" : "datalen",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "data",
     "field_offset" : 160,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "PsshEntry",
   "name" : "PsshEntry",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 24,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h",
   "unique_id" : "PsshEntry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "numentries",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "entries",
     "field_offset" : 32,
     "referenced_type" : "type-201"
    }
   ],
   "linker_set_key" : "PsshInfo",
   "name" : "PsshInfo",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 4,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h",
   "unique_id" : "PsshInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mKey",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "mValue",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "AMediaDrmKeyValuePair",
   "name" : "AMediaDrmKeyValuePair",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h",
   "unique_id" : "AMediaDrmKeyValuePair"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "keyId",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "keyType",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "AMediaDrmKeyStatus",
   "name" : "AMediaDrmKeyStatus",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 12,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h",
   "unique_id" : "AMediaDrmKeyStatus"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "AMediaDrmByteArray",
   "name" : "AMediaDrmByteArray",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h",
   "unique_id" : "AMediaDrmByteArray"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "presentationTimeUs",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "AMediaCodecBufferInfo",
   "name" : "AMediaCodecBufferInfo",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 20,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h",
   "unique_id" : "AMediaCodecBufferInfo"
  }
 ],
 "rvalue_reference_types" : []
}
