{
 "array_types" :
 [
  {
   "linker_set_key" : "char []",
   "name" : "char []",
   "referenced_type" : "type-24",
   "self_type" : "type-23",
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-84",
   "self_type" : "type-83",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float",
   "name" : "float",
   "referenced_type" : "type-124",
   "self_type" : "type-124",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-33",
   "self_type" : "type-33",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "long",
   "name" : "long",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,

   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-248",
   "self_type" : "type-247",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-251",
   "self_type" : "type-250",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-264",
   "self_type" : "type-263",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-283",
   "self_type" : "type-282",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-295",
   "self_type" : "type-294",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-302",
   "self_type" : "type-301",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-307",
   "self_type" : "type-306",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-315",
   "self_type" : "type-314",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-328",
   "self_type" : "type-327",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-338",
   "self_type" : "type-337",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-346",
   "self_type" : "type-345",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-367",
   "self_type" : "type-366",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-375",
   "self_type" : "type-374",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-40",
   "self_type" : "type-39",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-65",
   "self_type" : "type-64",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-78",
   "self_type" : "type-77",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-7",
   "self_type" : "type-6",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-90",
   "self_type" : "type-89",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-92",
   "self_type" : "type-91",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-95",
   "self_type" : "type-94",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-175",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-27",
   "self_type" : "type-26",
   "source_file" : "/system/core/liblog/include/log/log.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "priority",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "uid",
     "field_offset" : 160,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "pid",
     "field_offset" : 192,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "tid",
     "field_offset" : 224,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "tag",
     "field_offset" : 256,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "tagLen",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "messageLen",
     "field_offset" : 384,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "message",
     "field_offset" : 448,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "AndroidLogEntry_t",
   "name" : "AndroidLogEntry_t",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 64,
   "source_file" : "/system/core/liblog/include/log/logprint.h",
   "unique_id" : "AndroidLogEntry_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "type-124"
    }
   ],
   "linker_set_key" : "android_event_float_t",
   "name" : "android_event_float_t",
   "referenced_type" : "type-211",
   "self_type" : "type-211",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_float_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android_event_header_t",
   "name" : "android_event_header_t",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_header_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android_event_int_t",
   "name" : "android_event_int_t",
   "referenced_type" : "type-216",
   "self_type" : "type-216",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_int_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "element_count",
     "field_offset" : 8,
     "referenced_type" : "type-204"
    }
   ],
   "linker_set_key" : "android_event_list_t",
   "name" : "android_event_list_t",
   "referenced_type" : "type-203",
   "self_type" : "type-203",
   "size" : 2,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_list_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "android_event_long_t",
   "name" : "android_event_long_t",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_long_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "data",
     "field_offset" : 40,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android_event_string_t",
   "name" : "android_event_string_t",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_string_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "type-216"
    }
   ],
   "linker_set_key" : "android_log_event_int_t",
   "name" : "android_log_event_int_t",
   "referenced_type" : "type-218",
   "self_type" : "type-218",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_int_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx",
     "referenced_type" : "type-140"
    },
    {
     "access" : "private",
     "field_name" : "ret",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    }
   ],
   "linker_set_key" : "android_log_event_list",
   "name" : "android_log_event_list",
   "record_kind" : "class",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "_ZTS22android_log_event_list"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "type-219"
    }
   ],
   "linker_set_key" : "android_log_event_long_t",
   "name" : "android_log_event_long_t",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 13,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_long_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-204"
    },
    {
     "field_name" : "length",
     "field_offset" : 40,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "data",
     "field_offset" : 72,
     "referenced_type" : "type-23"
    }
   ],
   "linker_set_key" : "android_log_event_string_t",
   "name" : "android_log_event_string_t",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_string_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "tid",
     "field_offset" : 8,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "realtime",
     "field_offset" : 24,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "android_log_header_t",
   "name" : "android_log_header_t",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 11,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_header_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "complete",
     "field_offset" : 32,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "len",
     "field_offset" : 48,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-123"
    }
   ],
   "linker_set_key" : "android_log_list_element",
   "name" : "android_log_list_element",
   "referenced_type" : "type-122",
   "self_type" : "type-122",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "android_log_list_element"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32",
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "int64",
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "string",
     "referenced_type" : "type-114"
    },
    {
     "field_name" : "float32",
     "referenced_type" : "type-124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:48:3) at system/core/liblog/include/log/log_event_list.h:48:3",
   "name" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:48:3) at system/core/liblog/include/log/log_event_list.h:48:3",
   "record_kind" : "union",
   "referenced_type" : "type-123",
   "self_type" : "type-123",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:48:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "len",
     "field_offset" : 8,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "uid",
     "field_offset" : 24,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 40,
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android_pmsg_log_header_t",
   "name" : "android_pmsg_log_header_t",
   "referenced_type" : "type-192",
   "self_type" : "type-192",
   "size" : 7,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_pmsg_log_header_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-31"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:125:3) at system/core/liblog/include/log/log_read.h:125:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:125:3) at system/core/liblog/include/log/log_read.h:125:3",
   "record_kind" : "union",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:125:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h",
   "unique_id" : "log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-67"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-66",
   "self_type" : "type-66",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-33"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-74"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  }
 ],
 "rvalue_reference_types" : []
}
