{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA0_9PsshEntry",
   "name" : "PsshEntry [0]",
   "referenced_type" : "type-762",
   "self_type" : "type-779",
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "type-6",
   "self_type" : "type-71",
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_j",
   "name" : "unsigned int [10]",
   "referenced_type" : "type-19",
   "self_type" : "type-224",
   "size" : 40,
   "source_file" : "/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_c",
   "name" : "char [128]",
   "referenced_type" : "type-3",
   "self_type" : "type-878",
   "size" : 128,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA12_m",
   "name" : "unsigned long [12]",
   "referenced_type" : "type-13",
   "self_type" : "type-2016",
   "size" : 96,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA16_10audio_gain",
   "name" : "audio_gain [16]",
   "referenced_type" : "type-862",
   "self_type" : "type-881",
   "size" : 512,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,

   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "type-2562",
   "self_type" : "type-2564",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "type-360",
   "self_type" : "type-363",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "type-475",
   "self_type" : "type-477",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "type-775",
   "self_type" : "type-777",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "type-927",
   "self_type" : "type-929",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "type-981",
   "self_type" : "type-983",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "type-1401",
   "self_type" : "type-1400",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "type-14",
   "self_type" : "type-1376",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "type-3",
   "self_type" : "type-2",
   "size" : 1,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "type-932",
   "self_type" : "type-1466",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "type-566",
   "self_type" : "type-997",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "type-30",
   "self_type" : "type-37",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "type-6",
   "self_type" : "type-218",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "type-19",
   "self_type" : "type-210",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "type-76",
   "self_type" : "type-1455",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "type-13",
   "self_type" : "type-488",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "type-123",
   "self_type" : "type-1426",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "type-236",
   "self_type" : "type-1445",
   "size" : 2,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "type-12",
   "self_type" : "type-1471",
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "type-32",
   "self_type" : "type-39",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcel.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "type-14",
   "self_type" : "type-1798",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "min_value",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "max_value",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "default_value",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "step_value",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "min_ramp_ms",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "max_ramp_ms",
     "field_offset" : 224,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI10audio_gain",
   "name" : "audio_gain",
   "referenced_type" : "type-862",
   "self_type" : "type-862",
   "size" : 32,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "type-836"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "type-837"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "type-878"
    },
    {
     "field_name" : "num_sample_rates",
     "field_offset" : 1120,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sample_rates",
     "field_offset" : 1152,
     "referenced_type" : "type-879"
    },
    {
     "field_name" : "num_channel_masks",
     "field_offset" : 2176,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "channel_masks",
     "field_offset" : 2208,
     "referenced_type" : "type-879"
    },
    {
     "field_name" : "num_formats",
     "field_offset" : 3232,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "formats",
     "field_offset" : 3264,
     "referenced_type" : "type-880"
    },
    {
     "field_name" : "num_gains",
     "field_offset" : 4288,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "gains",
     "field_offset" : 4320,
     "referenced_type" : "type-881"
    },
    {
     "field_name" : "active_config",
     "field_offset" : 8416,
     "referenced_type" : "type-871"
    },
    {
     "field_name" : "ext",
     "field_offset" : 10144,
     "referenced_type" : "type-882"
    }
   ],
   "linker_set_key" : "_ZTI10audio_port",
   "name" : "audio_port",
   "referenced_type" : "type-877",
   "self_type" : "type-877",
   "size" : 1308,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "num_sources",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sources",
     "field_offset" : 64,
     "referenced_type" : "type-884"
    },
    {
     "field_name" : "num_sinks",
     "field_offset" : 27712,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sinks",
     "field_offset" : 27744,
     "referenced_type" : "type-884"
    }
   ],
   "linker_set_key" : "_ZTI11audio_patch",
   "name" : "audio_patch",
   "referenced_type" : "type-883",
   "self_type" : "type-883",
   "size" : 6924,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rect",
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "score",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "id",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "left_eye",
     "field_offset" : 192,
     "referenced_type" : "type-1979"
    },
    {
     "field_name" : "right_eye",
     "field_offset" : 256,
     "referenced_type" : "type-1979"
    },
    {
     "field_name" : "mouth",
     "field_offset" : 320,
     "referenced_type" : "type-1979"
    }
   ],
   "linker_set_key" : "_ZTI11camera_face",
   "name" : "camera_face",
   "referenced_type" : "type-1978",
   "self_type" : "type-1978",
   "size" : 48,
   "source_file" : "/system/core/libsystem/include/system/camera.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "facing",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "device_version",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "static_camera_characteristics",
     "field_offset" : 128,
     "referenced_type" : "type-1983"
    },
    {
     "field_name" : "resource_cost",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "conflicting_devices",
     "field_offset" : 256,
     "referenced_type" : "type-1986"
    },
    {
     "field_name" : "conflicting_devices_length",
     "field_offset" : 320,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTI11camera_info",
   "name" : "camera_info",
   "referenced_type" : "type-1982",
   "self_type" : "type-1982",
   "size" : 48,
   "source_file" : "/hardware/libhardware/include/hardware/camera_common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "module",
     "field_offset" : 64,
     "referenced_type" : "type-2015"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 128,
     "referenced_type" : "type-2016"
    },
    {
     "field_name" : "close",
     "field_offset" : 896,
     "referenced_type" : "type-2017"
    }
   ],
   "linker_set_key" : "_ZTI11hw_device_t",
   "name" : "hw_device_t",
   "referenced_type" : "type-2014",
   "self_type" : "type-2014",
   "size" : 120,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "module_api_version",
     "field_offset" : 32,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "hal_api_version",
     "field_offset" : 48,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "author",
     "field_offset" : 192,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "methods",
     "field_offset" : 256,
     "referenced_type" : "type-2006"
    },
    {
     "field_name" : "dso",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-2019"
    }
   ],
   "linker_set_key" : "_ZTI11hw_module_t",
   "name" : "hw_module_t",
   "referenced_type" : "type-2005",
   "self_type" : "type-2005",
   "size" : 248,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "type-830"
    },
    {
     "field_name" : "offload_info",
     "field_offset" : 128,
     "referenced_type" : "type-856"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 512,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI12audio_config",
   "name" : "audio_config",
   "referenced_type" : "type-858",
   "self_type" : "type-858",
   "size" : 72,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timeLow",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "timeMid",
     "field_offset" : 32,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "timeHiAndVersion",
     "field_offset" : 48,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "clockSeq",
     "field_offset" : 64,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "type-892"
    }
   ],
   "linker_set_key" : "_ZTI12audio_uuid_s",
   "name" : "audio_uuid_s",
   "referenced_type" : "type-891",
   "self_type" : "type-891",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-910"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-909",
   "self_type" : "type-909",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-992"
    },
    {
     "field_name" : "flags",
     "field_offset" : 448,
     "referenced_type" : "type-210"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 480,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 512,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 544,
     "referenced_type" : "type-997"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 576,
     "referenced_type" : "type-997"
    },
    {
     "field_name" : "oem",
     "field_offset" : 640,
     "referenced_type" : "type-986"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 896,
     "referenced_type" : "type-998"
    },
    {
     "field_name" : "dequeueBuffer_DEPRECATED",
     "field_offset" : 960,
     "referenced_type" : "type-999"
    },
    {
     "field_name" : "lockBuffer_DEPRECATED",
     "field_offset" : 1024,
     "referenced_type" : "type-1006"
    },
    {
     "field_name" : "queueBuffer_DEPRECATED",
     "field_offset" : 1088,
     "referenced_type" : "type-1006"
    },
    {
     "field_name" : "query",
     "field_offset" : 1152,
     "referenced_type" : "type-1008"
    },
    {
     "field_name" : "perform",
     "field_offset" : 1216,
     "referenced_type" : "type-1013"
    },
    {
     "field_name" : "cancelBuffer_DEPRECATED",
     "field_offset" : 1280,
     "referenced_type" : "type-1006"
    },
    {
     "field_name" : "dequeueBuffer",
     "field_offset" : 1344,
     "referenced_type" : "type-1015"
    },
    {
     "field_name" : "queueBuffer",
     "field_offset" : 1408,
     "referenced_type" : "type-1017"
    },
    {
     "field_name" : "cancelBuffer",
     "field_offset" : 1472,
     "referenced_type" : "type-1017"
    }
   ],
   "linker_set_key" : "_ZTI13ANativeWindow",
   "name" : "ANativeWindow",
   "referenced_type" : "type-991",
   "self_type" : "type-991",
   "size" : 192,
   "source_file" : "/frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-846"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-2723",
   "self_type" : "type-2723",
   "size" : 80,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2005"
    },
    {
     "field_name" : "get_number_of_cameras",
     "field_offset" : 1984,
     "referenced_type" : "type-2020"
    },
    {
     "field_name" : "get_camera_info",
     "field_offset" : 2048,
     "referenced_type" : "type-2022"
    },
    {
     "field_name" : "set_callbacks",
     "field_offset" : 2112,
     "referenced_type" : "type-2025"
    },
    {
     "field_name" : "get_vendor_tag_ops",
     "field_offset" : 2176,
     "referenced_type" : "type-2027"
    },
    {
     "field_name" : "open_legacy",
     "field_offset" : 2240,
     "referenced_type" : "type-2031"
    },
    {
     "field_name" : "set_torch_mode",
     "field_offset" : 2304,
     "referenced_type" : "type-2033"
    },
    {
     "field_name" : "init",
     "field_offset" : 2368,
     "referenced_type" : "type-2020"
    },
    {
     "field_name" : "get_physical_camera_info",
     "field_offset" : 2432,
     "referenced_type" : "type-2035"
    },
    {
     "field_name" : "is_stream_combination_supported",
     "field_offset" : 2496,
     "referenced_type" : "type-2040"
    },
    {
     "field_name" : "notify_device_state_change",
     "field_offset" : 2560,
     "referenced_type" : "type-2044"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 2624,
     "referenced_type" : "type-2046"
    }
   ],
   "linker_set_key" : "_ZTI13camera_module",
   "name" : "camera_module",
   "referenced_type" : "type-2004",
   "self_type" : "type-2004",
   "size" : 344,
   "source_file" : "/hardware/libhardware/include/hardware/camera_common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stream_type",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "data_space",
     "field_offset" : 160,
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "rotation",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "physical_camera_id",
     "field_offset" : 256,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "_ZTI13camera_stream",
   "name" : "camera_stream",
   "referenced_type" : "type-2000",
   "self_type" : "type-2000",
   "size" : 40,
   "source_file" : "/hardware/libhardware/include/hardware/camera_common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-71"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-70",
   "self_type" : "type-70",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI14AImageCropRect",
   "name" : "AImageCropRect",
   "referenced_type" : "type-1941",
   "self_type" : "type-1941",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImage.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2014"
    },
    {
     "field_name" : "alloc",
     "field_offset" : 960,
     "referenced_type" : "type-2831"
    },
    {
     "field_name" : "free",
     "field_offset" : 1024,
     "referenced_type" : "type-2834"
    },
    {
     "field_name" : "dump",
     "field_offset" : 1088,
     "referenced_type" : "type-2836"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1152,
     "referenced_type" : "type-1005"
    }
   ],
   "linker_set_key" : "_ZTI14alloc_device_t",
   "name" : "alloc_device_t",
   "referenced_type" : "type-2830",
   "self_type" : "type-2830",
   "size" : 200,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "type-833"
    },
    {
     "field_name" : "output",
     "referenced_type" : "type-832"
    }
   ],
   "linker_set_key" : "_ZTI14audio_io_flags",
   "name" : "audio_io_flags",
   "record_kind" : "union",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2014"
    },
    {
     "field_name" : "ops",
     "field_offset" : 960,
     "referenced_type" : "type-2114"
    },
    {
     "field_name" : "priv",
     "field_offset" : 1024,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "_ZTI14camera3_device",
   "name" : "camera3_device",
   "referenced_type" : "type-2113",
   "self_type" : "type-2113",
   "size" : 136,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stream_type",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "max_buffers",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "priv",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "data_space",
     "field_offset" : 256,
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "rotation",
     "field_offset" : 288,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "physical_camera_id",
     "field_offset" : 320,
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-2052"
    }
   ],
   "linker_set_key" : "_ZTI14camera3_stream",
   "name" : "camera3_stream",
   "referenced_type" : "type-2051",
   "self_type" : "type-2051",
   "size" : 96,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-565",
   "self_type" : "type-565",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2005"
    },
    {
     "field_name" : "registerBuffer",
     "field_offset" : 1984,
     "referenced_type" : "type-2809"
    },
    {
     "field_name" : "unregisterBuffer",
     "field_offset" : 2048,
     "referenced_type" : "type-2809"
    },
    {
     "field_name" : "lock",
     "field_offset" : 2112,
     "referenced_type" : "type-2813"
    },
    {
     "field_name" : "unlock",
     "field_offset" : 2176,
     "referenced_type" : "type-2809"
    },
    {
     "field_name" : "perform",
     "field_offset" : 2240,
     "referenced_type" : "type-2815"
    },
    {
     "field_name" : "lock_ycbcr",
     "field_offset" : 2304,
     "referenced_type" : "type-2817"
    },
    {
     "field_name" : "lockAsync",
     "field_offset" : 2368,
     "referenced_type" : "type-2820"
    },
    {
     "field_name" : "unlockAsync",
     "field_offset" : 2432,
     "referenced_type" : "type-2822"
    },
    {
     "field_name" : "lockAsync_ycbcr",
     "field_offset" : 2496,
     "referenced_type" : "type-2824"
    },
    {
     "field_name" : "getTransportSize",
     "field_offset" : 2560,
     "referenced_type" : "type-2826"
    },
    {
     "field_name" : "validateBufferSize",
     "field_offset" : 2624,
     "referenced_type" : "type-2828"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 2688,
     "referenced_type" : "type-1004"
    }
   ],
   "linker_set_key" : "_ZTI16gralloc_module_t",
   "name" : "gralloc_module_t",
   "referenced_type" : "type-2808",
   "self_type" : "type-2808",
   "size" : 344,
   "source_file" : "/hardware/libhardware/include/hardware/gralloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pData",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "iWidth",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "iHeight",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "iStride",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI17EGLClientPixmapHI",
   "name" : "EGLClientPixmapHI",
   "referenced_type" : "type-2881",
   "self_type" : "type-2881",
   "size" : 24,
   "source_file" : "/frameworks/native/opengl/include/EGL/eglext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "type-830"
    }
   ],
   "linker_set_key" : "_ZTI17audio_config_base",
   "name" : "audio_config_base",
   "referenced_type" : "type-860",
   "self_type" : "type-860",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "mode",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "values",
     "field_offset" : 96,
     "referenced_type" : "type-864"
    },
    {
     "field_name" : "ramp_duration_ms",
     "field_offset" : 1120,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI17audio_gain_config",
   "name" : "audio_gain_config",
   "referenced_type" : "type-863",
   "self_type" : "type-863",
   "size" : 144,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "type-836"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "type-837"
    },
    {
     "field_name" : "config_mask",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-830"
    },
    {
     "field_name" : "gain",
     "field_offset" : 224,
     "referenced_type" : "type-863"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1376,
     "referenced_type" : "type-865"
    },
    {
     "field_name" : "ext",
     "field_offset" : 1408,
     "referenced_type" : "type-872"
    }
   ],
   "linker_set_key" : "_ZTI17audio_port_config",
   "name" : "audio_port_config",
   "referenced_type" : "type-871",
   "self_type" : "type-871",
   "size" : 216,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frame_number",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "error_stream",
     "field_offset" : 64,
     "referenced_type" : "type-2055"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI17camera3_error_msg",
   "name" : "camera3_error_msg",
   "referenced_type" : "type-2067",
   "self_type" : "type-2067",
   "size" : 24,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "jpeg_blob_id",
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "jpeg_size",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI17camera3_jpeg_blob",
   "name" : "camera3_jpeg_blob",
   "referenced_type" : "type-2062",
   "self_type" : "type-2062",
   "size" : 8,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTI18AMediaDrmByteArray",
   "name" : "AMediaDrmByteArray",
   "referenced_type" : "type-1618",
   "self_type" : "type-1618",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "keyId",
     "referenced_type" : "type-1618"
    },
    {
     "field_name" : "keyType",
     "field_offset" : 128,
     "referenced_type" : "type-1615"
    }
   ],
   "linker_set_key" : "_ZTI18AMediaDrmKeyStatus",
   "name" : "AMediaDrmKeyStatus",
   "referenced_type" : "type-1617",
   "self_type" : "type-1617",
   "size" : 24,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "type-2724"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-2725",
   "self_type" : "type-2725",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "content_type",
     "referenced_type" : "type-835"
    },
    {
     "field_name" : "usage",
     "field_offset" : 32,
     "referenced_type" : "type-834"
    },
    {
     "field_name" : "source",
     "field_offset" : 64,
     "referenced_type" : "type-828"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "tags",
     "field_offset" : 128,
     "referenced_type" : "type-852"
    }
   ],
   "linker_set_key" : "_ZTI18audio_attributes_t",
   "name" : "audio_attributes_t",
   "referenced_type" : "type-851",
   "self_type" : "type-851",
   "size" : 272,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "latency_class",
     "field_offset" : 64,
     "referenced_type" : "type-838"
    }
   ],
   "linker_set_key" : "_ZTI18audio_port_mix_ext",
   "name" : "audio_port_mix_ext",
   "referenced_type" : "type-875",
   "self_type" : "type-875",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "initialize",
     "referenced_type" : "type-2109"
    },
    {
     "field_name" : "configure_streams",
     "field_offset" : 64,
     "referenced_type" : "type-2115"
    },
    {
     "field_name" : "register_stream_buffers",
     "field_offset" : 128,
     "referenced_type" : "type-2118"
    },
    {
     "field_name" : "construct_default_request_settings",
     "field_offset" : 192,
     "referenced_type" : "type-2122"
    },
    {
     "field_name" : "process_capture_request",
     "field_offset" : 256,
     "referenced_type" : "type-2124"
    },
    {
     "field_name" : "get_metadata_vendor_tag_ops",
     "field_offset" : 320,
     "referenced_type" : "type-2127"
    },
    {
     "field_name" : "dump",
     "field_offset" : 384,
     "referenced_type" : "type-2131"
    },
    {
     "field_name" : "flush",
     "field_offset" : 448,
     "referenced_type" : "type-2133"
    },
    {
     "field_name" : "signal_stream_flush",
     "field_offset" : 512,
     "referenced_type" : "type-2135"
    },
    {
     "field_name" : "is_reconfiguration_required",
     "field_offset" : 576,
     "referenced_type" : "type-2141"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 640,
     "referenced_type" : "type-2052"
    }
   ],
   "linker_set_key" : "_ZTI18camera3_device_ops",
   "name" : "camera3_device_ops",
   "referenced_type" : "type-2108",
   "self_type" : "type-2108",
   "size" : 128,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "message",
     "field_offset" : 64,
     "referenced_type" : "type-2070"
    }
   ],
   "linker_set_key" : "_ZTI18camera3_notify_msg",
   "name" : "camera3_notify_msg",
   "referenced_type" : "type-2069",
   "self_type" : "type-2069",
   "size" : 40,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-992"
    },
    {
     "field_name" : "width",
     "field_offset" : 448,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "height",
     "field_offset" : 480,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "stride",
     "field_offset" : 512,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "format",
     "field_offset" : 544,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 640,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 704,
     "referenced_type" : "type-1004"
    },
    {
     "field_name" : "handle",
     "field_offset" : 768,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "usage",
     "field_offset" : 832,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 896,
     "referenced_type" : "type-1005"
    }
   ],
   "linker_set_key" : "_ZTI19ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-1003",
   "self_type" : "type-1003",
   "size" : 168,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-2726"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-2728"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-2727",
   "self_type" : "type-2727",
   "size" : 16,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "time_nanoseconds",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "position_frames",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI19audio_mmap_position",
   "name" : "audio_mmap_position",
   "referenced_type" : "type-888",
   "self_type" : "type-888",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frame_number",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTI19camera3_shutter_msg",
   "name" : "camera3_shutter_msg",
   "referenced_type" : "type-2068",
   "self_type" : "type-2068",
   "size" : 16,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "open",
     "referenced_type" : "type-2008"
    }
   ],
   "linker_set_key" : "_ZTI19hw_module_methods_t",
   "name" : "hw_module_methods_t",
   "referenced_type" : "type-2007",
   "self_type" : "type-2007",
   "size" : 8,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTI20AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "referenced_type" : "type-2781",
   "self_type" : "type-2781",
   "size" : 40,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bits",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-957"
    }
   ],
   "linker_set_key" : "_ZTI20ANativeWindow_Buffer",
   "name" : "ANativeWindow_Buffer",
   "referenced_type" : "type-956",
   "self_type" : "type-956",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/native_window.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-846"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-2730"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-2729",
   "self_type" : "type-2729",
   "size" : 36,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "size",
     "field_offset" : 16,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-830"
    },
    {
     "field_name" : "stream_type",
     "field_offset" : 128,
     "referenced_type" : "type-827"
    },
    {
     "field_name" : "bit_rate",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "duration_us",
     "field_offset" : 192,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "has_video",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "is_streaming",
     "field_offset" : 264,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "bit_width",
     "field_offset" : 288,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "offload_buffer_size",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "usage",
     "field_offset" : 352,
     "referenced_type" : "type-834"
    }
   ],
   "linker_set_key" : "_ZTI20audio_offload_info_t",
   "name" : "audio_offload_info_t",
   "referenced_type" : "type-856",
   "self_type" : "type-856",
   "size" : 48,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "process_capture_result",
     "referenced_type" : "type-2085"
    },
    {
     "field_name" : "notify",
     "field_offset" : 64,
     "referenced_type" : "type-2091"
    },
    {
     "field_name" : "request_stream_buffers",
     "field_offset" : 128,
     "referenced_type" : "type-2095"
    },
    {
     "field_name" : "return_stream_buffers",
     "field_offset" : 192,
     "referenced_type" : "type-2101"
    }
   ],
   "linker_set_key" : "_ZTI20camera3_callback_ops",
   "name" : "camera3_callback_ops",
   "referenced_type" : "type-2084",
   "self_type" : "type-2084",
   "size" : 32,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encryptBlocks",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "skipBlocks",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI20cryptoinfo_pattern_t",
   "name" : "cryptoinfo_pattern_t",
   "referenced_type" : "type-2637",
   "self_type" : "type-2637",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-2014"
    },
    {
     "field_name" : "flags",
     "field_offset" : 960,
     "referenced_type" : "type-210"
    },
    {
     "field_name" : "width",
     "field_offset" : 992,
     "referenced_type" : "type-210"
    },
    {
     "field_name" : "height",
     "field_offset" : 1024,
     "referenced_type" : "type-210"
    },
    {
     "field_name" : "stride",
     "field_offset" : 1056,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "format",
     "field_offset" : 1088,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 1120,
     "referenced_type" : "type-997"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 1152,
     "referenced_type" : "type-997"
    },
    {
     "field_name" : "fps",
     "field_offset" : 1184,
     "referenced_type" : "type-997"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 1216,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 1248,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "numFramebuffers",
     "field_offset" : 1280,
     "referenced_type" : "type-218"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1312,
     "referenced_type" : "type-2796"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 1536,
     "referenced_type" : "type-2797"
    },
    {
     "field_name" : "setUpdateRect",
     "field_offset" : 1600,
     "referenced_type" : "type-2800"
    },
    {
     "field_name" : "post",
     "field_offset" : 1664,
     "referenced_type" : "type-2802"
    },
    {
     "field_name" : "compositionComplete",
     "field_offset" : 1728,
     "referenced_type" : "type-2804"
    },
    {
     "field_name" : "dump",
     "field_offset" : 1792,
     "referenced_type" : "type-2806"
    },
    {
     "field_name" : "enableScreen",
     "field_offset" : 1856,
     "referenced_type" : "type-2797"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 1920,
     "referenced_type" : "type-2052"
    }
   ],
   "linker_set_key" : "_ZTI20framebuffer_device_t",
   "name" : "framebuffer_device_t",
   "referenced_type" : "type-2795",
   "self_type" : "type-2795",
   "size" : 288,
   "source_file" : "/hardware/libhardware/include/hardware/fb.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI21AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "referenced_type" : "type-2782",
   "self_type" : "type-2782",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "presentationTimeUs",
     "field_offset" : 64,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI21AMediaCodecBufferInfo",
   "name" : "AMediaCodecBufferInfo",
   "referenced_type" : "type-166",
   "self_type" : "type-166",
   "size" : 24,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mKey",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "mValue",
     "field_offset" : 64,
     "referenced_type" : "type-48"
    }
   ],
   "linker_set_key" : "_ZTI21AMediaDrmKeyValuePair",
   "name" : "AMediaDrmKeyValuePair",
   "referenced_type" : "type-1585",
   "self_type" : "type-1585",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "type-993"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 320,
     "referenced_type" : "type-994"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 384,
     "referenced_type" : "type-994"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_base_t",
   "name" : "android_native_base_t",
   "referenced_type" : "type-992",
   "self_type" : "type-992",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_rect_t",
   "name" : "android_native_rect_t",
   "referenced_type" : "type-2785",
   "self_type" : "type-2785",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "type-867"
    }
   ],
   "linker_set_key" : "_ZTI21audio_port_device_ext",
   "name" : "audio_port_device_ext",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "type-2055"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "type-2059"
    },
    {
     "field_name" : "status",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "acquire_fence",
     "field_offset" : 160,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "release_fence",
     "field_offset" : 192,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI21camera3_stream_buffer",
   "name" : "camera3_stream_buffer",
   "referenced_type" : "type-2058",
   "self_type" : "type-2058",
   "size" : 32,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "number_of_faces",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "faces",
     "field_offset" : 64,
     "referenced_type" : "type-1981"
    }
   ],
   "linker_set_key" : "_ZTI21camera_frame_metadata",
   "name" : "camera_frame_metadata",
   "referenced_type" : "type-1980",
   "self_type" : "type-1980",
   "size" : 16,
   "source_file" : "/system/core/libsystem/include/system/camera.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "source",
     "referenced_type" : "type-828"
    },
    {
     "field_name" : "gain",
     "field_offset" : 32,
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "dest_device",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "dest_device_address",
     "field_offset" : 96,
     "referenced_type" : "type-867"
    }
   ],
   "linker_set_key" : "_ZTI21record_track_metadata",
   "name" : "record_track_metadata",
   "referenced_type" : "type-890",
   "self_type" : "type-890",
   "size" : 44,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-2784"
    }
   ],
   "linker_set_key" : "_ZTI22AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "referenced_type" : "type-2783",
   "self_type" : "type-2783",
   "size" : 72,
   "source_file" : "/frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "shared_memory_address",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "shared_memory_fd",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "buffer_size_frames",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "burst_size_frames",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-886"
    }
   ],
   "linker_set_key" : "_ZTI22audio_mmap_buffer_info",
   "name" : "audio_mmap_buffer_info",
   "referenced_type" : "type-887",
   "self_type" : "type-887",
   "size" : 24,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "type-829"
    }
   ],
   "linker_set_key" : "_ZTI22audio_port_session_ext",
   "name" : "audio_port_session_ext",
   "referenced_type" : "type-876",
   "self_type" : "type-876",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "type-2055"
    },
    {
     "field_name" : "num_buffers_requested",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI22camera3_buffer_request",
   "name" : "camera3_buffer_request",
   "referenced_type" : "type-2074",
   "self_type" : "type-2074",
   "size" : 16,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frame_number",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "result",
     "field_offset" : 64,
     "referenced_type" : "type-1983"
    },
    {
     "field_name" : "num_output_buffers",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "output_buffers",
     "field_offset" : 192,
     "referenced_type" : "type-2080"
    },
    {
     "field_name" : "input_buffer",
     "field_offset" : 256,
     "referenced_type" : "type-2080"
    },
    {
     "field_name" : "partial_result",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "num_physcam_metadata",
     "field_offset" : 352,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "physcam_ids",
     "field_offset" : 384,
     "referenced_type" : "type-917"
    },
    {
     "field_name" : "physcam_metadata",
     "field_offset" : 448,
     "referenced_type" : "type-2082"
    }
   ],
   "linker_set_key" : "_ZTI22camera3_capture_result",
   "name" : "camera3_capture_result",
   "referenced_type" : "type-2083",
   "self_type" : "type-2083",
   "size" : 64,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frame_number",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "settings",
     "field_offset" : 64,
     "referenced_type" : "type-1983"
    },
    {
     "field_name" : "input_buffer",
     "field_offset" : 128,
     "referenced_type" : "type-2076"
    },
    {
     "field_name" : "num_output_buffers",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "output_buffers",
     "field_offset" : 256,
     "referenced_type" : "type-2080"
    },
    {
     "field_name" : "num_physcam_settings",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "physcam_id",
     "field_offset" : 384,
     "referenced_type" : "type-917"
    },
    {
     "field_name" : "physcam_settings",
     "field_offset" : 448,
     "referenced_type" : "type-2082"
    }
   ],
   "linker_set_key" : "_ZTI23camera3_capture_request",
   "name" : "camera3_capture_request",
   "referenced_type" : "type-2079",
   "self_type" : "type-2079",
   "size" : 64,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "camera_device_status_change",
     "referenced_type" : "type-1994"
    },
    {
     "field_name" : "torch_mode_status_change",
     "field_offset" : 64,
     "referenced_type" : "type-1998"
    }
   ],
   "linker_set_key" : "_ZTI23camera_module_callbacks",
   "name" : "camera_module_callbacks",
   "referenced_type" : "type-1993",
   "self_type" : "type-1993",
   "size" : 16,
   "source_file" : "/hardware/libhardware/include/hardware/camera_common.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "type-834"
    },
    {
     "field_name" : "content_type",
     "field_offset" : 32,
     "referenced_type" : "type-835"
    },
    {
     "field_name" : "gain",
     "field_offset" : 64,
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "_ZTI23playback_track_metadata",
   "name" : "playback_track_metadata",
   "referenced_type" : "type-889",
   "self_type" : "type-889",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 8,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "usecase",
     "field_offset" : 64,
     "referenced_type" : "type-869"
    }
   ],
   "linker_set_key" : "_ZTI25audio_port_config_mix_ext",
   "name" : "audio_port_config_mix_ext",
   "referenced_type" : "type-868",
   "self_type" : "type-868",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "type-2055"
    },
    {
     "field_name" : "status",
     "field_offset" : 64,
     "referenced_type" : "type-2073"
    },
    {
     "field_name" : "num_output_buffers",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "output_buffers",
     "field_offset" : 128,
     "referenced_type" : "type-2076"
    }
   ],
   "linker_set_key" : "_ZTI25camera3_stream_buffer_ret",
   "name" : "camera3_stream_buffer_ret",
   "referenced_type" : "type-2075",
   "self_type" : "type-2075",
   "size" : 24,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "type-2055"
    },
    {
     "field_name" : "num_buffers",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "buffers",
     "field_offset" : 128,
     "referenced_type" : "type-2061"
    }
   ],
   "linker_set_key" : "_ZTI25camera3_stream_buffer_set",
   "name" : "camera3_stream_buffer_set",
   "referenced_type" : "type-2060",
   "self_type" : "type-2060",
   "size" : 24,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num_streams",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "streams",
     "field_offset" : 64,
     "referenced_type" : "type-2002"
    },
    {
     "field_name" : "operation_mode",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI25camera_stream_combination",
   "name" : "camera_stream_combination",
   "referenced_type" : "type-2001",
   "self_type" : "type-2001",
   "size" : 24,
   "source_file" : "/hardware/libhardware/include/hardware/camera_common.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "onImageAvailable",
     "field_offset" : 64,
     "referenced_type" : "type-1957"
    }
   ],
   "linker_set_key" : "_ZTI26AImageReader_ImageListener",
   "name" : "AImageReader_ImageListener",
   "referenced_type" : "type-1956",
   "self_type" : "type-1956",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImageReader.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-565"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-565"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-565"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-565"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-564",
   "self_type" : "type-564",
   "size" : 40,
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-566"
    }
   ],
   "linker_set_key" : "_ZTI27audio_microphone_coordinate",
   "name" : "audio_microphone_coordinate",
   "referenced_type" : "type-895",
   "self_type" : "type-895",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "type-867"
    }
   ],
   "linker_set_key" : "_ZTI28audio_port_config_device_ext",
   "name" : "audio_port_config_device_ext",
   "referenced_type" : "type-866",
   "self_type" : "type-866",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num_streams",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "streams",
     "field_offset" : 64,
     "referenced_type" : "type-2054"
    },
    {
     "field_name" : "operation_mode",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "session_parameters",
     "field_offset" : 192,
     "referenced_type" : "type-1983"
    }
   ],
   "linker_set_key" : "_ZTI28camera3_stream_configuration",
   "name" : "camera3_stream_configuration",
   "referenced_type" : "type-2053",
   "self_type" : "type-2053",
   "size" : 32,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "type-829"
    }
   ],
   "linker_set_key" : "_ZTI29audio_port_config_session_ext",
   "name" : "audio_port_config_session_ext",
   "referenced_type" : "type-870",
   "self_type" : "type-870",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "onAsyncInputAvailable",
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "onAsyncOutputAvailable",
     "field_offset" : 64,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "onAsyncFormatChanged",
     "field_offset" : 128,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "onAsyncError",
     "field_offset" : 192,
     "referenced_type" : "type-171"
    }
   ],
   "linker_set_key" : "_ZTI32AMediaCodecOnAsyncNotifyCallback",
   "name" : "AMediaCodecOnAsyncNotifyCallback",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 32,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device_id",
     "referenced_type" : "type-867"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "device",
     "field_offset" : 288,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "address",
     "field_offset" : 320,
     "referenced_type" : "type-867"
    },
    {
     "field_name" : "channel_mapping",
     "field_offset" : 576,
     "referenced_type" : "type-899"
    },
    {
     "field_name" : "location",
     "field_offset" : 1536,
     "referenced_type" : "type-893"
    },
    {
     "field_name" : "group",
     "field_offset" : 1568,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "index_in_the_group",
     "field_offset" : 1600,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "sensitivity",
     "field_offset" : 1632,
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "max_spl",
     "field_offset" : 1664,
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "min_spl",
     "field_offset" : 1696,
     "referenced_type" : "type-566"
    },
    {
     "field_name" : "directionality",
     "field_offset" : 1728,
     "referenced_type" : "type-894"
    },
    {
     "field_name" : "num_frequency_responses",
     "field_offset" : 1760,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "frequency_responses",
     "field_offset" : 1792,
     "referenced_type" : "type-900"
    },
    {
     "field_name" : "geometric_location",
     "field_offset" : 18176,
     "referenced_type" : "type-895"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 18272,
     "referenced_type" : "type-895"
    }
   ],
   "linker_set_key" : "_ZTI33audio_microphone_characteristic_t",
   "name" : "audio_microphone_characteristic_t",
   "referenced_type" : "type-898",
   "self_type" : "type-898",
   "size" : 2296,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "onBufferRemoved",
     "field_offset" : 64,
     "referenced_type" : "type-1962"
    }
   ],
   "linker_set_key" : "_ZTI34AImageReader_BufferRemovedListener",
   "name" : "AImageReader_BufferRemovedListener",
   "referenced_type" : "type-1961",
   "self_type" : "type-1961",
   "size" : 16,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkImageReader.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "referenced_type" : "type-549",
   "self_type" : "type-549",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1061"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "numentries",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "entries",
     "field_offset" : 64,
     "referenced_type" : "type-779"
    }
   ],
   "linker_set_key" : "_ZTI8PsshInfo",
   "name" : "PsshInfo",
   "referenced_type" : "type-778",
   "self_type" : "type-778",
   "size" : 8,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uuid",
     "referenced_type" : "type-763"
    },
    {
     "field_name" : "datalen",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "_ZTI9PsshEntry",
   "name" : "PsshEntry",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 32,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "type-873"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "type-875"
    },
    {
     "field_name" : "session",
     "referenced_type" : "type-876"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10audio_portUt_E",
   "name" : "audio_port::(anonymous union at system/media/audio/include/system/audio.h:539:5)",
   "record_kind" : "union",
   "referenced_type" : "type-882",
   "self_type" : "type-882",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "type-866"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "type-868"
    },
    {
     "field_name" : "session",
     "referenced_type" : "type-870"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN17audio_port_configUt_E",
   "name" : "audio_port_config::(anonymous union at system/media/audio/include/system/audio.h:488:5)",
   "record_kind" : "union",
   "referenced_type" : "type-872",
   "self_type" : "type-872",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "error",
     "referenced_type" : "type-2067"
    },
    {
     "field_name" : "shutter",
     "referenced_type" : "type-2068"
    },
    {
     "field_name" : "generic",
     "referenced_type" : "type-2071"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18camera3_notify_msgUt_E",
   "name" : "camera3_notify_msg::(anonymous union at hardware/libhardware/include/hardware/camera3.h:2141:5)",
   "record_kind" : "union",
   "referenced_type" : "type-2070",
   "self_type" : "type-2070",
   "size" : 32,
   "source_file" : "/hardware/libhardware/include/hardware/camera3.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "type-827"
    },
    {
     "field_name" : "source",
     "referenced_type" : "type-828"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN25audio_port_config_mix_extUt_E",
   "name" : "audio_port_config_mix_ext::(anonymous union at system/media/audio/include/system/audio.h:461:5)",
   "record_kind" : "union",
   "referenced_type" : "type-869",
   "self_type" : "type-869",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1972"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "mGraphicBuffer",
     "referenced_type" : "type-1109"
    },
    {
     "field_name" : "mFence",
     "field_offset" : 64,
     "referenced_type" : "type-552"
    },
    {
     "field_name" : "mFenceTime",
     "field_offset" : 128,
     "referenced_type" : "type-1971"
    },
    {
     "field_name" : "mCrop",
     "field_offset" : 256,
     "referenced_type" : "type-548"
    },
    {
     "field_name" : "mTransform",
     "field_offset" : 384,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mScalingMode",
     "field_offset" : 416,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mTimestamp",
     "field_offset" : 448,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "mIsAutoTimestamp",
     "field_offset" : 512,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mDataSpace",
     "field_offset" : 544,
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "mHdrMetadata",
     "field_offset" : 576,
     "referenced_type" : "type-563"
    },
    {
     "field_name" : "mFrameNumber",
     "field_offset" : 1216,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "mSlot",
     "field_offset" : 1280,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "mIsDroppable",
     "field_offset" : 1312,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mAcquireCalled",
     "field_offset" : 1320,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mTransformToDisplayInverse",
     "field_offset" : 1328,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mSurfaceDamage",
     "field_offset" : 1344,
     "referenced_type" : "type-560"
    },
    {
     "field_name" : "mAutoRefresh",
     "field_offset" : 1664,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mQueuedBuffer",
     "field_offset" : 1672,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mIsStale",
     "field_offset" : 1680,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mApi",
     "field_offset" : 1696,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTIN7android10BufferItemE",
   "name" : "android::BufferItem",
   "record_kind" : "class",
   "referenced_type" : "type-1970",
   "self_type" : "type-1970",
   "size" : 216,
   "source_file" : "/frameworks/native/libs/gui/include/gui/BufferItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mGraphicBuffer",
     "referenced_type" : "type-1109"
    },
    {
     "field_name" : "mEglDisplay",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "mBufferState",
     "field_offset" : 128,
     "referenced_type" : "type-2882"
    },
    {
     "field_name" : "mRequestBufferCalled",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mFrameNumber",
     "field_offset" : 320,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "mEglFence",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "mFence",
     "field_offset" : 448,
     "referenced_type" : "type-552"
    },
    {
     "field_name" : "mAcquireCalled",
     "field_offset" : 512,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "mNeedsReallocation",
     "field_offset" : 520,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "_ZTIN7android10BufferSlotE",
   "name" : "android::BufferSlot",
   "referenced_type" : "type-2886",
   "self_type" : "type-2886",
   "size" : 72,
   "source_file" : "/frameworks/native/libs/gui/include/gui/BufferSlot.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-177"
    }
   ],
   "linker_set_key" : "_ZTIN7android10IInterfaceE",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-506",
   "self_type" : "type-506",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android10ParcelableE",
   "name" : "android::Parcelable",
   "record_kind" : "class",
   "referenced_type" : "type-1582",
   "self_type" : "type-1582",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Parcelable.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10ParcelableE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10ParcelableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "type-210"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "type-488"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1776"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_10IDrmClientEEE",
   "name" : "android::BnInterface<android::IDrmClient>",
   "record_kind" : "class",
   "referenced_type" : "type-1775",
   "self_type" : "type-1775",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1777" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_10IDrmClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_10IDrmClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_10IDrmClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_10IDrmClientEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_10IDrmClientEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IDrmClient9sendEventENS_9DrmPlugin9EventTypeERKNS_8hardware8hidl_vecIhEES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IDrmClient20sendExpirationUpdateERKNS_8hardware8hidl_vecIhEEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IDrmClient14sendKeysChangeERKNS_8hardware8hidl_vecIhEERKNSt3__16vectorINS_12DrmKeyStatusENS6_9allocatorIS8_EEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IDrmClient20sendSessionLostStateERKNS_8hardware8hidl_vecIhEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_10IDrmClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_10IDrmClientEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_10IDrmClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_10IDrmClientEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_10IDrmClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_10IDrmClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_10IDrmClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_10IDrmClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_10IDrmClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-499"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE",
   "name" : "android::BnInterface<android::IDataSource>",
   "record_kind" : "class",
   "referenced_type" : "type-498",
   "self_type" : "type-498",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-503" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IDataSourceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource10getIMemoryEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource6readAtElm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource7getSizeEPl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource5closeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource8toStringEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IDataSource17DrmInitializationEPKc"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IDataSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IDataSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IDataSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IDataSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IDataSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IDataSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IDataSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IDataSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-505"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE",
   "name" : "android::BnInterface<android::IMemoryHeap>",
   "record_kind" : "class",
   "referenced_type" : "type-504",
   "self_type" : "type-504",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-505" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_11IMemoryHeapEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_11IMemoryHeapEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-794"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_12IMediaPlayerEEE",
   "name" : "android::BnInterface<android::IMediaPlayer>",
   "record_kind" : "class",
   "referenced_type" : "type-793",
   "self_type" : "type-793",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-795" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaPlayerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaPlayerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaPlayerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaPlayerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IMediaPlayerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer10disconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer13setDataSourceERKNS_2spINS_17IMediaHTTPServiceEEEPKcPKNS_11KeyedVectorINS_7String8ES9_EE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer13setDataSourceEill"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer13setDataSourceERKNS_2spINS_13IStreamSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer13setDataSourceERKNS_2spINS_11IDataSourceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer22setVideoSurfaceTextureERKNS_2spINS_22IGraphicBufferProducerEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer20getBufferingSettingsEPNS_17BufferingSettingsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer20setBufferingSettingsERKNS_17BufferingSettingsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer12prepareAsyncEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer5startEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer5pauseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer9isPlayingEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer19setPlaybackSettingsERKNS_17AudioPlaybackRateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer19getPlaybackSettingsEPNS_17AudioPlaybackRateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer15setSyncSettingsERKNS_14AVSyncSettingsEf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer15getSyncSettingsEPNS_14AVSyncSettingsEPf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer6seekToEiNS_10MediaTrack11ReadOptions8SeekModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer18getCurrentPositionEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer11getDurationEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer8notifyAtEl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer5resetEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer18setAudioStreamTypeE19audio_stream_type_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer10setLoopingEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer9setVolumeEff"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer21setAuxEffectSendLevelEf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer15attachAuxEffectEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer12setParameterEiRKNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer12getParameterEiPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer21setRetransmitEndpointEPK11sockaddr_in"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer21getRetransmitEndpointEP11sockaddr_in"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer13setNextPlayerERKNS_2spIS0_EE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer17applyVolumeShaperERKNS_2spINS_5media12VolumeShaper13ConfigurationEEERKNS1_INS3_9OperationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer20getVolumeShaperStateEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer10prepareDrmEPKhRKNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer10releaseDrmEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer6invokeERKNS_6ParcelEPS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer17setMetadataFilterERKNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer11getMetadataEbbPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer15setOutputDeviceEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer17getRoutedDeviceIdEPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaPlayer25enableAudioDeviceCallbackEb"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaPlayerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaPlayerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaPlayerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IMediaPlayerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaPlayerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaPlayerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaPlayerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IMediaPlayerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IMediaPlayerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-510"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE",
   "name" : "android::BnInterface<android::IMediaSource>",
   "record_kind" : "class",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-511" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_12IMediaSourceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource5startEPNS_8MetaDataE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource9getFormatEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource4readEPPNS_15MediaBufferBaseEPKNS_10MediaTrack11ReadOptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource12readMultipleEPNS_6VectorIPNS_15MediaBufferBaseEEEjPKNS_10MediaTrack11ReadOptionsE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource19supportReadMultipleEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource22supportNonblockingReadEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12IMediaSource5pauseEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_12IMediaSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_12IMediaSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_12IMediaSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_12IMediaSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IMediaSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_12IMediaSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-804"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_13IStreamSourceEEE",
   "name" : "android::BnInterface<android::IStreamSource>",
   "record_kind" : "class",
   "referenced_type" : "type-803",
   "self_type" : "type-803",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-805" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_13IStreamSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IStreamSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IStreamSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IStreamSourceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_13IStreamSourceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13IStreamSource11setListenerERKNS_2spINS_15IStreamListenerEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13IStreamSource10setBuffersERKNS_6VectorINS_2spINS_7IMemoryEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android13IStreamSource17onBufferAvailableEm"
    },
    {
     "mangled_component_name" : "_ZNK7android13IStreamSource5flagsEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_13IStreamSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_13IStreamSourceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_13IStreamSourceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_13IStreamSourceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_13IStreamSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_13IStreamSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_13IStreamSourceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_13IStreamSourceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_13IStreamSourceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-514"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE",
   "name" : "android::BnInterface<android::IMediaExtractor>",
   "record_kind" : "class",
   "referenced_type" : "type-513",
   "self_type" : "type-513",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-515" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IMediaExtractorEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor11countTracksEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor8getTrackEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor16getTrackMetaDataEmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor11getMetaDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor10getMetricsEPNS_6ParcelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IMediaExtractor5flagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor11setMediaCasERKNSt3__16vectorIhNS1_9allocatorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IMediaExtractor4nameEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IMediaExtractorEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaExtractorEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_15IMediaExtractorEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaExtractorEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IMediaExtractorEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IMediaExtractorEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IMediaExtractorEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IMediaExtractorEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-807"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_15IStreamListenerEEE",
   "name" : "android::BnInterface<android::IStreamListener>",
   "record_kind" : "class",
   "referenced_type" : "type-806",
   "self_type" : "type-806",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-808" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IStreamListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IStreamListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IStreamListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IStreamListenerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_15IStreamListenerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IStreamListener11queueBufferEmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IStreamListener12issueCommandENS0_7CommandEbRKNS_2spINS_8AMessageEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_15IStreamListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IStreamListenerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IStreamListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_15IStreamListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IStreamListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_15IStreamListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_15IStreamListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IStreamListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_15IStreamListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1783"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_16IMediaDrmServiceEEE",
   "name" : "android::BnInterface<android::IMediaDrmService>",
   "record_kind" : "class",
   "referenced_type" : "type-1782",
   "self_type" : "type-1782",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1784" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16IMediaDrmServiceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IMediaDrmServiceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IMediaDrmServiceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IMediaDrmServiceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_16IMediaDrmServiceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16IMediaDrmService7makeDrmEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_16IMediaDrmServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16IMediaDrmServiceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16IMediaDrmServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_16IMediaDrmServiceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16IMediaDrmServiceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_16IMediaDrmServiceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_16IMediaDrmServiceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_16IMediaDrmServiceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_16IMediaDrmServiceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1922"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE",
   "name" : "android::BnInterface<android::IConsumerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-1921",
   "self_type" : "type-1921",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1922" ],
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener12onDisconnectEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameDequeuedEm"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameCancelledEm"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameDetachedEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener17onBuffersReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn16_NK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-935"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE",
   "name" : "android::BnInterface<android::IProducerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-934",
   "self_type" : "type-934",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-935" ],
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener16onBufferReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener18needsReleaseNotifyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ProducerListener18onBuffersDiscardedERKNSt3__16vectorIiNS1_9allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android17IProducerListener13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_17IProducerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IProducerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IProducerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IProducerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn16_NK7android11BnInterfaceINS_17IProducerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_17IProducerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IProducerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_17IProducerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-791"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_18IMediaPlayerClientEEE",
   "name" : "android::BnInterface<android::IMediaPlayerClient>",
   "record_kind" : "class",
   "referenced_type" : "type-790",
   "self_type" : "type-790",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-792" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_18IMediaPlayerClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_18IMediaPlayerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_18IMediaPlayerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_18IMediaPlayerClientEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_18IMediaPlayerClientEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android18IMediaPlayerClient6notifyEiiiPKNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_18IMediaPlayerClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_18IMediaPlayerClientEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_18IMediaPlayerClientEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_18IMediaPlayerClientEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_18IMediaPlayerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_18IMediaPlayerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_18IMediaPlayerClientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_18IMediaPlayerClientEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_18IMediaPlayerClientEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-801"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_19IMediaPlayerServiceEEE",
   "name" : "android::BnInterface<android::IMediaPlayerService>",
   "record_kind" : "class",
   "referenced_type" : "type-800",
   "self_type" : "type-800",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-802" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_19IMediaPlayerServiceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_19IMediaPlayerServiceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_19IMediaPlayerServiceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_19IMediaPlayerServiceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_19IMediaPlayerServiceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android19IMediaPlayerService19createMediaRecorderERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android19IMediaPlayerService23createMetadataRetrieverEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android19IMediaPlayerService6createERKNS_2spINS_18IMediaPlayerClientEEE15audio_session_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android19IMediaPlayerService12getCodecListEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android19IMediaPlayerService22listenForRemoteDisplayERKNS_8String16ERKNS_2spINS_20IRemoteDisplayClientEEERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android19IMediaPlayerService14addBatteryDataEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android19IMediaPlayerService15pullBatteryDataEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_19IMediaPlayerServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_19IMediaPlayerServiceEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_19IMediaPlayerServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_19IMediaPlayerServiceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_19IMediaPlayerServiceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_19IMediaPlayerServiceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_19IMediaPlayerServiceEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_19IMediaPlayerServiceEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_19IMediaPlayerServiceEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1565"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_21IPermissionControllerEEE",
   "name" : "android::BnInterface<android::IPermissionController>",
   "record_kind" : "class",
   "referenced_type" : "type-1564",
   "self_type" : "type-1564",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1565" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_21IPermissionControllerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_21IPermissionControllerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_21IPermissionControllerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_21IPermissionControllerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_21IPermissionControllerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android21IPermissionController15checkPermissionERKNS_8String16Eii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android21IPermissionController6noteOpERKNS_8String16EiS3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android21IPermissionController17getPackagesForUidEjRNS_6VectorINS_8String16EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android21IPermissionController19isRuntimePermissionERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android21IPermissionController13getPackageUidERKNS_8String16Ei"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_21IPermissionControllerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_21IPermissionControllerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_21IPermissionControllerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_21IPermissionControllerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_21IPermissionControllerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_21IPermissionControllerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_21IPermissionControllerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_21IPermissionControllerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_21IPermissionControllerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1911"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE",
   "name" : "android::BnInterface<android::IGraphicBufferConsumer>",
   "record_kind" : "class",
   "referenced_type" : "type-1910",
   "self_type" : "type-1910",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1911" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IGraphicBufferConsumerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13acquireBufferEPNS_10BufferItemElm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13releaseBufferEimPvS1_RKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15consumerConnectERKNS_2spINS_17IConsumerListenerEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18consumerDisconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18getReleasedBuffersEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setDefaultBufferSizeEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer17setMaxBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setMaxAcquiredBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15setConsumerNameERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setDefaultBufferFormatEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setDefaultBufferDataSpaceE19android_dataspace_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setConsumerUsageBitsEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setConsumerIsProtectedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer16setTransformHintEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer17getSidebandStreamEPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer19getOccupancyHistoryEbPNSt3__16vectorINS_16OccupancyTracker7SegmentENS1_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18discardFreeBuffersEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer9dumpStateERKNS_7String8EPS1_"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferConsumerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_22IGraphicBufferConsumerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-907"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE",
   "name" : "android::BnInterface<android::IGraphicBufferProducer>",
   "record_kind" : "class",
   "referenced_type" : "type-906",
   "self_type" : "type-906",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-907" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer13getHalVariantEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13requestBufferEiPNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer25setMaxDequeuedBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12setAsyncModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer13dequeueBufferEPiPNS_2spINS_5FenceEEEjjimPmPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer16detachNextBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer11queueBufferEiRKNS0_16QueueBufferInputEPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer12cancelBufferEiRKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer5queryEiPi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer7connectERKNS_2spINS_17IProducerListenerEEEibPNS0_17QueueBufferOutputE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer10disconnectEiNS0_14DisconnectModeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setSidebandStreamERKNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allocateBuffersEjjim"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer15allowAllocationEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setGenerationNumberEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer15getConsumerNameEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setSharedBufferModeEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14setAutoRefreshEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer17setDequeueTimeoutEl"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19setLegacyBufferDropEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer19getLastQueuedBufferEPNS_2spINS_13GraphicBufferEEEPNS1_INS_5FenceEEEPf"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer18getFrameTimestampsEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer11getUniqueIdEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferProducer16getConsumerUsageEPm"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer18setAutoPrerotationEb"
    },
    {
     "mangled_component_name" : "_ZN7android22IGraphicBufferProducer14exportToParcelEPNS_6ParcelE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferProducerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_22IGraphicBufferProducerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_22IGraphicBufferProducerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferProducerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_22IGraphicBufferProducerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-797"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_23IMediaMetadataRetrieverEEE",
   "name" : "android::BnInterface<android::IMediaMetadataRetriever>",
   "record_kind" : "class",
   "referenced_type" : "type-796",
   "self_type" : "type-796",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-798" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_23IMediaMetadataRetrieverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_23IMediaMetadataRetrieverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_23IMediaMetadataRetrieverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_23IMediaMetadataRetrieverEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_23IMediaMetadataRetrieverEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever10disconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever13setDataSourceERKNS_2spINS_17IMediaHTTPServiceEEEPKcPKNS_11KeyedVectorINS_7String8ES9_EE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever13setDataSourceEill"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever13setDataSourceERKNS_2spINS_11IDataSourceEEEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever14getFrameAtTimeEliib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever15getImageAtIndexEiibb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever19getImageRectAtIndexEiiiiii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever15getFrameAtIndexEiib"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever15extractAlbumArtEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android23IMediaMetadataRetriever15extractMetadataEi"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_23IMediaMetadataRetrieverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_23IMediaMetadataRetrieverEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_23IMediaMetadataRetrieverEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_23IMediaMetadataRetrieverEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_23IMediaMetadataRetrieverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_23IMediaMetadataRetrieverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_23IMediaMetadataRetrieverEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_23IMediaMetadataRetrieverEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_23IMediaMetadataRetrieverEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1780"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_4IDrmEEE",
   "name" : "android::BnInterface<android::IDrm>",
   "record_kind" : "class",
   "referenced_type" : "type-1779",
   "self_type" : "type-1779",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-1781" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_4IDrmEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_4IDrmEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_4IDrmEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_4IDrmEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_4IDrmEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm9initCheckEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm23isCryptoSchemeSupportedEPKhRKNS_7String8ENS_9DrmPlugin13SecurityLevelEPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm12createPluginEPKhRKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm13destroyPluginEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm11openSessionENS_9DrmPlugin13SecurityLevelERNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm12closeSessionERKNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm13getKeyRequestERKNS_6VectorIhEES4_RKNS_7String8ENS_9DrmPlugin7KeyTypeERKNS_11KeyedVectorIS5_S5_EERS2_RS5_PNS8_14KeyRequestTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm18provideKeyResponseERKNS_6VectorIhEES4_RS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm10removeKeysERKNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm11restoreKeysERKNS_6VectorIhEES4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm14queryKeyStatusERKNS_6VectorIhEERNS_11KeyedVectorINS_7String8ES6_EE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm19getProvisionRequestERKNS_7String8ES3_RNS_6VectorIhEERS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm24provideProvisionResponseERKNS_6VectorIhEERS2_S5_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm14getSecureStopsERNS_4ListINS_6VectorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm16getSecureStopIdsERNS_4ListINS_6VectorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm13getSecureStopERKNS_6VectorIhEERS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm18releaseSecureStopsERKNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm16removeSecureStopERKNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm20removeAllSecureStopsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm13getHdcpLevelsEPNS_9DrmPlugin9HdcpLevelES3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm19getNumberOfSessionsEPjS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm16getSecurityLevelERKNS_6VectorIhEEPNS_9DrmPlugin13SecurityLevelE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm26getOfflineLicenseKeySetIdsERNS_4ListINS_6VectorIhEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm20removeOfflineLicenseERKNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm22getOfflineLicenseStateERKNS_6VectorIhEEPNS_9DrmPlugin19OfflineLicenseStateE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm17getPropertyStringERKNS_7String8ERS1_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm20getPropertyByteArrayERKNS_7String8ERNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm17setPropertyStringERKNS_7String8ES3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android4IDrm20setPropertyByteArrayERKNS_7String8ERKNS_6VectorIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm10getMetricsEPNS_2os17PersistableBundleE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm18setCipherAlgorithmERKNS_6VectorIhEERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm15setMacAlgorithmERKNS_6VectorIhEERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm7encryptERKNS_6VectorIhEES4_S4_S4_RS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm7decryptERKNS_6VectorIhEES4_S4_S4_RS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm4signERKNS_6VectorIhEES4_S4_RS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm6verifyERKNS_6VectorIhEES4_S4_S4_Rb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm7signRSAERKNS_6VectorIhEERKNS_7String8ES4_S4_RS2_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4IDrm11setListenerERKNS_2spINS_10IDrmClientEEE"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_4IDrmEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_4IDrmEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_4IDrmEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_4IDrmEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_4IDrmEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_4IDrmEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_4IDrmEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_4IDrmEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_4IDrmEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-508"
    },
    {
     "referenced_type" : "type-500"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE",
   "name" : "android::BnInterface<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-507",
   "self_type" : "type-507",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "template_args" : [ "type-508" ],
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_7IMemoryEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BnInterfaceINS_7IMemoryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BnInterfaceINS_7IMemoryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1919"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mConsumerListener",
     "field_offset" : 384,
     "referenced_type" : "type-1916"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BufferQueue21ProxyConsumerListenerE",
   "name" : "android::BufferQueue::ProxyConsumerListener",
   "record_kind" : "class",
   "referenced_type" : "type-1915",
   "self_type" : "type-1915",
   "size" : 80,
   "source_file" : "/frameworks/native/libs/gui/include/gui/BufferQueue.h",
   "vtable_components" :
   [
    {
     "component_value" : 64,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BufferQueue21ProxyConsumerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener12onDisconnectEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener15onFrameDequeuedEm"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener16onFrameCancelledEm"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener15onFrameDetachedEm"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener17onBuffersReleasedEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BufferQueue21ProxyConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android18BnConsumerListener10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 56,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BufferQueue21ProxyConsumerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BufferQueue21ProxyConsumerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android11BufferQueue21ProxyConsumerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BufferQueue21ProxyConsumerListenerE"
    },
    {
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn16_NK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BufferQueue21ProxyConsumerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android11BufferQueue21ProxyConsumerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn16_N7android18BnConsumerListener10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11BufferQueue21ProxyConsumerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BufferQueue21ProxyConsumerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11BufferQueue21ProxyConsumerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11BufferQueueE",
   "name" : "android::BufferQueue",
   "record_kind" : "class",
   "referenced_type" : "type-1914",
   "self_type" : "type-1914",
   "size" : 1,
   "source_file" : "/frameworks/native/libs/gui/include/gui/BufferQueue.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mDequeueCount",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mQueueCount",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mAcquireCount",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "mShared",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "_ZTIN7android11BufferStateE",
   "name" : "android::BufferState",
   "referenced_type" : "type-2882",
   "self_type" : "type-2882",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/gui/include/gui/BufferSlot.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "format",
     "field_offset" : 128,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "stride",
     "field_offset" : 160,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "crop",
     "field_offset" : 192,
     "referenced_type" : "type-548"
    },
    {
     "field_name" : "transform",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "scalingMode",
     "field_offset" : 352,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 384,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "dataSpace",
     "field_offset" : 448,
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "frameNumber",
     "field_offset" : 512,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "flexFormat",
     "field_offset" : 576,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "dataCb",
     "field_offset" : 640,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "dataCr",
     "field_offset" : 704,
     "referenced_type" : "type-29"
    },
    {
     "field_name" : "chromaStride",
     "field_offset" : 768,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "chromaStep",
     "field_offset" : 800,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "_ZTIN7android11CpuConsumer12LockedBufferE",
   "name" : "android::CpuConsumer::LockedBuffer",
   "referenced_type" : "type-1936",
   "self_type" : "type-1936",
   "size" : 104,
   "source_file" : "/frameworks/native/libs/gui/include/gui/CpuConsumer.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mSlot",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "mGraphicBuffer",
     "field_offset" : 64,
     "referenced_type" : "type-1109"
    },
    {
     "field_name" : "mLockedBufferId",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTIN7android11CpuConsumer14AcquiredBufferE",
   "name" : "android::CpuConsumer::AcquiredBuffer",
   "referenced_type" : "type-1927",
   "self_type" : "type-1927",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/CpuConsumer.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1928"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMaxLockedBuffers",
     "field_offset" : 13376,
     "referenced_type" : "type-488"
    },
    {
     "access" : "private",
     "field_name" : "mAcquiredBuffers",
     "field_offset" : 13440,
     "referenced_type" : "type-1926"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentLockedBuffers",
     "field_offset" : 13760,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTIN7android11CpuConsumerE",
   "name" : "android::CpuConsumer",
   "record_kind" : "class",
   "referenced_type" : "type-1925",
   "self_type" : "type-1925",
   "size" : 1744,
   "source_file" : "/frameworks/native/libs/gui/include/gui/CpuConsumer.h",
   "vtable_components" :
   [
    {
     "component_value" : 1728,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11CpuConsumerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11CpuConsumerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11CpuConsumerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener12onDisconnectEv"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onFrameDequeuedEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase16onFrameCancelledEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onFrameDetachedEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase17onBuffersReleasedEv"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase16freeBufferLockedEi"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase13abandonLockedEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12ConsumerBase10dumpLockedERNS_7String8EPKc"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase19acquireBufferLockedEPNS_10BufferItemElm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase19releaseBufferLockedEiNS_2spINS_13GraphicBufferEEEPvS4_"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -1728,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -1728,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -1728,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11CpuConsumerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11CpuConsumerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11CpuConsumerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android12ConsumerBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_10BufferItemEEE",
   "name" : "android::Flattenable<android::BufferItem>",
   "record_kind" : "class",
   "referenced_type" : "type-1972",
   "self_type" : "type-1972",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1970" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_13GraphicBufferEEE",
   "name" : "android::Flattenable<android::GraphicBuffer>",
   "record_kind" : "class",
   "referenced_type" : "type-1120",
   "self_type" : "type-1120",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-1111" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_16FrameEventsDeltaEEE",
   "name" : "android::Flattenable<android::FrameEventsDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-2771",
   "self_type" : "type-2771",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2772" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_22FrameEventHistoryDeltaEEE",
   "name" : "android::Flattenable<android::FrameEventHistoryDelta>",
   "record_kind" : "class",
   "referenced_type" : "type-822",
   "self_type" : "type-822",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-819" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_22IGraphicBufferProducer16QueueBufferInputEEE",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferInput>",
   "record_kind" : "class",
   "referenced_type" : "type-570",
   "self_type" : "type-570",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-546" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_22IGraphicBufferProducer17QueueBufferOutputEEE",
   "name" : "android::Flattenable<android::IGraphicBufferProducer::QueueBufferOutput>",
   "record_kind" : "class",
   "referenced_type" : "type-823",
   "self_type" : "type-823",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-818" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_5FenceEEE",
   "name" : "android::Flattenable<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-554" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11FlattenableINS_9FenceTime8SnapshotEEE",
   "name" : "android::Flattenable<android::FenceTime::Snapshot>",
   "record_kind" : "class",
   "referenced_type" : "type-2768",
   "self_type" : "type-2768",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-2769" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "valid",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "connectId",
     "field_offset" : 32,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "frameNumber",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "addPostCompositeCalled",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "addReleaseCalled",
     "field_offset" : 136,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "postedTime",
     "field_offset" : 192,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "requestedPresentTime",
     "field_offset" : 256,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "latchTime",
     "field_offset" : 320,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "firstRefreshStartTime",
     "field_offset" : 384,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "lastRefreshStartTime",
     "field_offset" : 448,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "dequeueReadyTime",
     "field_offset" : 512,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "acquireFence",
     "field_offset" : 576,
     "referenced_type" : "type-2939"
    },
    {
     "field_name" : "gpuCompositionDoneFence",
     "field_offset" : 704,
     "referenced_type" : "type-2940"
    },
    {
     "field_name" : "displayPresentFence",
     "field_offset" : 832,
     "referenced_type" : "type-2941"
    },
    {
     "field_name" : "releaseFence",
     "field_offset" : 960,
     "referenced_type" : "type-2942"
    }
   ],
   "linker_set_key" : "_ZTIN7android11FrameEventsE",
   "name" : "android::FrameEvents",
   "referenced_type" : "type-2938",
   "self_type" : "type-2938",
   "size" : 136,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-569"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "validTypes",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "smpte2086",
     "field_offset" : 32,
     "referenced_type" : "type-564"
    },
    {
     "field_name" : "cta8613",
     "field_offset" : 352,
     "referenced_type" : "type-567"
    },
    {
     "field_name" : "hdr10plus",
     "field_offset" : 448,
     "referenced_type" : "type-568"
    }
   ],
   "linker_set_key" : "_ZTIN7android11HdrMetadataE",
   "name" : "android::HdrMetadata",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 80,
   "source_file" : "/frameworks/native/libs/gui/include/gui/HdrMetadata.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-506"
    }
   ],
   "linker_set_key" : "_ZTIN7android11IMemoryHeapE",
   "name" : "android::IMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "type-505",
   "self_type" : "type-505",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IMemoryHeapD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IMemoryHeap22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-485"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_14DrmCopyControlEiEE",
   "name" : "android::KeyedVector<android::DrmCopyControl, int>",
   "record_kind" : "class",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-527", "type-6" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-1494"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEE",
   "name" : "android::KeyedVector<android::AString, android::sp<android::MediaCodecInfo::Capabilities> >",
   "record_kind" : "class",
   "referenced_type" : "type-1602",
   "self_type" : "type-1602",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-1603", "type-1604" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-493"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorINS_7String8ES1_EE",
   "name" : "android::KeyedVector<android::String8, android::String8>",
   "record_kind" : "class",
   "referenced_type" : "type-531",
   "self_type" : "type-531",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-415", "type-415" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-1501"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIjjEE",
   "name" : "android::KeyedVector<unsigned int, unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-1614",
   "self_type" : "type-1614",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-19", "type-19" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-504"
    }
   ],
   "linker_set_key" : "_ZTIN7android12BnMemoryHeapE",
   "name" : "android::BnMemoryHeap",
   "record_kind" : "class",
   "referenced_type" : "type-585",
   "self_type" : "type-585",
   "size" : 48,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getHeapIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getBaseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap7getSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap8getFlagsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IMemoryHeap9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12BnMemoryHeapE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12BnMemoryHeapD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-177"
    }
   ],
   "linker_set_key" : "_ZTIN7android12ConsumerBase22FrameAvailableListenerE",
   "name" : "android::ConsumerBase::FrameAvailableListener",
   "referenced_type" : "type-1933",
   "self_type" : "type-1933",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/ConsumerBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12ConsumerBase22FrameAvailableListenerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android12ConsumerBase22FrameAvailableListener16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase22FrameAvailableListener15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase22FrameAvailableListener15onFrameDequeuedEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase22FrameAvailableListener16onFrameCancelledEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase22FrameAvailableListener15onFrameDetachedEm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12ConsumerBase22FrameAvailableListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12ConsumerBase22FrameAvailableListenerD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12ConsumerBase22FrameAvailableListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12ConsumerBase22FrameAvailableListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12ConsumerBase22FrameAvailableListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mGraphicBuffer",
     "referenced_type" : "type-1109"
    },
    {
     "field_name" : "mFence",
     "field_offset" : 64,
     "referenced_type" : "type-552"
    },
    {
     "field_name" : "mFrameNumber",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTIN7android12ConsumerBase4SlotE",
   "name" : "android::ConsumerBase::Slot",
   "referenced_type" : "type-1930",
   "self_type" : "type-1930",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/ConsumerBase.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-177"
    },
    {
     "access" : "protected",
     "referenced_type" : "type-1918"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSlots",
     "field_offset" : 64,
     "referenced_type" : "type-1929"
    },
    {
     "access" : "protected",
     "field_name" : "mAbandoned",
     "field_offset" : 12352,
     "referenced_type" : "type-14"
    },
    {
     "access" : "protected",
     "field_name" : "mName",
     "field_offset" : 12416,
     "referenced_type" : "type-415"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameAvailableMutex",
     "field_offset" : 12480,
     "referenced_type" : "type-1180"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameAvailableListener",
     "field_offset" : 12800,
     "referenced_type" : "type-1931"
    },
    {
     "access" : "protected",
     "field_name" : "mConsumer",
     "field_offset" : 12928,
     "referenced_type" : "type-1934"
    },
    {
     "access" : "protected",
     "field_name" : "mPrevFinalReleaseFence",
     "field_offset" : 12992,
     "referenced_type" : "type-552"
    },
    {
     "access" : "protected",
     "field_name" : "mMutex",
     "field_offset" : 13056,
     "referenced_type" : "type-1180"
    }
   ],
   "linker_set_key" : "_ZTIN7android12ConsumerBaseE",
   "name" : "android::ConsumerBase",
   "record_kind" : "class",
   "referenced_type" : "type-1928",
   "self_type" : "type-1928",
   "size" : 1688,
   "source_file" : "/frameworks/native/libs/gui/include/gui/ConsumerBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 1672,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12ConsumerBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12ConsumerBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12ConsumerBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener12onDisconnectEv"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onFrameDequeuedEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase16onFrameCancelledEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onFrameDetachedEm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase17onBuffersReleasedEv"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase16freeBufferLockedEi"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase13abandonLockedEv"
    },
    {
     "mangled_component_name" : "_ZNK7android12ConsumerBase10dumpLockedERNS_7String8EPKc"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase19acquireBufferLockedEPNS_10BufferItemElm"
    },
    {
     "mangled_component_name" : "_ZN7android12ConsumerBase19releaseBufferLockedEiNS_2spINS_13GraphicBufferEEEPvS4_"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -1672,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -1672,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -1672,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12ConsumerBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12ConsumerBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android12ConsumerBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android12ConsumerBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-261"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-259" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-2696"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-2695",
   "self_type" : "type-2695",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-2697" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_5FenceEEE",
   "name" : "android::LightRefBase<android::Fence>",
   "record_kind" : "class",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-554" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-177"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHeap",
     "field_offset" : 128,
     "referenced_type" : "type-590"
    },
    {
     "access" : "private",
     "field_name" : "mAllocator",
     "field_offset" : 192,
     "referenced_type" : "type-592"
    }
   ],
   "linker_set_key" : "_ZTIN7android12MemoryDealerE",
   "name" : "android::MemoryDealer",
   "record_kind" : "class",
   "referenced_type" : "type-589",
   "self_type" : "type-589",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/include/binder/MemoryDealer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12MemoryDealerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12MemoryDealerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12MemoryDealerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android12MemoryDealer8allocateEm"
    },
    {
     "mangled_component_name" : "_ZN7android12MemoryDealer10deallocateEm"
    },
    {
     "mangled_component_name" : "_ZNK7android12MemoryDealer4dumpEPKc"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-260"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "type-69"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 24,
   "source_file" : "/system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEEE",
   "name" : "android::SortedVector<android::MediaCodecInfo::ProfileLevel>",
   "record_kind" : "class",
   "referenced_type" : "type-1476",
   "self_type" : "type-1476",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-1477" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_14MediaCodecInfo12ProfileLevelEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::DrmCopyControl, int> >",
   "record_kind" : "class",
   "referenced_type" : "type-485",
   "self_type" : "type-485",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-406" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_14DrmCopyControlEiEEE10do_compareEPKvS6_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::AString, android::sp<android::MediaCodecInfo::Capabilities> > >",
   "record_kind" : "class",
   "referenced_type" : "type-1494",
   "self_type" : "type-1494",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-1495" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7AStringENS_2spINS_14MediaCodecInfo12CapabilitiesEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String8, android::String8> >",
   "record_kind" : "class",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-494" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_7String8ES2_EEE10do_compareEPKvS6_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<unsigned int, unsigned int> >",
   "record_kind" : "class",
   "referenced_type" : "type-1501",
   "self_type" : "type-1501",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-18" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIjjEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIjjEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIjjEEE10do_compareEPKvS5_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorIhEE",
   "name" : "android::SortedVector<unsigned char>",
   "record_kind" : "class",
   "referenced_type" : "type-1757",
   "self_type" : "type-1757",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-30" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorIhEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIhED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIhED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIhE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIhE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIhE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIhE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIhE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIhE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIhE10do_compareEPKvS3_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-486"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorIjEE",
   "name" : "android::SortedVector<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-1493",
   "self_type" : "type-1493",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-19" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorIjEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIjED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorIjED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE16do_move_backwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorIjE10do_compareEPKvS3_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-2932"
    },
    {
     "access" : "private",
     "field_name" : "mQueue",
     "field_offset" : 320,
     "referenced_type" : "type-2933"
    }
   ],
   "linker_set_key" : "_ZTIN7android13FenceTimelineE",
   "name" : "android::FenceTimeline",
   "record_kind" : "class",
   "referenced_type" : "type-2931",
   "self_type" : "type-2931",
   "size" : 88,
   "source_file" : "/frameworks/native/libs/ui/include/ui/FenceTime.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1119"
    },
    {
     "referenced_type" : "type-1120"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 1472,
     "referenced_type" : "type-30"
    },
    {
     "access" : "private",
     "field_name" : "mBufferMapper",
     "field_offset" : 1536,
     "referenced_type" : "type-1112"
    },
    {
     "access" : "private",
     "field_name" : "mInitCheck",
     "field_offset" : 1600,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumFds",
     "field_offset" : 1664,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mTransportNumInts",
     "field_offset" : 1696,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mId",
     "field_offset" : 1728,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mBufferId",
     "field_offset" : 1792,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mGenerationNumber",
     "field_offset" : 1824,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mDeathCallbacks",
     "field_offset" : 1856,
     "referenced_type" : "type-1117"
    },
    {
     "access" : "private",
     "field_name" : "mBufferHubBuffer",
     "field_offset" : 2048,
     "referenced_type" : "type-1118"
    }
   ],
   "linker_set_key" : "_ZTIN7android13GraphicBufferE",
   "name" : "android::GraphicBuffer",
   "record_kind" : "class",
   "referenced_type" : "type-1111",
   "self_type" : "type-1111",
   "size" : 264,
   "source_file" : "/frameworks/native/libs/ui/include/ui/GraphicBuffer.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android13GraphicBufferE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android13GraphicBufferD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLogTag",
     "referenced_type" : "type-535"
    }
   ],
   "linker_set_key" : "_ZTIN7android13SafeInterface13ParcelHandlerE",
   "name" : "android::SafeInterface::ParcelHandler",
   "record_kind" : "class",
   "referenced_type" : "type-2217",
   "self_type" : "type-2217",
   "size" : 8,
   "source_file" : "/frameworks/native/libs/binder/include/binder/SafeInterface.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerI18AMediaDrmKeyStatusEE",
   "name" : "android::trait_pointer<AMediaDrmKeyStatus>",
   "referenced_type" : "type-1712",
   "self_type" : "type-1712",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1617" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_14DrmCopyControlEEE",
   "name" : "android::trait_pointer<android::DrmCopyControl>",
   "referenced_type" : "type-435",
   "self_type" : "type-435",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-436" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_14DrmCopyControlEiEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::DrmCopyControl, int> >",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-406" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tINS_7String8ES2_EEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<android::String8, android::String8> >",
   "referenced_type" : "type-438",
   "self_type" : "type-438",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-414" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIjjEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<unsigned int, unsigned int> >",
   "referenced_type" : "type-2953",
   "self_type" : "type-2953",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_2spINS_16MediaCodecBufferEEEEE",
   "name" : "android::trait_pointer<android::sp<android::MediaCodecBuffer> >",
   "referenced_type" : "type-2968",
   "self_type" : "type-2968",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-57" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_7String8EEE",
   "name" : "android::trait_pointer<android::String8>",
   "referenced_type" : "type-439",
   "self_type" : "type-439",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-415" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_8String16EEE",
   "name" : "android::trait_pointer<android::String16>",
   "referenced_type" : "type-1713",
   "self_type" : "type-1713",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-1702" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIhEE",
   "name" : "android::trait_pointer<unsigned char>",
   "referenced_type" : "type-1714",
   "self_type" : "type-1714",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-30" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIiEE",
   "name" : "android::trait_pointer<int>",
   "referenced_type" : "type-437",
   "self_type" : "type-437",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIjEE",
   "name" : "android::trait_pointer<unsigned int>",
   "referenced_type" : "type-2963",
   "self_type" : "type-2963",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-19" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-585"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFD",
     "field_offset" : 64,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 256,
     "referenced_type" : "type-19"
    },
    {
     "access" : "private",
     "field_name" : "mDevice",
     "field_offset" : 320,
     "referenced_type" : "type-48"
    },
    {
     "access" : "private",
     "field_name" : "mNeedUnmap",
     "field_offset" : 384,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mOffset",
     "field_offset" : 448,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "_ZTIN7android14MemoryHeapBaseE",
   "name" : "android::MemoryHeapBase",
   "record_kind" : "class",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 112,
   "source_file" : "/frameworks/native/libs/binder/include/binder/MemoryHeapBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 96,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 64,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase9getHeapIDEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase7getBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase7getSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase8getFlagsEv"
    },
    {
     "mangled_component_name" : "_ZNK7android14MemoryHeapBase9getOffsetEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -64,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -64,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n32_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n32_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n56_NK7android14MemoryHeapBase9getHeapIDEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n64_NK7android14MemoryHeapBase7getBaseEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n72_NK7android14MemoryHeapBase7getSizeEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n80_NK7android14MemoryHeapBase8getFlagsEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n88_NK7android14MemoryHeapBase9getOffsetEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_11IMemoryHeapEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_11IMemoryHeapEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTvn8_n32_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTvn8_n32_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android12BnMemoryHeap10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -96,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -96,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android14MemoryHeapBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MemoryHeapBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android14MemoryHeapBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-2706",
   "self_type" : "type-2706",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-506"
    }
   ],
   "linker_set_key" : "_ZTIN7android15IServiceManagerE",
   "name" : "android::IServiceManager",
   "record_kind" : "class",
   "referenced_type" : "type-1678",
   "self_type" : "type-1678",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IServiceManager.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15IServiceManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android15IServiceManager22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager10getServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android15IServiceManager12checkServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager10addServiceERKNS_8String16ERKNS_2spINS_7IBinderEEEbi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager12listServicesEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager14waitForServiceERKNS_8String16E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15IServiceManager10isDeclaredERKNS_8String16E"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15IServiceManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android15NdkJavaVMHelperE",
   "name" : "android::NdkJavaVMHelper",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 1,
   "source_file" : "/frameworks/av/media/ndk/include/media/NdkJavaVMHelper.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1921"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLogTag",
     "field_offset" : 320,
     "referenced_type" : "type-535"
    }
   ],
   "linker_set_key" : "_ZTIN7android15SafeBnInterfaceINS_17IConsumerListenerEEE",
   "name" : "android::SafeBnInterface<android::IConsumerListener>",
   "record_kind" : "class",
   "referenced_type" : "type-1920",
   "self_type" : "type-1920",
   "size" : 64,
   "source_file" : "/frameworks/native/libs/binder/include/binder/SafeInterface.h",
   "template_args" : [ "type-1922" ],
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SafeBnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15SafeBnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15SafeBnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener12onDisconnectEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameDequeuedEm"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameCancelledEm"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameDetachedEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener17onBuffersReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SafeBnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android15SafeBnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android15SafeBnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_17IConsumerListenerEE10onAsBinderEv"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SafeBnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "mangled_component_name" : "_ZThn16_N7android11BnInterfaceINS_17IConsumerListenerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn16_NK7android11BnInterfaceINS_17IConsumerListenerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android15SafeBnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn16_N7android15SafeBnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SafeBnInterfaceINS_17IConsumerListenerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15SafeBnInterfaceINS_17IConsumerListenerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15SafeBnInterfaceINS_17IConsumerListenerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1910"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLogTag",
     "field_offset" : 256,
     "referenced_type" : "type-535"
    }
   ],
   "linker_set_key" : "_ZTIN7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEEE",
   "name" : "android::SafeBnInterface<android::IGraphicBufferConsumer>",
   "record_kind" : "class",
   "referenced_type" : "type-2223",
   "self_type" : "type-2223",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/binder/include/binder/SafeInterface.h",
   "template_args" : [ "type-1911" ],
   "vtable_components" :
   [
    {
     "component_value" : 40,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IGraphicBufferConsumerEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13acquireBufferEPNS_10BufferItemElm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12detachBufferEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer12attachBufferEPiRKNS_2spINS_13GraphicBufferEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer13releaseBufferEimPvS1_RKNS_2spINS_5FenceEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15consumerConnectERKNS_2spINS_17IConsumerListenerEEEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18consumerDisconnectEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18getReleasedBuffersEPm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setDefaultBufferSizeEjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer17setMaxBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setMaxAcquiredBufferCountEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer15setConsumerNameERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setDefaultBufferFormatEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer25setDefaultBufferDataSpaceE19android_dataspace_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer20setConsumerUsageBitsEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer22setConsumerIsProtectedEb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer16setTransformHintEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer17getSidebandStreamEPNS_2spINS_12NativeHandleEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer19getOccupancyHistoryEbPNSt3__16vectorINS_16OccupancyTracker7SegmentENS1_9allocatorIS4_EEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IGraphicBufferConsumer18discardFreeBuffersEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android22IGraphicBufferConsumer9dumpStateERKNS_7String8EPS1_"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IGraphicBufferConsumerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "mangled_component_name" : "_ZThn8_N7android11BnInterfaceINS_22IGraphicBufferConsumerEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn8_NK7android11BnInterfaceINS_22IGraphicBufferConsumerEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -40,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15SafeBnInterfaceINS_22IGraphicBufferConsumerEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-177"
    }
   ],
   "linker_set_key" : "_ZTIN7android15SurfaceListenerE",
   "name" : "android::SurfaceListener",
   "record_kind" : "class",
   "referenced_type" : "type-1205",
   "self_type" : "type-1205",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/Surface.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SurfaceListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android15SurfaceListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android15SurfaceListenerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15SurfaceListener16onBufferReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15SurfaceListener18needsReleaseNotifyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android15SurfaceListener18onBuffersDiscardedERKNSt3__16vectorINS_2spINS_13GraphicBufferEEENS1_9allocatorIS5_EEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android15SurfaceListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15SurfaceListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android15SurfaceListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deadline",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "interval",
     "field_offset" : 64,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "presentLatency",
     "field_offset" : 128,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "_ZTIN7android16CompositorTimingE",
   "name" : "android::CompositorTiming",
   "referenced_type" : "type-821",
   "self_type" : "type-821",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-177"
    }
   ],
   "linker_set_key" : "_ZTIN7android16ConsumerListenerE",
   "name" : "android::ConsumerListener",
   "record_kind" : "class",
   "referenced_type" : "type-1918",
   "self_type" : "type-1918",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/gui/include/gui/IConsumerListener.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ConsumerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16ConsumerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16ConsumerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener12onDisconnectEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameDequeuedEm"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameCancelledEm"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameDetachedEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener16onFrameAvailableERKNS_10BufferItemE"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener15onFrameReplacedERKNS_10BufferItemE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener17onBuffersReleasedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android16ConsumerListener23onSidebandStreamChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android16ConsumerListener24addAndGetFrameTimestampsEPKNS_19NewFrameEventsEntryEPNS_22FrameEventHistoryDeltaE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ConsumerListenerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android16ConsumerListenerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android16ConsumerListenerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16FlattenableUtilsE",
   "name" : "android::FlattenableUtils",
   "record_kind" : "class",
   "referenced_type" : "type-2763",
   "self_type" : "type-2763",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2771"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mIndex",
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mFrameNumber",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mAddPostCompositeCalled",
     "field_offset" : 128,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mAddReleaseCalled",
     "field_offset" : 136,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mPostedTime",
     "field_offset" : 192,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mRequestedPresentTime",
     "field_offset" : 256,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mLatchTime",
     "field_offset" : 320,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mFirstRefreshStartTime",
     "field_offset" : 384,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mLastRefreshStartTime",
     "field_offset" : 448,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mDequeueReadyTime",
     "field_offset" : 512,
     "referenced_type" : "type-76"
    },
    {
     "access" : "private",
     "field_name" : "mGpuCompositionDoneFence",
     "field_offset" : 576,
     "referenced_type" : "type-2769"
    },
    {
     "access" : "private",
     "field_name" : "mDisplayPresentFence",
     "field_offset" : 768,
     "referenced_type" : "type-2769"
    },
    {
     "access" : "private",
     "field_name" : "mReleaseFence",
     "field_offset" : 960,
     "referenced_type" : "type-2769"
    }
   ],
   "linker_set_key" : "_ZTIN7android16FrameEventsDeltaE",
   "name" : "android::FrameEventsDelta",
   "record_kind" : "class",
   "referenced_type" : "type-2772",
   "self_type" : "type-2772",
   "size" : 144,
   "source_file" : "/frameworks/native/libs/gui/include/gui/FrameTimestamps.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16LightFlattenableINS_11HdrMetadataEEE",
   "name" : "android::LightFlattenable<android::HdrMetadata>",
   "record_kind" : "class",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-563" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16LightFlattenableINS_4RectEEE",
   "name" : "android::LightFlattenable<android::Rect>",
   "record_kind" : "class",
   "referenced_type" : "type-551",
   "self_type" : "type-551",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/Flattenable.h",
   "template_args" : [ "type-548" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16LightFlattenableINS_5PointEEE",
   "name" : "android::LightFlattenable<android::Point>",
   "record_kind" : "class",
   "referenced_type" : "type-2773",
   "self_type" : "type-2773",
   "size" : 1,
