{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "_fpreg [8]",
   "name" : "_fpreg [8]",
   "referenced_type" : "type-1134",
   "self_type" : "type-1141",
   "size" : 80,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_fpxreg [8]",
   "name" : "_fpxreg [8]",
   "referenced_type" : "type-1136",
   "self_type" : "type-1143",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_xmmreg [8]",
   "name" : "_xmmreg [8]",
   "referenced_type" : "type-1138",
   "self_type" : "type-1144",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_libc_fpxreg [8]",
   "name" : "_libc_fpxreg [8]",
   "referenced_type" : "type-1205",
   "self_type" : "type-1208",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_libc_xmmreg [16]",
   "name" : "_libc_xmmreg [16]",
   "referenced_type" : "type-1206",
   "self_type" : "type-1209",
   "size" : 256,
   "source_file" : "/bionic/libc/include/sys/ucontext.h"
  },
  {
   "linker_set_key" : "void (*[])(const SkMatrix &, float, float, SkPoint *)",
   "name" : "void (*[])(const SkMatrix &, float, float, SkPoint *)",
   "referenced_type" : "type-1444",
   "self_type" : "type-1448",

   "referenced_type" : "type-590",
   "self_type" : "type-589",
   "source_file" : "/external/skia/include/core/SkBitmap.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const unsigned char",
   "name" : "const unsigned char",
   "referenced_type" : "type-5",
   "self_type" : "type-458",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::pair<unsigned long, unsigned long>",
   "name" : "const std::pair<unsigned long, unsigned long>",
   "referenced_type" : "type-604",
   "self_type" : "type-606",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const bool",
   "name" : "const bool",
   "referenced_type" : "type-637",
   "self_type" : "type-641",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const wchar_t",
   "name" : "const wchar_t",
   "referenced_type" : "type-713",
   "self_type" : "type-1224",
   "size" : 4,
   "source_file" : "/external/libcxx/include/wchar.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const jvalue",
   "name" : "const jvalue",
   "referenced_type" : "type-78",
   "self_type" : "type-77",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-79",
   "self_type" : "type-342",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-80",
   "self_type" : "type-466",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const long",
   "name" : "const long",
   "referenced_type" : "type-81",
   "self_type" : "type-474",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-82",
   "self_type" : "type-478",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const double",
   "name" : "const double",
   "referenced_type" : "type-83",
   "self_type" : "type-482",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned long, const void *)",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "type-929",
   "self_type" : "type-931",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned long, const void *)",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "type-932",
   "self_type" : "type-934",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-935",
   "self_type" : "type-937",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "type-938",
   "self_type" : "type-940",
   "size" : 8,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::exception_ptr",
   "name" : "const std::exception_ptr",
   "referenced_type" : "type-948",
   "self_type" : "type-950",
   "size" : 8,
   "source_file" : "/external/libcxx/include/exception"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "type-953",
   "self_type" : "type-954",
   "size" : 16,
   "source_file" : "/external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-956",
   "self_type" : "type-957",
   "size" : 1,
   "source_file" : "/external/libcxx/include/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_ctor_base<false, false>",
   "name" : "const std::__sfinae_ctor_base<false, false>",
   "referenced_type" : "type-982",
   "self_type" : "type-985",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_ctor_base<true, false>",
   "name" : "const std::__sfinae_ctor_base<true, false>",
   "referenced_type" : "type-988",
   "self_type" : "type-990",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_ctor_base<false, true>",
   "name" : "const std::__sfinae_ctor_base<false, true>",
   "referenced_type" : "type-994",
   "self_type" : "type-998",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 320,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 384,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 448,
     "referenced_type" : "type-30"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 512,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 576,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 640,
     "referenced_type" : "type-40"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 704,
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 768,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 832,
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 896,
     "referenced_type" : "type-50"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 960,
     "referenced_type" : "type-52"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 1024,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 1088,
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 1152,
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 1216,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 1280,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 1344,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 1408,
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 1472,
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 1536,
     "referenced_type" : "type-64"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 1600,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 1664,
     "referenced_type" : "type-58"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 1728,
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 1792,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 1856,
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 1920,
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 1984,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 2048,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 2112,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 2176,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 2240,
     "referenced_type" : "type-92"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 2304,
     "referenced_type" : "type-94"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 2368,
     "referenced_type" : "type-96"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 2432,
     "referenced_type" : "type-98"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 2496,
     "referenced_type" : "type-99"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 2560,
     "referenced_type" : "type-101"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 2624,
     "referenced_type" : "type-103"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 2688,
     "referenced_type" : "type-105"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 2752,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 2816,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 2880,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 2944,
     "referenced_type" : "type-113"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 3008,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 3072,
     "referenced_type" : "type-117"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 3136,
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 3200,
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 3264,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 3328,
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 3392,
     "referenced_type" : "type-127"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 3456,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 3520,
     "referenced_type" : "type-131"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 3584,
     "referenced_type" : "type-133"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 3648,
     "referenced_type" : "type-135"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 3712,
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 3776,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 3840,
     "referenced_type" : "type-141"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 3904,
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 3968,
     "referenced_type" : "type-145"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 4032,
     "referenced_type" : "type-147"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 4096,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 4160,
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 4224,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 4288,
     "referenced_type" : "type-155"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 4352,
     "referenced_type" : "type-157"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 4416,
     "referenced_type" : "type-159"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 4480,
     "referenced_type" : "type-161"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 4544,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 4608,
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 4672,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 4736,
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 4800,
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 4864,
     "referenced_type" : "type-173"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 4928,
     "referenced_type" : "type-175"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 4992,
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 5056,
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 5120,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 5184,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 5248,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 5312,
     "referenced_type" : "type-187"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 5376,
     "referenced_type" : "type-189"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 5440,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 5504,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 5568,
     "referenced_type" : "type-195"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 5632,
     "referenced_type" : "type-197"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 5696,
     "referenced_type" : "type-199"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 5760,
     "referenced_type" : "type-201"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 5824,
     "referenced_type" : "type-203"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 5888,
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 5952,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 6016,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 6080,
     "referenced_type" : "type-211"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 6144,
     "referenced_type" : "type-213"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 6208,
     "referenced_type" : "type-215"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 6272,
     "referenced_type" : "type-217"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 6336,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 6400,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 6464,
     "referenced_type" : "type-223"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 6528,
     "referenced_type" : "type-225"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 6592,
     "referenced_type" : "type-227"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 6656,
     "referenced_type" : "type-229"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 6720,
     "referenced_type" : "type-231"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 6784,
     "referenced_type" : "type-233"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 6848,
     "referenced_type" : "type-235"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 6912,
     "referenced_type" : "type-237"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 6976,
     "referenced_type" : "type-239"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 7040,
     "referenced_type" : "type-241"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 7104,
     "referenced_type" : "type-243"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 7168,
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 7232,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 7296,
     "referenced_type" : "type-68"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 7360,
     "referenced_type" : "type-70"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 7424,
     "referenced_type" : "type-74"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 7488,
     "referenced_type" : "type-247"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 7552,
     "referenced_type" : "type-249"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 7616,
     "referenced_type" : "type-251"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 7680,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 7744,
     "referenced_type" : "type-255"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 7808,
     "referenced_type" : "type-257"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 7872,
     "referenced_type" : "type-259"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 7936,
     "referenced_type" : "type-261"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 8000,
     "referenced_type" : "type-263"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 8064,
     "referenced_type" : "type-265"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 8128,
     "referenced_type" : "type-267"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 8192,
     "referenced_type" : "type-269"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 8256,
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 8320,
     "referenced_type" : "type-273"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 8384,
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 8448,
     "referenced_type" : "type-277"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 8512,
     "referenced_type" : "type-279"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 8576,
     "referenced_type" : "type-281"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 8640,
     "referenced_type" : "type-283"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 8704,
     "referenced_type" : "type-285"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 8768,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 8832,
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 8896,
     "referenced_type" : "type-291"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 8960,
     "referenced_type" : "type-293"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 9024,
     "referenced_type" : "type-295"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 9088,
     "referenced_type" : "type-297"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 9152,
     "referenced_type" : "type-299"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 9216,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 9280,
     "referenced_type" : "type-301"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 9344,
     "referenced_type" : "type-303"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 9408,
     "referenced_type" : "type-305"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 9472,
     "referenced_type" : "type-307"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 9536,
     "referenced_type" : "type-309"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 9600,
     "referenced_type" : "type-311"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 9664,
     "referenced_type" : "type-313"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 9728,
     "referenced_type" : "type-315"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 9792,
     "referenced_type" : "type-317"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 9856,
     "referenced_type" : "type-319"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 9920,
     "referenced_type" : "type-321"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 9984,
     "referenced_type" : "type-323"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 10048,
     "referenced_type" : "type-325"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 10112,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 10176,
     "referenced_type" : "type-329"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 10240,
     "referenced_type" : "type-331"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 10304,
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 10368,
     "referenced_type" : "type-335"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 10432,
     "referenced_type" : "type-337"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 10496,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 10560,
     "referenced_type" : "type-345"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 10624,
     "referenced_type" : "type-348"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 10688,
     "referenced_type" : "type-350"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 10752,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 10816,
     "referenced_type" : "type-352"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 10880,
     "referenced_type" : "type-354"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 10944,
     "referenced_type" : "type-356"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 11008,
     "referenced_type" : "type-360"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 11072,
     "referenced_type" : "type-364"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 11136,
     "referenced_type" : "type-366"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 11200,
     "referenced_type" : "type-368"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 11264,
     "referenced_type" : "type-372"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 11328,
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 11392,
     "referenced_type" : "type-380"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 11456,
     "referenced_type" : "type-384"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 11520,
     "referenced_type" : "type-388"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 11584,
     "referenced_type" : "type-392"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 11648,
     "referenced_type" : "type-396"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 11712,
     "referenced_type" : "type-400"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 11776,
     "referenced_type" : "type-402"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 11840,
     "referenced_type" : "type-405"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 11904,
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 11968,
     "referenced_type" : "type-411"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 12032,
     "referenced_type" : "type-414"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 12096,
     "referenced_type" : "type-417"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 12160,
     "referenced_type" : "type-420"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 12224,
     "referenced_type" : "type-423"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 12288,
     "referenced_type" : "type-425"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 12352,
     "referenced_type" : "type-427"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 12416,
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 12480,
     "referenced_type" : "type-431"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 12544,
     "referenced_type" : "type-433"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 12608,
     "referenced_type" : "type-435"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 12672,
     "referenced_type" : "type-437"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 12736,
     "referenced_type" : "type-439"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 12800,
     "referenced_type" : "type-441"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 12864,
     "referenced_type" : "type-443"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 12928,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 12992,
     "referenced_type" : "type-447"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 13056,
     "referenced_type" : "type-449"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 13120,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 13184,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 13248,
     "referenced_type" : "type-455"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 13312,
     "referenced_type" : "type-459"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 13376,
     "referenced_type" : "type-461"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 13440,
     "referenced_type" : "type-463"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 13504,
     "referenced_type" : "type-467"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 13568,
     "referenced_type" : "type-471"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 13632,
     "referenced_type" : "type-475"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 13696,
     "referenced_type" : "type-479"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 13760,
     "referenced_type" : "type-483"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 13824,
     "referenced_type" : "type-488"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 13888,
     "referenced_type" : "type-490"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 13952,
     "referenced_type" : "type-490"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 14016,
     "referenced_type" : "type-492"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 14080,
     "referenced_type" : "type-508"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 14144,
     "referenced_type" : "type-510"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 14208,
     "referenced_type" : "type-513"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 14272,
     "referenced_type" : "type-515"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 14336,
     "referenced_type" : "type-345"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 14400,
     "referenced_type" : "type-348"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 14464,
     "referenced_type" : "type-60"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 14528,
     "referenced_type" : "type-62"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 14592,
     "referenced_type" : "type-517"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 14656,
     "referenced_type" : "type-519"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 14720,
     "referenced_type" : "type-521"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 14784,
     "referenced_type" : "type-523"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 14848,
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 1864,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNINativeInterface"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<false, false>",
   "name" : "std::__sfinae_assign_base<false, false>",
   "referenced_type" : "type-1000",
   "self_type" : "type-1000",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<true, false>",
   "name" : "std::__sfinae_assign_base<true, false>",
   "referenced_type" : "type-1005",
   "self_type" : "type-1005",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<false, true>",
   "name" : "std::__sfinae_assign_base<false, true>",
   "referenced_type" : "type-1011",
   "self_type" : "type-1011",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb0ELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__file_",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "__line_",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "__pred_",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "__msg_",
     "field_offset" : 192,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "std::__libcpp_debug_info",
   "name" : "std::__libcpp_debug_info",
   "referenced_type" : "type-1017",
   "self_type" : "type-1017",
   "size" : 32,
   "source_file" : "/external/libcxx/include/__debug",
   "unique_id" : "_ZTSNSt3__119__libcpp_debug_infoE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::piecewise_construct_t",
   "name" : "std::piecewise_construct_t",
   "referenced_type" : "type-1023",
   "self_type" : "type-1023",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__121piecewise_construct_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<0>",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "type-1025",
   "self_type" : "type-1025",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<1>",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "type-1026",
   "self_type" : "type-1026",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::in_place_t",
   "name" : "std::in_place_t",
   "referenced_type" : "type-1027",
   "self_type" : "type-1027",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110in_place_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<std::_PairT, unsigned long>",
   "name" : "std::unary_function<std::_PairT, unsigned long>",
   "referenced_type" : "type-1030",
   "self_type" : "type-1030",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-1031", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionINS_6_PairTEmEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::_PairT",
   "name" : "std::_PairT",
   "referenced_type" : "type-1031",
   "self_type" : "type-1031",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__16_PairTE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__murmur2_or_cityhash<unsigned long, 64>",
   "name" : "std::__murmur2_or_cityhash<unsigned long, 64>",
   "referenced_type" : "type-1032",
   "self_type" : "type-1032",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__121__murmur2_or_cityhashImLm64EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1030"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<std::_PairT, 2>",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "type-1034",
   "self_type" : "type-1034",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-1031" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashINS_6_PairTELm2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1038"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<__int128, 2>",
   "name" : "std::__scalar_hash<__int128, 2>",
   "referenced_type" : "type-1037",
   "self_type" : "type-1037",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-728" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashInLm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<__int128, unsigned long>",
   "name" : "std::unary_function<__int128, unsigned long>",
   "referenced_type" : "type-1038",
   "self_type" : "type-1038",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-728", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionInmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1040"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<unsigned __int128, 2>",
   "name" : "std::__scalar_hash<unsigned __int128, 2>",
   "referenced_type" : "type-1039",
   "self_type" : "type-1039",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-730" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIoLm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned __int128, unsigned long>",
   "name" : "std::unary_function<unsigned __int128, unsigned long>",
   "referenced_type" : "type-1040",
   "self_type" : "type-1040",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-730", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIomEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1042"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<float, 0>",
   "name" : "std::__scalar_hash<float, 0>",
   "referenced_type" : "type-1041",
   "self_type" : "type-1041",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIfLm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<float, unsigned long>",
   "name" : "std::unary_function<float, unsigned long>",
   "referenced_type" : "type-1042",
   "self_type" : "type-1042",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-82", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIfmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1046"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<double, 1>",
   "name" : "std::__scalar_hash<double, 1>",
   "referenced_type" : "type-1045",
   "self_type" : "type-1045",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIdLm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<double, unsigned long>",
   "name" : "std::unary_function<double, unsigned long>",
   "referenced_type" : "type-1046",
   "self_type" : "type-1046",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-83", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIdmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1050"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long double, 2>",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "type-1049",
   "self_type" : "type-1049",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIgLm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long double, unsigned long>",
   "name" : "std::unary_function<long double, unsigned long>",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIgmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1052"
    }
   ],
   "linker_set_key" : "std::hash<bool>",
   "name" : "std::hash<bool>",
   "referenced_type" : "type-1051",
   "self_type" : "type-1051",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__14hashIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<bool, unsigned long>",
   "name" : "std::unary_function<bool, unsigned long>",
   "referenced_type" : "type-1052",
   "self_type" : "type-1052",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-637", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIbmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1056"
    }
   ],
   "linker_set_key" : "std::hash<char>",
   "name" : "std::hash<char>",
   "referenced_type" : "type-1055",
   "self_type" : "type-1055",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSNSt3__14hashIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char, unsigned long>",
   "name" : "std::unary_function<char, unsigned long>",
   "referenced_type" : "type-1056",
   "self_type" : "type-1056",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-23", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIcmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1060"
    }
   ],
   "linker_set_key" : "std::hash<signed char>",
   "name" : "std::hash<signed char>",
   "referenced_type" : "type-1059",
   "self_type" : "type-1059",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSNSt3__14hashIaEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<signed char, unsigned long>",
   "name" : "std::unary_function<signed char, unsigned long>",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-27", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIamEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1064"
    }
   ],
   "linker_set_key" : "std::hash<unsigned char>",
   "name" : "std::hash<unsigned char>",
   "referenced_type" : "type-1063",
   "self_type" : "type-1063",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSNSt3__14hashIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned char, unsigned long>",
   "name" : "std::unary_function<unsigned char, unsigned long>",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-5", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIhmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1068"
    }
   ],
   "linker_set_key" : "std::hash<char16_t>",
   "name" : "std::hash<char16_t>",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-715" ],
   "unique_id" : "_ZTSNSt3__14hashIDsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char16_t, unsigned long>",
   "name" : "std::unary_function<char16_t, unsigned long>",
   "referenced_type" : "type-1068",
   "self_type" : "type-1068",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-715", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDsmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1072"
    }
   ],
   "linker_set_key" : "std::hash<char32_t>",
   "name" : "std::hash<char32_t>",
   "referenced_type" : "type-1071",
   "self_type" : "type-1071",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-717" ],
   "unique_id" : "_ZTSNSt3__14hashIDiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char32_t, unsigned long>",
   "name" : "std::unary_function<char32_t, unsigned long>",
   "referenced_type" : "type-1072",
   "self_type" : "type-1072",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-717", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDimEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1076"
    }
   ],
   "linker_set_key" : "std::hash<wchar_t>",
   "name" : "std::hash<wchar_t>",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSNSt3__14hashIwEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<wchar_t, unsigned long>",
   "name" : "std::unary_function<wchar_t, unsigned long>",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-713", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIwmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1080"
    }
   ],
   "linker_set_key" : "std::hash<short>",
   "name" : "std::hash<short>",
   "referenced_type" : "type-1079",
   "self_type" : "type-1079",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__14hashIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<short, unsigned long>",
   "name" : "std::unary_function<short, unsigned long>",
   "referenced_type" : "type-1080",
   "self_type" : "type-1080",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIsmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1084"
    }
   ],
   "linker_set_key" : "std::hash<unsigned short>",
   "name" : "std::hash<unsigned short>",
   "referenced_type" : "type-1083",
   "self_type" : "type-1083",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__14hashItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned short, unsigned long>",
   "name" : "std::unary_function<unsigned short, unsigned long>",
   "referenced_type" : "type-1084",
   "self_type" : "type-1084",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionItmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1088"
    }
   ],
   "linker_set_key" : "std::hash<int>",
   "name" : "std::hash<int>",
   "referenced_type" : "type-1087",
   "self_type" : "type-1087",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__14hashIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<int, unsigned long>",
   "name" : "std::unary_function<int, unsigned long>",
   "referenced_type" : "type-1088",
   "self_type" : "type-1088",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-15", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIimEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1092"
    }
   ],
   "linker_set_key" : "std::hash<unsigned int>",
   "name" : "std::hash<unsigned int>",
   "referenced_type" : "type-1091",
   "self_type" : "type-1091",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-528" ],
   "unique_id" : "_ZTSNSt3__14hashIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned int, unsigned long>",
   "name" : "std::unary_function<unsigned int, unsigned long>",
   "referenced_type" : "type-1092",
   "self_type" : "type-1092",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-528", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIjmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1096"
    }
   ],
   "linker_set_key" : "std::hash<long>",
   "name" : "std::hash<long>",
   "referenced_type" : "type-1095",
   "self_type" : "type-1095",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__14hashIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long, unsigned long>",
   "name" : "std::unary_function<long, unsigned long>",
   "referenced_type" : "type-1096",
   "self_type" : "type-1096",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-81", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIlmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1100"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long>",
   "name" : "std::hash<unsigned long>",
   "referenced_type" : "type-1099",
   "self_type" : "type-1099",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__14hashImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long, unsigned long>",
   "name" : "std::unary_function<unsigned long, unsigned long>",
   "referenced_type" : "type-1100",
   "self_type" : "type-1100",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-570", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionImmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1104"
    }
   ],
   "linker_set_key" : "std::hash<long long>",
   "name" : "std::hash<long long>",
   "referenced_type" : "type-1103",
   "self_type" : "type-1103",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__14hashIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1105"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long long, 1>",
   "name" : "std::__scalar_hash<long long, 1>",
   "referenced_type" : "type-1104",
   "self_type" : "type-1104",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIxLm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long long, unsigned long>",
   "name" : "std::unary_function<long long, unsigned long>",
   "referenced_type" : "type-1105",
   "self_type" : "type-1105",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIxmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1107"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long long>",
   "name" : "std::hash<unsigned long long>",
   "referenced_type" : "type-1106",
   "self_type" : "type-1106",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-726" ],
   "unique_id" : "_ZTSNSt3__14hashIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1108"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<unsigned long long, 1>",
   "name" : "std::__scalar_hash<unsigned long long, 1>",
   "referenced_type" : "type-1107",
   "self_type" : "type-1107",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-726" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIyLm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long long, unsigned long>",
   "name" : "std::unary_function<unsigned long long, unsigned long>",
   "referenced_type" : "type-1108",
   "self_type" : "type-1108",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-726", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIymEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1037"
    }
   ],
   "linker_set_key" : "std::hash<__int128_t>",
   "name" : "std::hash<__int128_t>",
   "referenced_type" : "type-1109",
   "self_type" : "type-1109",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-728" ],
   "unique_id" : "_ZTSNSt3__14hashInEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1039"
    }
   ],
   "linker_set_key" : "std::hash<__uint128_t>",
   "name" : "std::hash<__uint128_t>",
   "referenced_type" : "type-1110",
   "self_type" : "type-1110",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-730" ],
   "unique_id" : "_ZTSNSt3__14hashIoEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1041"
    }
   ],
   "linker_set_key" : "std::hash<float>",
   "name" : "std::hash<float>",
   "referenced_type" : "type-1111",
   "self_type" : "type-1111",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__14hashIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1045"
    }
   ],
   "linker_set_key" : "std::hash<double>",
   "name" : "std::hash<double>",
   "referenced_type" : "type-1114",
   "self_type" : "type-1114",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__14hashIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1049"
    }
   ],
   "linker_set_key" : "std::hash<long double>",
   "name" : "std::hash<long double>",
   "referenced_type" : "type-1117",
   "self_type" : "type-1117",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__14hashIgEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1121"
    }
   ],
   "linker_set_key" : "std::hash<nullptr_t>",
   "name" : "std::hash<nullptr_t>",
   "referenced_type" : "type-1120",
   "self_type" : "type-1120",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-703" ],
   "unique_id" : "_ZTSNSt3__14hashIDnEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<nullptr_t, unsigned long>",
   "name" : "std::unary_function<nullptr_t, unsigned long>",
   "referenced_type" : "type-1121",
   "self_type" : "type-1121",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-703", "type-570" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDnmEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-1125",
   "self_type" : "type-1125",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-1126",
   "self_type" : "type-1126",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1124"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1124"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1125"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1125"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-1128",
   "self_type" : "type-1128",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-1129",
   "self_type" : "type-1129",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1129"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1129"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-1130",
   "self_type" : "type-1130",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-1131",
   "self_type" : "type-1131",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "magic1",
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "extended_size",
     "field_offset" : 32,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "xfeatures",
     "field_offset" : 64,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "xstate_size",
     "field_offset" : 128,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "padding",
     "field_offset" : 160,
     "referenced_type" : "type-1133"
    }
   ],
   "linker_set_key" : "_fpx_sw_bytes",
   "name" : "_fpx_sw_bytes",
   "referenced_type" : "type-1132",
   "self_type" : "type-1132",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13_fpx_sw_bytes"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-1135"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "_fpreg",
   "name" : "_fpreg",
   "referenced_type" : "type-1134",
   "self_type" : "type-1134",
   "size" : 10,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS6_fpreg"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-1135"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "padding",
     "field_offset" : 80,
     "referenced_type" : "type-1137"
    }
   ],
   "linker_set_key" : "_fpxreg",
   "name" : "_fpxreg",
   "referenced_type" : "type-1136",
   "self_type" : "type-1136",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_fpxreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-1139"
    }
   ],
   "linker_set_key" : "_xmmreg",
   "name" : "_xmmreg",
   "referenced_type" : "type-1138",
   "self_type" : "type-1138",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xmmreg"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cw",
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "sw",
     "field_offset" : 32,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "tag",
     "field_offset" : 64,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "ipoff",
     "field_offset" : 96,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "cssel",
     "field_offset" : 128,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "dataoff",
     "field_offset" : 160,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "datasel",
     "field_offset" : 192,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "_st",
     "field_offset" : 224,
     "referenced_type" : "type-1141"
    },
    {
     "field_name" : "status",
     "field_offset" : 864,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "magic",
     "field_offset" : 880,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "_fxsr_env",
     "field_offset" : 896,
     "referenced_type" : "type-1142"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 1088,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 1120,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "_fxsr_st",
     "field_offset" : 1152,
     "referenced_type" : "type-1143"
    },
    {
     "field_name" : "_xmm",
     "field_offset" : 2176,
     "referenced_type" : "type-1144"
    },
    {
     "field_offset" : 3200,
     "referenced_type" : "type-1145"
    },
    {
     "field_offset" : 4608,
     "referenced_type" : "type-1147"
    }
   ],
   "linker_set_key" : "_fpstate_32",
   "name" : "_fpstate_32",
   "referenced_type" : "type-1140",
   "self_type" : "type-1140",
   "size" : 624,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_32"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "padding1",
     "referenced_type" : "type-1146"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "type-1146"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:62:3",
   "record_kind" : "union",
   "referenced_type" : "type-1145",
   "self_type" : "type-1145",
   "size" : 176,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "padding2",
     "referenced_type" : "type-1148"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-1132"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "name" : "_fpstate_32::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:66:3",
   "record_kind" : "union",
   "referenced_type" : "type-1147",
   "self_type" : "type-1147",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_32Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "twd",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "mxcsr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-1150"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-1151"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 3328,
     "referenced_type" : "type-1148"
    },
    {
     "field_offset" : 3712,
     "referenced_type" : "type-1152"
    }
   ],
   "linker_set_key" : "_fpstate_64",
   "name" : "_fpstate_64",
   "referenced_type" : "type-1149",
   "self_type" : "type-1149",
   "size" : 512,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_fpstate_64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved3",
     "referenced_type" : "type-1148"
    },
    {
     "field_name" : "sw_reserved",
     "referenced_type" : "type-1132"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "name" : "_fpstate_64::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:83:3",
   "record_kind" : "union",
   "referenced_type" : "type-1152",
   "self_type" : "type-1152",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN11_fpstate_64Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "xfeatures",
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-1154"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 192,
     "referenced_type" : "type-1155"
    }
   ],
   "linker_set_key" : "_header",
   "name" : "_header",
   "referenced_type" : "type-1153",
   "self_type" : "type-1153",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ymmh_space",
     "referenced_type" : "type-1151"
    }
   ],
   "linker_set_key" : "_ymmh_state",
   "name" : "_ymmh_state",
   "referenced_type" : "type-1156",
   "self_type" : "type-1156",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS11_ymmh_state"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpstate",
     "referenced_type" : "type-1149"
    },
    {
     "field_name" : "xstate_hdr",
     "field_offset" : 4096,
     "referenced_type" : "type-1153"
    },
    {
     "field_name" : "ymmh",
     "field_offset" : 4608,
     "referenced_type" : "type-1156"
    }
   ],
   "linker_set_key" : "_xstate",
   "name" : "_xstate",
   "referenced_type" : "type-1157",
   "self_type" : "type-1157",
   "size" : 832,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS7_xstate"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gs",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "__gsh",
     "field_offset" : 16,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fs",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "__fsh",
     "field_offset" : 48,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "es",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "__esh",
     "field_offset" : 80,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "ds",
     "field_offset" : 96,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "__dsh",
     "field_offset" : 112,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "di",
     "field_offset" : 128,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "si",
     "field_offset" : 160,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "bp",
     "field_offset" : 192,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "sp",
     "field_offset" : 224,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "bx",
     "field_offset" : 256,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "dx",
     "field_offset" : 288,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "cx",
     "field_offset" : 320,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "ax",
     "field_offset" : 352,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 384,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "err",
     "field_offset" : 416,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "ip",
     "field_offset" : 448,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "cs",
     "field_offset" : 480,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "__csh",
     "field_offset" : 496,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "flags",
     "field_offset" : 512,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "sp_at_signal",
     "field_offset" : 544,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "ss",
     "field_offset" : 576,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "__ssh",
     "field_offset" : 592,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 608,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 640,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 672,
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "sigcontext_32",
   "name" : "sigcontext_32",
   "referenced_type" : "type-1158",
   "self_type" : "type-1158",
   "size" : 88,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13sigcontext_32"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "di",
     "field_offset" : 512,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "si",
     "field_offset" : 576,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "bp",
     "field_offset" : 640,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "bx",
     "field_offset" : 704,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "dx",
     "field_offset" : 768,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "ax",
     "field_offset" : 832,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "cx",
     "field_offset" : 896,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "sp",
     "field_offset" : 960,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "ip",
     "field_offset" : 1024,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1088,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1152,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1168,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1184,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "ss",
     "field_offset" : 1200,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 1472,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-1160"
    }
   ],
   "linker_set_key" : "sigcontext_64",
   "name" : "sigcontext_64",
   "referenced_type" : "type-1159",
   "self_type" : "type-1159",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS13sigcontext_64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r8",
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r9",
     "field_offset" : 64,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r10",
     "field_offset" : 128,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r11",
     "field_offset" : 192,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r12",
     "field_offset" : 256,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r13",
     "field_offset" : 320,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r14",
     "field_offset" : 384,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "r15",
     "field_offset" : 448,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rdi",
     "field_offset" : 512,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rsi",
     "field_offset" : 576,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rbp",
     "field_offset" : 640,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rbx",
     "field_offset" : 704,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rdx",
     "field_offset" : 768,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rax",
     "field_offset" : 832,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rcx",
     "field_offset" : 896,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rsp",
     "field_offset" : 960,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "rip",
     "field_offset" : 1024,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 1088,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1152,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1168,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1184,
     "referenced_type" : "type-79"
    },
    {
     "field_offset" : 1200,
     "referenced_type" : "type-1162"
    },
    {
     "field_name" : "err",
     "field_offset" : 1216,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "trapno",
     "field_offset" : 1280,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 1344,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "cr2",
     "field_offset" : 1408,
     "referenced_type" : "type-726"
    },
    {
     "field_name" : "fpstate",
     "field_offset" : 1472,
     "referenced_type" : "type-1163"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-1160"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-1161",
   "self_type" : "type-1161",
   "size" : 256,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "ss",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "__pad0",
     "referenced_type" : "type-79"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigcontext::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3",
   "name" : "sigcontext::(anonymous union at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3) at bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h:210:3",
   "record_kind" : "union",
   "referenced_type" : "type-1162",
   "self_type" : "type-1162",
   "size" : 2,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/sigcontext.h",
   "unique_id" : "_ZTSN10sigcontextUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1165"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "type-1167"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-1164",
   "self_type" : "type-1164",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-1169",
   "self_type" : "type-1169",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-x86/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-1170",
   "self_type" : "type-1170",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "type-1172"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-1171",
   "self_type" : "type-1171",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1173"
    },
    {
     "field_name" : "_kill",
     "referenced_type" : "type-1174"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-1175"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-1176"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-1177"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-1178"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-1183"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-1184"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "record_kind" : "union",
   "referenced_type" : "type-1172",
   "self_type" : "type-1172",
   "size" : 112,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-528"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "referenced_type" : "type-1174",
   "self_type" : "type-1174",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1170"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "referenced_type" : "type-1175",
   "self_type" : "type-1175",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1170"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "referenced_type" : "type-1176",
   "self_type" : "type-1176",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut1_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "type-81"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "referenced_type" : "type-1177",
   "self_type" : "type-1177",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut2_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-11"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1179"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "referenced_type" : "type-1178",
   "self_type" : "type-1178",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-1180"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-1182"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "record_kind" : "union",
   "referenced_type" : "type-1179",
   "self_type" : "type-1179",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-1181"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "referenced_type" : "type-1180",
   "self_type" : "type-1180",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-1181"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "type-528"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "referenced_type" : "type-1182",
   "self_type" : "type-1182",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "referenced_type" : "type-1183",
   "self_type" : "type-1183",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut4_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "type-528"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "referenced_type" : "type-1184",
   "self_type" : "type-1184",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut5_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-1170"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "type-1186"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-1185",
   "self_type" : "type-1185",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-920"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-1187"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "record_kind" : "union",
   "referenced_type" : "type-1186",
   "self_type" : "type-1186",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-1188"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "referenced_type" : "type-1187",
   "self_type" : "type-1187",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-15"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1191"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-1167"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-1190",
   "self_type" : "type-1190",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1165"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1192"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:79:20) at bionic/libc/include/bits/signal_types.h:79:20 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:79:20) at bionic/libc/include/bits/signal_types.h:79:20 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-1191",
   "self_type" : "type-1191",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-15"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1196"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-1167"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-1195",
   "self_type" : "type-1195",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1165"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1192"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:80:22) at bionic/libc/include/bits/signal_types.h:80:22 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:80:22) at bionic/libc/include/bits/signal_types.h:80:22 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-1196",
   "self_type" : "type-1196",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "ftw",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "mxcr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "st_space",
     "field_offset" : 256,
     "referenced_type" : "type-1150"
    },
    {
     "field_name" : "xmm_space",
     "field_offset" : 1280,
     "referenced_type" : "type-1151"
    },
    {
     "field_name" : "padding",
     "field_offset" : 3328,
     "referenced_type" : "type-1198"
    }
   ],
   "linker_set_key" : "user_fpregs_struct",
   "name" : "user_fpregs_struct",
   "referenced_type" : "type-1197",
   "self_type" : "type-1197",
   "size" : 512,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_fpregs_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r15",
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "r14",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "r13",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "r12",
     "field_offset" : 192,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rbp",
     "field_offset" : 256,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rbx",
     "field_offset" : 320,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "r11",
     "field_offset" : 384,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "r10",
     "field_offset" : 448,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "r9",
     "field_offset" : 512,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "r8",
     "field_offset" : 576,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rax",
     "field_offset" : 640,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rcx",
     "field_offset" : 704,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rdx",
     "field_offset" : 768,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rsi",
     "field_offset" : 832,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rdi",
     "field_offset" : 896,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "orig_rax",
     "field_offset" : 960,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rip",
     "field_offset" : 1024,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "cs",
     "field_offset" : 1088,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 1152,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rsp",
     "field_offset" : 1216,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "ss",
     "field_offset" : 1280,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "fs_base",
     "field_offset" : 1344,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "gs_base",
     "field_offset" : 1408,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "ds",
     "field_offset" : 1472,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "es",
     "field_offset" : 1536,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "fs",
     "field_offset" : 1600,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "gs",
     "field_offset" : 1664,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "type-1199",
   "self_type" : "type-1199",
   "size" : 216,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_regs_struct"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-1199"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 1728,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "pad0",
     "field_offset" : 1760,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "i387",
     "field_offset" : 1792,
     "referenced_type" : "type-1197"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 5888,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 5952,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 6016,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 6080,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 6144,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "signal",
     "field_offset" : 6208,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 6272,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "pad1",
     "field_offset" : 6304,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 6336,
     "referenced_type" : "type-1201"
    },
    {
     "field_name" : "u_fpstate",
     "field_offset" : 6400,
     "referenced_type" : "type-1202"
    },
    {
     "field_name" : "magic",
     "field_offset" : 6464,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 6528,
     "referenced_type" : "type-1203"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 6784,
     "referenced_type" : "type-1204"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 7296,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 7360,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-1200",
   "self_type" : "type-1200",
   "size" : 928,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "type-1135"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "padding",
     "field_offset" : 80,
     "referenced_type" : "type-1137"
    }
   ],
   "linker_set_key" : "_libc_fpxreg",
   "name" : "_libc_fpxreg",
   "referenced_type" : "type-1205",
   "self_type" : "type-1205",
   "size" : 16,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "_libc_fpxreg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "element",
     "referenced_type" : "type-1139"
    }
   ],
   "linker_set_key" : "_libc_xmmreg",
   "name" : "_libc_xmmreg",
   "referenced_type" : "type-1206",
   "self_type" : "type-1206",
   "size" : 16,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "_libc_xmmreg"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cwd",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "swd",
     "field_offset" : 16,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "ftw",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fop",
     "field_offset" : 48,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "rip",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "rdp",
     "field_offset" : 128,
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "mxcsr",
     "field_offset" : 192,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "mxcr_mask",
     "field_offset" : 224,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "_st",
     "field_offset" : 256,
     "referenced_type" : "type-1208"
    },
    {
     "field_name" : "_xmm",
     "field_offset" : 1280,
     "referenced_type" : "type-1209"
    },
    {
     "field_name" : "padding",
     "field_offset" : 3328,
     "referenced_type" : "type-1198"
    }
   ],
   "linker_set_key" : "_libc_fpstate",
   "name" : "_libc_fpstate",
   "referenced_type" : "type-1207",
   "self_type" : "type-1207",
   "size" : 512,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "_libc_fpstate"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "gregs",
     "referenced_type" : "type-1211"
    },
    {
     "field_name" : "fpregs",
     "field_offset" : 1472,
     "referenced_type" : "type-1212"
    },
    {
     "field_name" : "__reserved1",
     "field_offset" : 1536,
     "referenced_type" : "type-1204"
    }
   ],
   "linker_set_key" : "mcontext_t",
   "name" : "mcontext_t",
   "referenced_type" : "type-1210",
   "self_type" : "type-1210",
   "size" : 256,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "mcontext_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "type-1214"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "type-1169"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 320,
     "referenced_type" : "type-1210"
    },
    {
     "field_offset" : 2368,
     "referenced_type" : "type-1215"
    },
    {
     "field_name" : "__fpregs_mem",
     "field_offset" : 2432,
     "referenced_type" : "type-1207"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-1213",
   "self_type" : "type-1213",
   "size" : 816,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-570"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:381:3) at bionic/libc/include/sys/ucontext.h:381:3",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:381:3) at bionic/libc/include/sys/ucontext.h:381:3",
   "record_kind" : "union",
   "referenced_type" : "type-1215",
   "self_type" : "type-1215",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:381:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-912"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-1218",
   "self_type" : "type-1218",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-1220",
   "self_type" : "type-1220",
   "size" : 56,
   "source_file" : "/bionic/libc/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-1222"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "type-1222"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-1221",
   "self_type" : "type-1221",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__type_name",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "std::type_info",
   "name" : "std::type_info",
   "record_kind" : "class",
   "referenced_type" : "type-1226",
   "self_type" : "type-1226",
   "size" : 16,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt9type_info",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9type_info"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-945"
    }
   ],
   "linker_set_key" : "std::bad_cast",
   "name" : "std::bad_cast",
   "record_kind" : "class",
   "referenced_type" : "type-1231",
   "self_type" : "type-1231",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt8bad_cast",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt8bad_cast"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt8bad_cast4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-945"
    }
   ],
   "linker_set_key" : "std::bad_typeid",
   "name" : "std::bad_typeid",
   "record_kind" : "class",
   "referenced_type" : "type-1232",
   "self_type" : "type-1232",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt10bad_typeid",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt10bad_typeid"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt10bad_typeid4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less<void>",
   "name" : "std::less<void>",
   "referenced_type" : "type-1233",
   "self_type" : "type-1233",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__14lessIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__invoke_void_return_wrapper<void>",
   "name" : "std::__invoke_void_return_wrapper<void>",
   "referenced_type" : "type-1234",
   "self_type" : "type-1234",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__128__invoke_void_return_wrapperIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator_arg_t",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "type-1235",
   "self_type" : "type-1235",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "unique_id" : "_ZTSNSt3__115allocator_arg_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::input_iterator_tag",
   "name" : "std::input_iterator_tag",
   "referenced_type" : "type-1237",
   "self_type" : "type-1237",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__118input_iterator_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::output_iterator_tag",
   "name" : "std::output_iterator_tag",
   "referenced_type" : "type-1238",
   "self_type" : "type-1238",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__119output_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1237"
    }
   ],
   "linker_set_key" : "std::forward_iterator_tag",
   "name" : "std::forward_iterator_tag",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__120forward_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1239"
    }
   ],
   "linker_set_key" : "std::bidirectional_iterator_tag",
   "name" : "std::bidirectional_iterator_tag",
   "referenced_type" : "type-1240",
   "self_type" : "type-1240",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__126bidirectional_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1240"
    }
   ],
   "linker_set_key" : "std::random_access_iterator_tag",
   "name" : "std::random_access_iterator_tag",
   "referenced_type" : "type-1241",
   "self_type" : "type-1241",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__126random_access_iterator_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "name" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "referenced_type" : "type-1242",
   "self_type" : "type-1242",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-1238", "type-12", "type-12", "type-12", "type-12" ],
   "unique_id" : "_ZTSNSt3__18iteratorINS_19output_iterator_tagEvvvvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<long, true>",
   "name" : "std::__libcpp_numeric_limits<long, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1247",
   "self_type" : "type-1247",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<int, true>",
   "name" : "std::__libcpp_numeric_limits<int, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1248",
   "self_type" : "type-1248",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<short, true>",
   "name" : "std::__libcpp_numeric_limits<short, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1249",
   "self_type" : "type-1249",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_compute_min<long, 63, true>",
   "name" : "std::__libcpp_compute_min<long, 63, true>",
   "referenced_type" : "type-1250",
   "self_type" : "type-1250",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_compute_minIlLi63ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<bool, true>",
   "name" : "std::__libcpp_numeric_limits<bool, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1251",
   "self_type" : "type-1251",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<float, true>",
   "name" : "std::__libcpp_numeric_limits<float, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1252",
   "self_type" : "type-1252",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIfLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<double, true>",
   "name" : "std::__libcpp_numeric_limits<double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1253",
   "self_type" : "type-1253",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIdLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<long double, true>",
   "name" : "std::__libcpp_numeric_limits<long double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1254",
   "self_type" : "type-1254",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIgLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1247"
    }
   ],
   "linker_set_key" : "std::numeric_limits<long>",
   "name" : "std::numeric_limits<long>",
   "record_kind" : "class",
   "referenced_type" : "type-1255",
   "self_type" : "type-1255",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1248"
    }
   ],
   "linker_set_key" : "std::numeric_limits<int>",
   "name" : "std::numeric_limits<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1256",
   "self_type" : "type-1256",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1249"
    }
   ],
   "linker_set_key" : "std::numeric_limits<short>",
   "name" : "std::numeric_limits<short>",
   "record_kind" : "class",
   "referenced_type" : "type-1257",
   "self_type" : "type-1257",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::tuple<>",
   "name" : "std::tuple<>",
   "record_kind" : "class",
   "referenced_type" : "type-1258",
   "self_type" : "type-1258",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__15tupleIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__ignore_t<unsigned char>",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "type-1261",
   "self_type" : "type-1261",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSNSt3__110__ignore_tIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_equal<0>",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "type-1263",
   "self_type" : "type-1263",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_equalILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_less<0>",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "type-1264",
   "self_type" : "type-1264",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__112__tuple_lessILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_cat_return<>",
   "name" : "std::__tuple_cat_return<>",
   "referenced_type" : "type-1265",
   "self_type" : "type-1265",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__118__tuple_cat_returnIJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "std::__libcpp_refstring",
   "name" : "std::__libcpp_refstring",
   "record_kind" : "class",
   "referenced_type" : "type-1266",
   "self_type" : "type-1266",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSNSt3__118__libcpp_refstringE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-945"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 64,
     "referenced_type" : "type-1266"
    }
   ],
   "linker_set_key" : "std::logic_error",
   "name" : "std::logic_error",
   "record_kind" : "class",
   "referenced_type" : "type-1269",
   "self_type" : "type-1269",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11logic_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11logic_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-945"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 64,
     "referenced_type" : "type-1266"
    }
   ],
   "linker_set_key" : "std::runtime_error",
   "name" : "std::runtime_error",
   "record_kind" : "class",
   "referenced_type" : "type-1270",
   "self_type" : "type-1270",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt13runtime_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13runtime_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1269"
    }
   ],
   "linker_set_key" : "std::domain_error",
   "name" : "std::domain_error",
   "record_kind" : "class",
   "referenced_type" : "type-1271",
   "self_type" : "type-1271",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12domain_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12domain_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1269"
    }
   ],
   "linker_set_key" : "std::invalid_argument",
   "name" : "std::invalid_argument",
   "record_kind" : "class",
   "referenced_type" : "type-1276",
   "self_type" : "type-1276",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt16invalid_argument",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16invalid_argument"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1269"
    }
   ],
   "linker_set_key" : "std::length_error",
   "name" : "std::length_error",
   "record_kind" : "class",
   "referenced_type" : "type-1278",
   "self_type" : "type-1278",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12length_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12length_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1269"
    }
   ],
   "linker_set_key" : "std::out_of_range",
   "name" : "std::out_of_range",
   "record_kind" : "class",
   "referenced_type" : "type-1280",
   "self_type" : "type-1280",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12out_of_range",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12out_of_range"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1270"
    }
   ],
   "linker_set_key" : "std::range_error",
   "name" : "std::range_error",
   "record_kind" : "class",
   "referenced_type" : "type-1282",
   "self_type" : "type-1282",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11range_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11range_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1270"
    }
   ],
   "linker_set_key" : "std::overflow_error",
   "name" : "std::overflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1284",
   "self_type" : "type-1284",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt14overflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt14overflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1270"
    }
   ],
   "linker_set_key" : "std::underflow_error",
   "name" : "std::underflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1286",
   "self_type" : "type-1286",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt15underflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt15underflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-1295"
    }
   ],
   "linker_set_key" : "std::atomic_flag",
   "name" : "std::atomic_flag",
   "referenced_type" : "type-1294",
   "self_type" : "type-1294",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic",
   "unique_id" : "_ZTSNSt3__111atomic_flagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<void>",
   "name" : "std::allocator<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1299",
   "self_type" : "type-1299",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__19allocatorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<const void>",
   "name" : "std::allocator<const void>",
   "record_kind" : "class",
   "referenced_type" : "type-1300",
   "self_type" : "type-1300",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-569" ],
   "unique_id" : "_ZTSNSt3__19allocatorIKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__second_tag",
   "name" : "std::__second_tag",
   "referenced_type" : "type-1301",
   "self_type" : "type-1301",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__second_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::__destruct_n",
   "name" : "std::__destruct_n",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__destruct_nE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-945"
    }
   ],
   "linker_set_key" : "std::bad_weak_ptr",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-1305",
   "self_type" : "type-1305",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112bad_weak_ptrE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "std::__shared_count",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "type-1306",
   "self_type" : "type-1306",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114__shared_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1306"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__shared_weak_owners_",
     "field_offset" : 128,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "std::__shared_weak_count",
   "name" : "std::__shared_weak_count",
   "record_kind" : "class",
   "referenced_type" : "type-1310",
   "self_type" : "type-1310",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__119__shared_weak_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__119__shared_weak_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__119__shared_weak_count21__on_zero_shared_weakEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "name" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "record_kind" : "class",
   "referenced_type" : "type-1314",
   "self_type" : "type-1314",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-1315" ],
   "unique_id" : "_ZTSNSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::owner_less<void>",
   "name" : "std::owner_less<void>",
   "referenced_type" : "type-1316",
   "self_type" : "type-1316",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__110owner_lessIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__lx",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "std::__sp_mut",
   "name" : "std::__sp_mut",
   "record_kind" : "class",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__18__sp_mutE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "type-1319"
    }
   ],
   "linker_set_key" : "std::pointer_safety",
   "name" : "std::pointer_safety",
   "referenced_type" : "type-1318",
   "self_type" : "type-1318",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114pointer_safetyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::plus<void>",
   "name" : "std::plus<void>",
   "referenced_type" : "type-1323",
   "self_type" : "type-1323",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__14plusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::minus<void>",
   "name" : "std::minus<void>",
   "referenced_type" : "type-1324",
   "self_type" : "type-1324",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__15minusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::multiplies<void>",
   "name" : "std::multiplies<void>",
   "referenced_type" : "type-1325",
   "self_type" : "type-1325",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__110multipliesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::divides<void>",
   "name" : "std::divides<void>",
   "referenced_type" : "type-1326",
   "self_type" : "type-1326",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__17dividesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::modulus<void>",
   "name" : "std::modulus<void>",
   "referenced_type" : "type-1327",
   "self_type" : "type-1327",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__17modulusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::negate<void>",
   "name" : "std::negate<void>",
   "referenced_type" : "type-1328",
   "self_type" : "type-1328",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__16negateIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::equal_to<void>",
   "name" : "std::equal_to<void>",
   "referenced_type" : "type-1329",
   "self_type" : "type-1329",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__18equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::not_equal_to<void>",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "type-1330",
   "self_type" : "type-1330",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__112not_equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater<void>",
   "name" : "std::greater<void>",
   "referenced_type" : "type-1331",
   "self_type" : "type-1331",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__17greaterIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater_equal<void>",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "type-1332",
   "self_type" : "type-1332",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113greater_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less_equal<void>",
   "name" : "std::less_equal<void>",
   "referenced_type" : "type-1333",
   "self_type" : "type-1333",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__110less_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_and<void>",
   "name" : "std::logical_and<void>",
   "referenced_type" : "type-1334",
   "self_type" : "type-1334",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__111logical_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_or<void>",
   "name" : "std::logical_or<void>",
   "referenced_type" : "type-1335",
   "self_type" : "type-1335",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__110logical_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_not<void>",
   "name" : "std::logical_not<void>",
   "referenced_type" : "type-1336",
   "self_type" : "type-1336",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__111logical_notIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_and<void>",
   "name" : "std::bit_and<void>",
   "referenced_type" : "type-1337",
   "self_type" : "type-1337",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__17bit_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_or<void>",
   "name" : "std::bit_or<void>",
   "referenced_type" : "type-1338",
   "self_type" : "type-1338",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__16bit_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_xor<void>",
   "name" : "std::bit_xor<void>",
   "referenced_type" : "type-1339",
   "self_type" : "type-1339",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__17bit_xorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_not<void>",
   "name" : "std::bit_not<void>",
   "referenced_type" : "type-1340",
   "self_type" : "type-1340",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__17bit_notIvEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-945"
    }
   ],
   "linker_set_key" : "std::bad_function_call",
   "name" : "std::bad_function_call",
   "record_kind" : "class",
   "referenced_type" : "type-1341",
   "self_type" : "type-1341",
   "size" : 8,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__117bad_function_callE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__117bad_function_callE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<1>",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "type-1342",
   "self_type" : "type-1342",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<2>",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "type-1343",
   "self_type" : "type-1343",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<3>",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "type-1344",
   "self_type" : "type-1344",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi3EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<4>",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "type-1345",
   "self_type" : "type-1345",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<5>",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "type-1346",
   "self_type" : "type-1346",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi5EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<6>",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "type-1347",
   "self_type" : "type-1347",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi6EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<7>",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "type-1348",
   "self_type" : "type-1348",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi7EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<8>",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "type-1349",
   "self_type" : "type-1349",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<9>",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "type-1350",
   "self_type" : "type-1350",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi9EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<10>",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "type-1351",
   "self_type" : "type-1351",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi10EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__less<unsigned long, unsigned long>",
   "name" : "std::__less<unsigned long, unsigned long>",
   "referenced_type" : "type-1362",
   "self_type" : "type-1362",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-570", "type-570" ],
   "unique_id" : "_ZTSNSt3__16__lessImmEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__p_",
     "referenced_type" : "type-1370"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<long>",
   "name" : "std::uniform_int_distribution<long>",
   "record_kind" : "class",
   "referenced_type" : "type-1369",
   "self_type" : "type-1369",
   "size" : 16,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIlEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__a_",
     "referenced_type" : "type-81"
    },
    {
     "access" : "private",
     "field_name" : "__b_",
     "field_offset" : 64,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<long>::param_type",
   "name" : "std::uniform_int_distribution<long>::param_type",
   "record_kind" : "class",
   "referenced_type" : "type-1370",
   "self_type" : "type-1370",
   "size" : 16,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIlE10param_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__return_temporary_buffer",
   "name" : "std::__return_temporary_buffer",
   "referenced_type" : "type-1371",
   "self_type" : "type-1371",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__125__return_temporary_bufferE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<>",
   "name" : "skstd::index_sequence<>",
   "referenced_type" : "type-1372",
   "self_type" : "type-1372",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<0>",
   "name" : "skstd::index_sequence<0>",
   "referenced_type" : "type-1373",
   "self_type" : "type-1373",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJLm0EEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1372"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<0>",
   "name" : "skstd::make_index_sequence<0>",
   "referenced_type" : "type-1374",
   "self_type" : "type-1374",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILm0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1373"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<1>",
   "name" : "skstd::make_index_sequence<1>",
   "referenced_type" : "type-1375",
   "self_type" : "type-1375",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "name" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "referenced_type" : "type-1376",
   "self_type" : "type-1376",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-614", "type-1377", "type-1378", "type-1379" ],
   "unique_id" : "_ZTSN9sktfitsin7Private6SkTMuxILb1ELb1ENS0_23SkTFitsIn_Signed2SignedIsiEENS0_25SkTFitsIn_Signed2UnsignedIsiEENS0_25SkTFitsIn_Unsigned2SignedIsiEENS0_26SkTFitsIn_Unsigned2UnsigedIsiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "referenced_type" : "type-1380",
   "self_type" : "type-1380",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-80", "type-15" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIsiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "referenced_type" : "type-1381",
   "self_type" : "type-1381",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-15", "type-80" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIisEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "name" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "referenced_type" : "type-1382",
   "self_type" : "type-1382",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-80", "type-15" ],
   "unique_id" : "_ZTSN9sktfitsin7Private9SkTFitsInIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<int, false>",
   "name" : "sktfitsin::Private::underlying_type<int, false>",
   "referenced_type" : "type-1383",
   "self_type" : "type-1383",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIiLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<short, false>",
   "name" : "sktfitsin::Private::underlying_type<short, false>",
   "referenced_type" : "type-1384",
   "self_type" : "type-1384",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIsLb0EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fFloat",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fSignBitInt",
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "SkFloatIntUnion",
   "name" : "SkFloatIntUnion",
   "record_kind" : "union",
   "referenced_type" : "type-1393",
   "self_type" : "type-1393",
   "size" : 4,
   "source_file" : "/external/skia/include/private/SkFloatBits.h",
   "unique_id" : "_ZTS15SkFloatIntUnion"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "SkColor4f",
   "name" : "SkColor4f",
   "referenced_type" : "type-1395",
   "self_type" : "type-1395",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColor.h",
   "unique_id" : "_ZTS9SkColor4f"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fY",
     "field_offset" : 16,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkIPoint16",
   "name" : "SkIPoint16",
   "referenced_type" : "type-1400",
   "self_type" : "type-1400",
   "size" : 4,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS10SkIPoint16"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "SkIPoint",
   "name" : "SkIPoint",
   "referenced_type" : "type-1404",
   "self_type" : "type-1404",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS8SkIPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "SkPoint",
   "name" : "SkPoint",
   "referenced_type" : "type-1409",
   "self_type" : "type-1409",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS7SkPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "SkISize",
   "name" : "SkISize",
   "referenced_type" : "type-1415",
   "self_type" : "type-1415",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS7SkISize"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "SkSize",
   "name" : "SkSize",
   "referenced_type" : "type-1419",
   "self_type" : "type-1419",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS6SkSize"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    }
   ],
   "linker_set_key" : "SkIRect",
   "name" : "SkIRect",
   "referenced_type" : "type-1425",
   "self_type" : "type-1425",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS7SkIRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "SkRect",
   "name" : "SkRect",
   "referenced_type" : "type-1431",
   "self_type" : "type-1431",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS6SkRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-1437"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 288,
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "SkMatrix",
   "name" : "SkMatrix",
   "record_kind" : "class",
   "referenced_type" : "type-1436",
   "self_type" : "type-1436",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkMatrix.h",
   "unique_id" : "_ZTS8SkMatrix"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fData",
     "referenced_type" : "type-1453"
    }
   ],
   "linker_set_key" : "SkVector4",
   "name" : "SkVector4",
   "referenced_type" : "type-1452",
   "self_type" : "type-1452",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS9SkVector4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-1459"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 512,
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "SkMatrix44",
   "name" : "SkMatrix44",
   "record_kind" : "class",
   "referenced_type" : "type-1458",
   "self_type" : "type-1458",
   "size" : 68,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS10SkMatrix44"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jclass"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jobject"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "type-340",
   "self_type" : "type-340",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jstring"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "type-359",
   "self_type" : "type-359",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jarray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "type-363",
   "self_type" : "type-363",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jobjectArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "type-371",
   "self_type" : "type-371",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14_jbooleanArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "type-375",
   "self_type" : "type-375",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jbyteArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jcharArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "type-383",
   "self_type" : "type-383",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jshortArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS10_jintArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jlongArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "type-395",
   "self_type" : "type-395",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jfloatArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-359"
    }
   ],
   "linker_set_key" : "_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jdoubleArray"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "type-487",
   "self_type" : "type-487",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS15JNINativeMethod"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jthrowable"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-497"
    }
   ],
   "linker_set_key" : "_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JavaVM"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 192,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 256,
     "referenced_type" : "type-502"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 320,
     "referenced_type" : "type-500"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 384,
     "referenced_type" : "type-505"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 448,
     "referenced_type" : "type-502"
    }
   ],
   "linker_set_key" : "JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "type-499",
   "self_type" : "type-499",
   "size" : 64,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNIInvokeInterface"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-532"
    }
   ],
   "linker_set_key" : "sk_sp<SkPixelRef>",
   "name" : "sk_sp<SkPixelRef>",
   "record_kind" : "class",
   "referenced_type" : "type-531",
   "self_type" : "type-531",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-534" ],
   "unique_id" : "_ZTS5sk_spI10SkPixelRefE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fRX",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fRY",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fGX",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fGY",
     "field_offset" : 96,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fBX",
     "field_offset" : 128,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fBY",
     "field_offset" : 160,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fWX",
     "field_offset" : 192,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fWY",
     "field_offset" : 224,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "SkColorSpacePrimaries",
   "name" : "SkColorSpacePrimaries",
   "referenced_type" : "type-536",
   "self_type" : "type-536",
   "size" : 32,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS21SkColorSpacePrimaries"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fG",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fA",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fC",
     "field_offset" : 96,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fD",
     "field_offset" : 128,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fE",
     "field_offset" : 160,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "fF",
     "field_offset" : 192,
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "SkColorSpaceTransferFn",
   "name" : "SkColorSpaceTransferFn",
   "referenced_type" : "type-537",
   "self_type" : "type-537",
   "size" : 28,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS22SkColorSpaceTransferFn"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "SkColorSpace",
   "name" : "SkColorSpace",
   "record_kind" : "class",
   "referenced_type" : "type-543",
   "self_type" : "type-543",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS12SkColorSpace",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkColorSpace"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkColorSpaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkColorSpaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace15makeLinearGammaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace13makeSRGBGammaEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace13makeColorSpinEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace10onToXYZD50Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace14onToXYZD50HashEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace12onFromXYZD50Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace12onGammaNamedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace18onGammaCloseToSRGBEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace15onGammaIsLinearEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace23onIsNumericalTransferFnEP22SkColorSpaceTransferFn"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace8onIsCMYKEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace13onProfileDataEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-545"
    }
   ],
   "linker_set_key" : "SkRefCnt",
   "name" : "SkRefCnt",
   "record_kind" : "class",
   "referenced_type" : "type-544",
   "self_type" : "type-544",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS8SkRefCnt",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkRefCnt"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-550"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "field_offset" : 64,
     "referenced_type" : "type-546"
    }
   ],
   "linker_set_key" : "SkRefCntBase",
   "name" : "SkRefCntBase",
   "record_kind" : "class",
   "referenced_type" : "type-545",
   "self_type" : "type-545",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS12SkRefCntBase",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkRefCntBase"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-547"
    }
   ],
   "linker_set_key" : "std::atomic<int>",
   "name" : "std::atomic<int>",
   "referenced_type" : "type-546",
   "self_type" : "type-546",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__16atomicIiEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-548"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, true>",
   "name" : "std::__atomic_base<int, true>",
   "referenced_type" : "type-547",
   "self_type" : "type-547",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-549"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, false>",
   "name" : "std::__atomic_base<int, false>",
   "referenced_type" : "type-548",
   "self_type" : "type-548",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "SkNoncopyable",
   "name" : "SkNoncopyable",
   "record_kind" : "class",
   "referenced_type" : "type-550",
   "self_type" : "type-550",
   "size" : 1,
   "source_file" : "/external/skia/include/core/SkTypes.h",
   "unique_id" : "_ZTS13SkNoncopyable"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fColorSpace",
     "referenced_type" : "type-560"
    },
    {
     "access" : "private",
     "field_name" : "fWidth",
     "field_offset" : 64,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "fHeight",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "fColorType",
     "field_offset" : 128,
     "referenced_type" : "type-557"
    },
    {
     "access" : "private",
     "field_name" : "fAlphaType",
     "field_offset" : 160,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "SkImageInfo",
   "name" : "SkImageInfo",
   "referenced_type" : "type-559",
   "self_type" : "type-559",
   "size" : 24,
   "source_file" : "/external/skia/include/core/SkImageInfo.h",
   "unique_id" : "_ZTS11SkImageInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "sk_sp<SkColorSpace>",
   "name" : "sk_sp<SkColorSpace>",
   "record_kind" : "class",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-543" ],
   "unique_id" : "_ZTS5sk_spI12SkColorSpaceE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixels",
     "referenced_type" : "type-568"
    },
    {
     "access" : "private",
     "field_name" : "fRowBytes",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    },
    {
     "access" : "private",
     "field_name" : "fInfo",
     "field_offset" : 128,
     "referenced_type" : "type-559"
    }
   ],
   "linker_set_key" : "SkPixmap",
   "name" : "SkPixmap",
   "record_kind" : "class",
   "referenced_type" : "type-567",
   "self_type" : "type-567",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkPixmap.h",
   "unique_id" : "_ZTS8SkPixmap"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixelRef",
     "referenced_type" : "type-531"
    },
    {
     "access" : "private",
     "field_name" : "fPixmap",
     "field_offset" : 64,
     "referenced_type" : "type-567"
    },
    {
     "access" : "private",
     "field_name" : "fFlags",
     "field_offset" : 384,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "SkBitmap",
   "name" : "SkBitmap",
   "record_kind" : "class",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 56,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTS8SkBitmap"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-544"
    }
   ],
   "linker_set_key" : "SkBitmap::Allocator",
   "name" : "SkBitmap::Allocator",
   "record_kind" : "class",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap9AllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap9AllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkBitmap9Allocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-587"
    }
   ],
   "linker_set_key" : "SkBitmap::HeapAllocator",
   "name" : "SkBitmap::HeapAllocator",
   "record_kind" : "class",
   "referenced_type" : "type-592",
   "self_type" : "type-592",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap13HeapAllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap13HeapAllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "group",
     "field_offset" : 128,
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "type-595",
   "self_type" : "type-595",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS16JavaVMAttachArgs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "type-596",
   "self_type" : "type-596",
   "size" : 16,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12JavaVMOption"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "type-598"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 128,
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "type-597",
   "self_type" : "type-597",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14JavaVMInitArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-528"
    }
   ],
   "linker_set_key" : "AndroidBitmapInfo",
   "name" : "AndroidBitmapInfo",
   "referenced_type" : "type-600",
   "self_type" : "type-600",
   "size" : 20,
   "source_file" : "/frameworks/native/include/android/bitmap.h",
   "unique_id" : "AndroidBitmapInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-570"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "std::pair<unsigned long, unsigned long>",
   "name" : "std::pair<unsigned long, unsigned long>",
   "referenced_type" : "type-604",
   "self_type" : "type-604",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-570", "type-570" ],
   "unique_id" : "_ZTSNSt3__14pairImmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::pair<unsigned long, unsigned long>::_CheckArgs",
   "name" : "std::pair<unsigned long, unsigned long>::_CheckArgs",
   "referenced_type" : "type-609",
   "self_type" : "type-609",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__14pairImmE10_CheckArgsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int> >",
   "referenced_type" : "type-613",
   "self_type" : "type-613",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-614", "type-615" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1EN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEENS2_25SkTFitsIn_Signed2UnsignedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>",
   "name" : "sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-80", "type-15" ],
   "unique_id" : "_ZTSN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "referenced_type" : "type-616",
   "self_type" : "type-616",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-617", "type-618" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1EN9sktfitsin7Private25SkTFitsIn_Unsigned2SignedIsiEENS2_26SkTFitsIn_Unsigned2UnsigedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int> >",
   "referenced_type" : "type-619",
   "self_type" : "type-619",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-614", "type-620" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1EN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEENS2_25SkTFitsIn_Unsigned2SignedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<false, sktfitsin::Private::SkTInRange_True<int>, sktfitsin::Private::SkTInRange_Cast<short, int> >",
   "name" : "std::conditional<false, sktfitsin::Private::SkTInRange_True<int>, sktfitsin::Private::SkTInRange_Cast<short, int> >",
   "referenced_type" : "type-621",
   "self_type" : "type-621",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-622", "type-623" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb0EN9sktfitsin7Private15SkTInRange_TrueIiEENS2_15SkTInRange_CastIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTInRange_Cast<short, int>",
   "name" : "sktfitsin::Private::SkTInRange_Cast<short, int>",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-80", "type-15" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15SkTInRange_CastIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, std::pair<unsigned long, unsigned long>, std::__nat>",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>, std::__nat>",
   "referenced_type" : "type-624",
   "self_type" : "type-624",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604", "type-625" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__nat",
   "name" : "std::__nat",
   "referenced_type" : "type-625",
   "self_type" : "type-625",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__natE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<false, std::pair<unsigned long, unsigned long> *, std::pair<unsigned long, unsigned long> >",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long> *, std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-626",
   "self_type" : "type-626",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-605", "type-604" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb0EPNS_4pairImmEES2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<false, std::pair<unsigned long, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "referenced_type" : "type-627",
   "self_type" : "type-627",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-628", "type-629" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__check_tuple_constructor_fail",
   "name" : "std::__check_tuple_constructor_fail",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__130__check_tuple_constructor_failE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, std::pair<unsigned long, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "referenced_type" : "type-630",
   "self_type" : "type-630",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-609", "type-629" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, double>",
   "name" : "std::enable_if<false, double>",
   "referenced_type" : "type-631",
   "self_type" : "type-631",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0EdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, int>",
   "name" : "std::enable_if<false, int>",
   "referenced_type" : "type-632",
   "self_type" : "type-632",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0EiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, long long>",
   "name" : "std::enable_if<false, long long>",
   "referenced_type" : "type-633",
   "self_type" : "type-633",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0ExEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, long>",
   "name" : "std::enable_if<false, long>",
   "referenced_type" : "type-634",
   "self_type" : "type-634",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0ElEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<true, void>",
   "name" : "std::enable_if<true, void>",
   "referenced_type" : "type-635",
   "self_type" : "type-635",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb1EvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<false, bool>",
   "name" : "std::enable_if<false, bool>",
   "referenced_type" : "type-636",
   "self_type" : "type-636",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb0EbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::enable_if<true, bool>",
   "name" : "std::enable_if<true, bool>",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__19enable_ifILb1EbEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-640"
    }
   ],
   "linker_set_key" : "std::__two",
   "name" : "std::__two",
   "referenced_type" : "type-639",
   "self_type" : "type-639",
   "size" : 2,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__twoE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned long, 0>",
   "name" : "std::integral_constant<unsigned long, 0>",
   "referenced_type" : "type-642",
   "self_type" : "type-642",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__117integral_constantImLm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned long, 2>",
   "name" : "std::integral_constant<unsigned long, 2>",
   "referenced_type" : "type-643",
   "self_type" : "type-643",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__117integral_constantImLm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 0>",
   "name" : "std::integral_constant<int, 0>",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 1>",
   "name" : "std::integral_constant<int, 1>",
   "referenced_type" : "type-645",
   "self_type" : "type-645",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<int, 2>",
   "name" : "std::integral_constant<int, 2>",
   "referenced_type" : "type-646",
   "self_type" : "type-646",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIiLi2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned long, 1>",
   "name" : "std::integral_constant<unsigned long, 1>",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__117integral_constantImLm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned long, 4>",
   "name" : "std::integral_constant<unsigned long, 4>",
   "referenced_type" : "type-648",
   "self_type" : "type-648",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__117integral_constantImLm4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned long, 8>",
   "name" : "std::integral_constant<unsigned long, 8>",
   "referenced_type" : "type-649",
   "self_type" : "type-649",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__117integral_constantImLm8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<unsigned long, 16>",
   "name" : "std::integral_constant<unsigned long, 16>",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__117integral_constantImLm16EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__lazy_and_impl<true>",
   "name" : "std::__lazy_and_impl<true>",
   "referenced_type" : "type-651",
   "self_type" : "type-651",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115__lazy_and_implILb1EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<bool, true>",
   "name" : "std::integral_constant<bool, true>",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIbLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__lazy_or_impl<false>",
   "name" : "std::__lazy_or_impl<false>",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__lazy_or_implILb0EJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::integral_constant<bool, false>",
   "name" : "std::integral_constant<bool, false>",
   "referenced_type" : "type-654",
   "self_type" : "type-654",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__117integral_constantIbLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__and_<>",
   "name" : "std::__and_<>",
   "referenced_type" : "type-655",
   "self_type" : "type-655",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__16__and_IJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__or_<>",
   "name" : "std::__or_<>",
   "referenced_type" : "type-656",
   "self_type" : "type-656",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__or_IJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_const<unsigned long>",
   "name" : "std::is_const<unsigned long>",
   "referenced_type" : "type-657",
   "self_type" : "type-657",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__18is_constImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<long>",
   "name" : "std::remove_const<long>",
   "referenced_type" : "type-658",
   "self_type" : "type-658",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__112remove_constIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<double>",
   "name" : "std::remove_const<double>",
   "referenced_type" : "type-659",
   "self_type" : "type-659",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__112remove_constIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<float>",
   "name" : "std::remove_const<float>",
   "referenced_type" : "type-660",
   "self_type" : "type-660",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__112remove_constIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<int>",
   "name" : "std::remove_const<int>",
   "referenced_type" : "type-661",
   "self_type" : "type-661",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__112remove_constIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<short>",
   "name" : "std::remove_const<short>",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__112remove_constIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<unsigned long>",
   "name" : "std::remove_const<unsigned long>",
   "referenced_type" : "type-663",
   "self_type" : "type-663",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__112remove_constImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<unsigned long &>",
   "name" : "std::remove_const<unsigned long &>",
   "referenced_type" : "type-664",
   "self_type" : "type-664",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-665" ],
   "unique_id" : "_ZTSNSt3__112remove_constIRmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<const unsigned long &>",
   "name" : "std::remove_const<const unsigned long &>",
   "referenced_type" : "type-666",
   "self_type" : "type-666",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__112remove_constIRKmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<unsigned long &&>",
   "name" : "std::remove_const<unsigned long &&>",
   "referenced_type" : "type-667",
   "self_type" : "type-667",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-611" ],
   "unique_id" : "_ZTSNSt3__112remove_constIOmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<std::pair<unsigned long, unsigned long> >",
   "name" : "std::remove_const<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-668",
   "self_type" : "type-668",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__112remove_constINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<long>",
   "name" : "std::remove_volatile<long>",
   "referenced_type" : "type-669",
   "self_type" : "type-669",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<double>",
   "name" : "std::remove_volatile<double>",
   "referenced_type" : "type-670",
   "self_type" : "type-670",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<float>",
   "name" : "std::remove_volatile<float>",
   "referenced_type" : "type-671",
   "self_type" : "type-671",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<int>",
   "name" : "std::remove_volatile<int>",
   "referenced_type" : "type-672",
   "self_type" : "type-672",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<short>",
   "name" : "std::remove_volatile<short>",
   "referenced_type" : "type-673",
   "self_type" : "type-673",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<unsigned long>",
   "name" : "std::remove_volatile<unsigned long>",
   "referenced_type" : "type-674",
   "self_type" : "type-674",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<unsigned long &>",
   "name" : "std::remove_volatile<unsigned long &>",
   "referenced_type" : "type-675",
   "self_type" : "type-675",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-665" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIRmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<const unsigned long &>",
   "name" : "std::remove_volatile<const unsigned long &>",
   "referenced_type" : "type-676",
   "self_type" : "type-676",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIRKmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<unsigned long &&>",
   "name" : "std::remove_volatile<unsigned long &&>",
   "referenced_type" : "type-677",
   "self_type" : "type-677",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-611" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIOmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<std::pair<unsigned long, unsigned long> >",
   "name" : "std::remove_volatile<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-678",
   "self_type" : "type-678",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<long>",
   "name" : "std::remove_cv<long>",
   "referenced_type" : "type-679",
   "self_type" : "type-679",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<double>",
   "name" : "std::remove_cv<double>",
   "referenced_type" : "type-680",
   "self_type" : "type-680",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<float>",
   "name" : "std::remove_cv<float>",
   "referenced_type" : "type-681",
   "self_type" : "type-681",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<int>",
   "name" : "std::remove_cv<int>",
   "referenced_type" : "type-682",
   "self_type" : "type-682",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<short>",
   "name" : "std::remove_cv<short>",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<unsigned long>",
   "name" : "std::remove_cv<unsigned long>",
   "referenced_type" : "type-684",
   "self_type" : "type-684",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__19remove_cvImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<unsigned long &>",
   "name" : "std::remove_cv<unsigned long &>",
   "referenced_type" : "type-685",
   "self_type" : "type-685",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-665" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIRmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<const unsigned long &>",
   "name" : "std::remove_cv<const unsigned long &>",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIRKmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<unsigned long &&>",
   "name" : "std::remove_cv<unsigned long &&>",
   "referenced_type" : "type-687",
   "self_type" : "type-687",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-611" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIOmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<std::pair<unsigned long, unsigned long> >",
   "name" : "std::remove_cv<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-688",
   "self_type" : "type-688",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__19remove_cvINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<unsigned long>",
   "name" : "std::__libcpp_is_void<unsigned long>",
   "referenced_type" : "type-689",
   "self_type" : "type-689",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<unsigned long &>",
   "name" : "std::__libcpp_is_void<unsigned long &>",
   "referenced_type" : "type-690",
   "self_type" : "type-690",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-665" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidIRmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<const unsigned long &>",
   "name" : "std::__libcpp_is_void<const unsigned long &>",
   "referenced_type" : "type-691",
   "self_type" : "type-691",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidIRKmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<unsigned long &&>",
   "name" : "std::__libcpp_is_void<unsigned long &&>",
   "referenced_type" : "type-692",
   "self_type" : "type-692",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-611" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidIOmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__libcpp_is_void<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-693",
   "self_type" : "type-693",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_void<void>",
   "name" : "std::__libcpp_is_void<void>",
   "referenced_type" : "type-694",
   "self_type" : "type-694",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__116__libcpp_is_voidIvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-689"
    }
   ],
   "linker_set_key" : "std::is_void<unsigned long>",
   "name" : "std::is_void<unsigned long>",
   "referenced_type" : "type-695",
   "self_type" : "type-695",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__17is_voidImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-690"
    }
   ],
   "linker_set_key" : "std::is_void<unsigned long &>",
   "name" : "std::is_void<unsigned long &>",
   "referenced_type" : "type-696",
   "self_type" : "type-696",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-665" ],
   "unique_id" : "_ZTSNSt3__17is_voidIRmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-691"
    }
   ],
   "linker_set_key" : "std::is_void<const unsigned long &>",
   "name" : "std::is_void<const unsigned long &>",
   "referenced_type" : "type-697",
   "self_type" : "type-697",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610" ],
   "unique_id" : "_ZTSNSt3__17is_voidIRKmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-692"
    }
   ],
   "linker_set_key" : "std::is_void<unsigned long &&>",
   "name" : "std::is_void<unsigned long &&>",
   "referenced_type" : "type-698",
   "self_type" : "type-698",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-611" ],
   "unique_id" : "_ZTSNSt3__17is_voidIOmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-693"
    }
   ],
   "linker_set_key" : "std::is_void<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_void<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-699",
   "self_type" : "type-699",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__17is_voidINS_4pairImmEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JNIEnv"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<unsigned long>",
   "name" : "std::__is_nullptr_t_impl<unsigned long>",
   "referenced_type" : "type-700",
   "self_type" : "type-700",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__is_nullptr_t_impl<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-701",
   "self_type" : "type-701",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t_impl<nullptr_t>",
   "name" : "std::__is_nullptr_t_impl<nullptr_t>",
   "referenced_type" : "type-702",
   "self_type" : "type-702",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-703" ],
   "unique_id" : "_ZTSNSt3__119__is_nullptr_t_implIDnEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-700"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<unsigned long>",
   "name" : "std::__is_nullptr_t<unsigned long>",
   "referenced_type" : "type-704",
   "self_type" : "type-704",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-701"
    }
   ],
   "linker_set_key" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-705",
   "self_type" : "type-705",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__114__is_nullptr_tINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<double>",
   "name" : "std::__libcpp_is_integral<double>",
   "referenced_type" : "type-706",
   "self_type" : "type-706",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<float>",
   "name" : "std::__libcpp_is_integral<float>",
   "referenced_type" : "type-707",
   "self_type" : "type-707",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<bool>",
   "name" : "std::__libcpp_is_integral<bool>",
   "referenced_type" : "type-708",
   "self_type" : "type-708",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char>",
   "name" : "std::__libcpp_is_integral<char>",
   "referenced_type" : "type-709",
   "self_type" : "type-709",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-23" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<signed char>",
   "name" : "std::__libcpp_is_integral<signed char>",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-27" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIaEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned char>",
   "name" : "std::__libcpp_is_integral<unsigned char>",
   "referenced_type" : "type-711",
   "self_type" : "type-711",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<wchar_t>",
   "name" : "std::__libcpp_is_integral<wchar_t>",
   "referenced_type" : "type-712",
   "self_type" : "type-712",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char16_t>",
   "name" : "std::__libcpp_is_integral<char16_t>",
   "referenced_type" : "type-714",
   "self_type" : "type-714",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-715" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<char32_t>",
   "name" : "std::__libcpp_is_integral<char32_t>",
   "referenced_type" : "type-716",
   "self_type" : "type-716",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-717" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<short>",
   "name" : "std::__libcpp_is_integral<short>",
   "referenced_type" : "type-718",
   "self_type" : "type-718",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned short>",
   "name" : "std::__libcpp_is_integral<unsigned short>",
   "referenced_type" : "type-719",
   "self_type" : "type-719",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<int>",
   "name" : "std::__libcpp_is_integral<int>",
   "referenced_type" : "type-720",
   "self_type" : "type-720",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned int>",
   "name" : "std::__libcpp_is_integral<unsigned int>",
   "referenced_type" : "type-721",
   "self_type" : "type-721",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-528" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<long>",
   "name" : "std::__libcpp_is_integral<long>",
   "referenced_type" : "type-722",
   "self_type" : "type-722",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned long>",
   "name" : "std::__libcpp_is_integral<unsigned long>",
   "referenced_type" : "type-723",
   "self_type" : "type-723",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<long long>",
   "name" : "std::__libcpp_is_integral<long long>",
   "referenced_type" : "type-724",
   "self_type" : "type-724",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<unsigned long long>",
   "name" : "std::__libcpp_is_integral<unsigned long long>",
   "referenced_type" : "type-725",
   "self_type" : "type-725",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-726" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<__int128_t>",
   "name" : "std::__libcpp_is_integral<__int128_t>",
   "referenced_type" : "type-727",
   "self_type" : "type-727",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-728" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralInEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_integral<__uint128_t>",
   "name" : "std::__libcpp_is_integral<__uint128_t>",
   "referenced_type" : "type-729",
   "self_type" : "type-729",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-730" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_integralIoEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-722"
    }
   ],
   "linker_set_key" : "std::is_integral<long>",
   "name" : "std::is_integral<long>",
   "referenced_type" : "type-731",
   "self_type" : "type-731",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__111is_integralIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-706"
    }
   ],
   "linker_set_key" : "std::is_integral<double>",
   "name" : "std::is_integral<double>",
   "referenced_type" : "type-732",
   "self_type" : "type-732",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__111is_integralIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-707"
    }
   ],
   "linker_set_key" : "std::is_integral<float>",
   "name" : "std::is_integral<float>",
   "referenced_type" : "type-733",
   "self_type" : "type-733",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__111is_integralIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-720"
    }
   ],
   "linker_set_key" : "std::is_integral<int>",
   "name" : "std::is_integral<int>",
   "referenced_type" : "type-734",
   "self_type" : "type-734",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__111is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-718"
    }
   ],
   "linker_set_key" : "std::is_integral<short>",
   "name" : "std::is_integral<short>",
   "referenced_type" : "type-735",
   "self_type" : "type-735",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__111is_integralIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<long>",
   "name" : "std::__libcpp_is_floating_point<long>",
   "referenced_type" : "type-736",
   "self_type" : "type-736",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<int>",
   "name" : "std::__libcpp_is_floating_point<int>",
   "referenced_type" : "type-737",
   "self_type" : "type-737",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<short>",
   "name" : "std::__libcpp_is_floating_point<short>",
   "referenced_type" : "type-738",
   "self_type" : "type-738",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<__fp16>",
   "name" : "std::__libcpp_is_floating_point<__fp16>",
   "referenced_type" : "type-739",
   "self_type" : "type-739",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-740" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<_Float16>",
   "name" : "std::__libcpp_is_floating_point<_Float16>",
   "referenced_type" : "type-741",
   "self_type" : "type-741",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-742" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDF16_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<float>",
   "name" : "std::__libcpp_is_floating_point<float>",
   "referenced_type" : "type-743",
   "self_type" : "type-743",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<double>",
   "name" : "std::__libcpp_is_floating_point<double>",
   "referenced_type" : "type-744",
   "self_type" : "type-744",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<long double>",
   "name" : "std::__libcpp_is_floating_point<long double>",
   "referenced_type" : "type-745",
   "self_type" : "type-745",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIgEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-736"
    }
   ],
   "linker_set_key" : "std::is_floating_point<long>",
   "name" : "std::is_floating_point<long>",
   "referenced_type" : "type-746",
   "self_type" : "type-746",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-737"
    }
   ],
   "linker_set_key" : "std::is_floating_point<int>",
   "name" : "std::is_floating_point<int>",
   "referenced_type" : "type-747",
   "self_type" : "type-747",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-738"
    }
   ],
   "linker_set_key" : "std::is_floating_point<short>",
   "name" : "std::is_floating_point<short>",
   "referenced_type" : "type-748",
   "self_type" : "type-748",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_array<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_array<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-749",
   "self_type" : "type-749",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__18is_arrayINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_reference<unsigned long>",
   "name" : "std::is_reference<unsigned long>",
   "referenced_type" : "type-750",
   "self_type" : "type-750",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__112is_referenceImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_reference<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_reference<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-751",
   "self_type" : "type-751",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__112is_referenceINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_union<unsigned long>",
   "name" : "std::is_union<unsigned long>",
   "referenced_type" : "type-752",
   "self_type" : "type-752",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__18is_unionImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_union<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_union<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__18is_unionINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_class<unsigned long>",
   "name" : "std::is_class<unsigned long>",
   "referenced_type" : "type-754",
   "self_type" : "type-754",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__18is_classImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_class<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_class<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-755",
   "self_type" : "type-755",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__18is_classINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_same<int, bool>",
   "name" : "std::is_same<int, bool>",
   "referenced_type" : "type-756",
   "self_type" : "type-756",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15", "type-637" ],
   "unique_id" : "_ZTSNSt3__17is_sameIibEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_same<unsigned long &, std::__two>",
   "name" : "std::is_same<unsigned long &, std::__two>",
   "referenced_type" : "type-757",
   "self_type" : "type-757",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-665", "type-639" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRmNS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_same<const unsigned long &, std::__two>",
   "name" : "std::is_same<const unsigned long &, std::__two>",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610", "type-639" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRKmNS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_same<std::pair<unsigned long, unsigned long> &, std::__two>",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long> &, std::__two>",
   "referenced_type" : "type-759",
   "self_type" : "type-759",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-612", "type-639" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRNS_4pairImmEENS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_same<std::pair<unsigned long, unsigned long>, void>",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long>, void>",
   "referenced_type" : "type-760",
   "self_type" : "type-760",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604", "type-12" ],
   "unique_id" : "_ZTSNSt3__17is_sameINS_4pairImmEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_same<std::pair<unsigned long, unsigned long>, std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long>, std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-761",
   "self_type" : "type-761",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604", "type-604" ],
   "unique_id" : "_ZTSNSt3__17is_sameINS_4pairImmEES2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_is_function_imp::__dummy_type",
   "name" : "std::__libcpp_is_function_imp::__dummy_type",
   "referenced_type" : "type-762",
   "self_type" : "type-762",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__124__libcpp_is_function_imp12__dummy_typeE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_function<unsigned long, false>",
   "name" : "std::__libcpp_is_function<unsigned long, false>",
   "referenced_type" : "type-763",
   "self_type" : "type-763",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_functionImLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_function<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__libcpp_is_function<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-764",
   "self_type" : "type-764",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-763"
    }
   ],
   "linker_set_key" : "std::is_function<unsigned long>",
   "name" : "std::is_function<unsigned long>",
   "referenced_type" : "type-765",
   "self_type" : "type-765",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__111is_functionImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-764"
    }
   ],
   "linker_set_key" : "std::is_function<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_function<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-766",
   "self_type" : "type-766",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__111is_functionINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_enum<int>",
   "name" : "std::is_enum<int>",
   "referenced_type" : "type-767",
   "self_type" : "type-767",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__17is_enumIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_enum<short>",
   "name" : "std::is_enum<short>",
   "referenced_type" : "type-768",
   "self_type" : "type-768",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__17is_enumIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<long>",
   "name" : "std::is_arithmetic<long>",
   "referenced_type" : "type-769",
   "self_type" : "type-769",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<int>",
   "name" : "std::is_arithmetic<int>",
   "referenced_type" : "type-770",
   "self_type" : "type-770",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<short>",
   "name" : "std::is_arithmetic<short>",
   "referenced_type" : "type-771",
   "self_type" : "type-771",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_scalar<nullptr_t>",
   "name" : "std::is_scalar<nullptr_t>",
   "referenced_type" : "type-772",
   "self_type" : "type-772",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-703" ],
   "unique_id" : "_ZTSNSt3__19is_scalarIDnEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_referenceable_impl",
   "name" : "std::__is_referenceable_impl",
   "referenced_type" : "type-773",
   "self_type" : "type-773",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__is_referenceable_implE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<unsigned long>",
   "name" : "std::__is_referenceable<unsigned long>",
   "referenced_type" : "type-774",
   "self_type" : "type-774",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<const unsigned long>",
   "name" : "std::__is_referenceable<const unsigned long>",
   "referenced_type" : "type-775",
   "self_type" : "type-775",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-577" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableIKmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__is_referenceable<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-776",
   "self_type" : "type-776",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_const<unsigned long, false>",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "type-777",
   "self_type" : "type-777",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__111__add_constImLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_const<unsigned long>",
   "name" : "std::add_const<unsigned long>",
   "referenced_type" : "type-778",
   "self_type" : "type-778",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__19add_constImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<sk_sp<SkColorSpace> &>",
   "name" : "std::remove_reference<sk_sp<SkColorSpace> &>",
   "referenced_type" : "type-779",
   "self_type" : "type-779",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-780" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIR5sk_spI12SkColorSpaceEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "b",
     "referenced_type" : "type-27"
    },
    {
     "field_name" : "c",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "s",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "i",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "j",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "f",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-83"
    },
    {
     "field_name" : "l",
     "referenced_type" : "type-24"
    }
   ],
   "linker_set_key" : "jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS6jvalue"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<std::pair<unsigned long, unsigned long> >",
   "name" : "std::remove_reference<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-781",
   "self_type" : "type-781",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<unsigned long>",
   "name" : "std::remove_reference<unsigned long>",
   "referenced_type" : "type-782",
   "self_type" : "type-782",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<unsigned long &>",
   "name" : "std::remove_reference<unsigned long &>",
   "referenced_type" : "type-783",
   "self_type" : "type-783",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-665" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<int &>",
   "name" : "std::remove_reference<int &>",
   "referenced_type" : "type-784",
   "self_type" : "type-784",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-785" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<float &>",
   "name" : "std::remove_reference<float &>",
   "referenced_type" : "type-786",
   "self_type" : "type-786",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-787" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-788",
   "self_type" : "type-788",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "referenced_type" : "type-789",
   "self_type" : "type-789",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-577" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIKmLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_lvalue_reference<unsigned long>",
   "name" : "std::add_lvalue_reference<unsigned long>",
   "referenced_type" : "type-790",
   "self_type" : "type-790",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__120add_lvalue_referenceImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_lvalue_reference<const unsigned long>",
   "name" : "std::add_lvalue_reference<const unsigned long>",
   "referenced_type" : "type-791",
   "self_type" : "type-791",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-577" ],
   "unique_id" : "_ZTSNSt3__120add_lvalue_referenceIKmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-792",
   "self_type" : "type-792",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__127__add_rvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_rvalue_reference<unsigned long>",
   "name" : "std::add_rvalue_reference<unsigned long>",
   "referenced_type" : "type-793",
   "self_type" : "type-793",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__120add_rvalue_referenceImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__uncvref<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__uncvref<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-794",
   "self_type" : "type-794",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__19__uncvrefINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__any",
   "name" : "std::__any",
   "referenced_type" : "type-795",
   "self_type" : "type-795",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__anyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-796",
   "self_type" : "type-796",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_pointer<std::pair<unsigned long, unsigned long> >",
   "name" : "std::add_pointer<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-797",
   "self_type" : "type-797",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__111add_pointerINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_extent<std::pair<unsigned long, unsigned long> >",
   "name" : "std::remove_extent<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-798",
   "self_type" : "type-798",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__113remove_extentINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-799",
   "self_type" : "type-799",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::decay<std::pair<unsigned long, unsigned long> >",
   "name" : "std::decay<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-800",
   "self_type" : "type-800",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-604" ],
   "unique_id" : "_ZTSNSt3__15decayINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_abstract<SkColorSpace *>",
   "name" : "std::is_abstract<SkColorSpace *>",
   "referenced_type" : "type-801",
   "self_type" : "type-801",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-561" ],
   "unique_id" : "_ZTSNSt3__111is_abstractIP12SkColorSpaceEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "std::is_abstract<unsigned long>",
   "name" : "std::is_abstract<unsigned long>",
   "referenced_type" : "type-802",
   "self_type" : "type-802",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__111is_abstractImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_convertible<SkColorSpace *, SkColorSpace *>",
   "name" : "std::is_convertible<SkColorSpace *, SkColorSpace *>",
   "referenced_type" : "type-803",
   "self_type" : "type-803",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-561", "type-561" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleIP12SkColorSpaceS2_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_convertible<const unsigned long &, unsigned long>",
   "name" : "std::is_convertible<const unsigned long &, unsigned long>",
   "referenced_type" : "type-804",
   "self_type" : "type-804",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-610", "type-570" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleIRKmmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-652"
    }
   ],
   "linker_set_key" : "std::is_convertible<unsigned long, unsigned long>",
   "name" : "std::is_convertible<unsigned long, unsigned long>",
   "referenced_type" : "type-805",
   "self_type" : "type-805",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570", "type-570" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleImmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-647"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned char>",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "type-806",
   "self_type" : "type-806",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-643"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned short>",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "type-807",
   "self_type" : "type-807",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-648"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned int>",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "type-808",
   "self_type" : "type-808",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-528" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long>",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "type-809",
   "self_type" : "type-809",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long long>",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "type-810",
   "self_type" : "type-810",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-726" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "std::alignment_of<double>",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "type-811",
   "self_type" : "type-811",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::alignment_of<long double>",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "type-812",
   "self_type" : "type-812",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIgEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double>",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "type-813",
   "self_type" : "type-813",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-814" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "std::__struct_double",
   "name" : "std::__struct_double",
   "referenced_type" : "type-814",
   "self_type" : "type-814",
   "size" : 16,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115__struct_doubleE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double4>",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "type-815",
   "self_type" : "type-815",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-816" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_16__struct_double4EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-817"
    }
   ],
   "linker_set_key" : "std::__struct_double4",
   "name" : "std::__struct_double4",
   "referenced_type" : "type-816",
   "self_type" : "type-816",
   "size" : 32,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__116__struct_double4E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "std::alignment_of<int *>",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "type-818",
   "self_type" : "type-818",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-413" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIPiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat> > > > > >",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat> > > > > >",
   "referenced_type" : "type-819",
   "self_type" : "type-819",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-27", "type-820" ],
   "unique_id" : "_ZTSNSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat> > > > > >",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat> > > > > >",
   "referenced_type" : "type-821",
   "self_type" : "type-821",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-5", "type-822" ],
   "unique_id" : "_ZTSNSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned char>",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "type-823",
   "self_type" : "type-823",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned short>",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "type-824",
   "self_type" : "type-824",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__112__align_typeItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned int>",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "type-825",
   "self_type" : "type-825",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-528" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long>",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "type-826",
   "self_type" : "type-826",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__112__align_typeImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long long>",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "type-827",
   "self_type" : "type-827",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-726" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<double>",
   "name" : "std::__align_type<double>",
   "referenced_type" : "type-828",
   "self_type" : "type-828",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-83" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<long double>",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "type-829",
   "self_type" : "type-829",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIgEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double>",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-814" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double4>",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "type-831",
   "self_type" : "type-831",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-816" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_16__struct_double4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<int *>",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "type-832",
   "self_type" : "type-832",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-413" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIPiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "referenced_type" : "type-833",
   "self_type" : "type-833",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-834" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "referenced_type" : "type-835",
   "self_type" : "type-835",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-836" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "referenced_type" : "type-837",
   "self_type" : "type-837",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-838" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "referenced_type" : "type-839",
   "self_type" : "type-839",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-840" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "referenced_type" : "type-841",
   "self_type" : "type-841",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-842" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "referenced_type" : "type-843",
   "self_type" : "type-843",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-844" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "referenced_type" : "type-845",
   "self_type" : "type-845",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-846" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIgEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-650"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "referenced_type" : "type-847",
   "self_type" : "type-847",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-848" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "referenced_type" : "type-849",
   "self_type" : "type-849",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-850" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-649"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "referenced_type" : "type-851",
   "self_type" : "type-851",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-852" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 8, 8>",
   "name" : "std::__select_align<24, 8, 8>",
   "referenced_type" : "type-853",
   "self_type" : "type-853",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm8ELm8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 16, 8>",
   "name" : "std::__select_align<24, 16, 8>",
   "referenced_type" : "type-854",
   "self_type" : "type-854",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm16ELm8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 16, 16>",
   "name" : "std::__select_align<24, 16, 16>",
   "referenced_type" : "type-855",
   "self_type" : "type-855",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm16ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 8, 16>",
   "name" : "std::__select_align<24, 8, 16>",
   "referenced_type" : "type-856",
   "self_type" : "type-856",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm8ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 4, 16>",
   "name" : "std::__select_align<24, 4, 16>",
   "referenced_type" : "type-857",
   "self_type" : "type-857",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm4ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 2, 16>",
   "name" : "std::__select_align<24, 2, 16>",
   "referenced_type" : "type-858",
   "self_type" : "type-858",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm2ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 1, 16>",
   "name" : "std::__select_align<24, 1, 16>",
   "referenced_type" : "type-859",
   "self_type" : "type-859",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm1ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::aligned_storage<24, 16>",
   "name" : "std::aligned_storage<24, 16>",
   "referenced_type" : "type-860",
   "self_type" : "type-860",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILm24ELm16EEE"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-862"
    }
   ],
   "linker_set_key" : "std::aligned_storage<24, 16>::type",
   "name" : "std::aligned_storage<24, 16>::type",
   "referenced_type" : "type-861",
   "self_type" : "type-861",
   "size" : 32,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILm24ELm16EE4typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__numeric_type<void>",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "type-863",
   "self_type" : "type-863",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__114__numeric_typeIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<bool, true>",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "type-864",
   "self_type" : "type-864",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<short, true>",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned short, true>",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "type-866",
   "self_type" : "type-866",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__113__make_signedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<int, true>",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned int, true>",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "type-868",
   "self_type" : "type-868",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-528" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long, true>",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "type-869",
   "self_type" : "type-869",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long, true>",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "type-870",
   "self_type" : "type-870",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__113__make_signedImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long long, true>",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "type-871",
   "self_type" : "type-871",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long long, true>",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "type-872",
   "self_type" : "type-872",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-726" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIyLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<__int128_t, true>",
   "name" : "std::__make_signed<__int128_t, true>",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-728" ],
   "unique_id" : "_ZTSNSt3__113__make_signedInLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<__uint128_t, true>",
   "name" : "std::__make_signed<__uint128_t, true>",
   "referenced_type" : "type-874",
   "self_type" : "type-874",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-730" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIoLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<bool, true>",
   "name" : "std::__make_unsigned<bool, true>",
   "referenced_type" : "type-875",
   "self_type" : "type-875",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-637" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<short, true>",
   "name" : "std::__make_unsigned<short, true>",
   "referenced_type" : "type-876",
   "self_type" : "type-876",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned short, true>",
   "name" : "std::__make_unsigned<unsigned short, true>",
   "referenced_type" : "type-877",
   "self_type" : "type-877",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<int, true>",
   "name" : "std::__make_unsigned<int, true>",
   "referenced_type" : "type-878",
   "self_type" : "type-878",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned int, true>",
   "name" : "std::__make_unsigned<unsigned int, true>",
   "referenced_type" : "type-879",
   "self_type" : "type-879",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-528" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long, true>",
   "name" : "std::__make_unsigned<long, true>",
   "referenced_type" : "type-880",
   "self_type" : "type-880",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long, true>",
   "name" : "std::__make_unsigned<unsigned long, true>",
   "referenced_type" : "type-881",
   "self_type" : "type-881",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-570" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long long, true>",
   "name" : "std::__make_unsigned<long long, true>",
   "referenced_type" : "type-882",
   "self_type" : "type-882",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long long, true>",
   "name" : "std::__make_unsigned<unsigned long long, true>",
   "referenced_type" : "type-883",
   "self_type" : "type-883",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-726" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIyLb1EEE"
  },
  {
