{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-11",
   "self_type" : "type-10",
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-6",
   "self_type" : "type-5",
   "size" : 5121,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float",
   "name" : "float",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "long",
   "name" : "long",
   "referenced_type" : "type-19",
   "self_type" : "type-19",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "signed char",

  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-118",
   "self_type" : "type-117",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-11",
   "self_type" : "type-21",
   "size" : 1,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const EventTagMap",
   "name" : "const EventTagMap",
   "referenced_type" : "type-135",
   "self_type" : "type-134",
   "source_file" : "/system/core/liblog/include/log/logprint.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-143",
   "self_type" : "type-142",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-154",
   "self_type" : "type-153",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const EventTagMap",
   "name" : "const EventTagMap",
   "referenced_type" : "type-158",
   "self_type" : "type-157",
   "size" : 208,
   "source_file" : "/system/core/liblog/include/log/event_tag_map.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-163",
   "self_type" : "type-162",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-166",
   "self_type" : "type-165",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-188",
   "self_type" : "type-187",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const AndroidLogEntry_t",
   "name" : "const AndroidLogEntry_t",
   "referenced_type" : "type-18",
   "self_type" : "type-30",
   "size" : 64,
   "source_file" : "/system/core/liblog/include/log/logprint.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const EventTagMap",
   "name" : "const EventTagMap",
   "referenced_type" : "type-28",
   "self_type" : "type-27",
   "source_file" : "/system/core/liblog/include/log/logprint.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const unsigned int",
   "name" : "const unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-103",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-36",
   "self_type" : "type-35",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android_log_event_list",
   "name" : "const android_log_event_list",
   "referenced_type" : "type-39",
   "self_type" : "type-50",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const log_msg",
   "name" : "const log_msg",
   "referenced_type" : "type-44",
   "self_type" : "type-98",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-55",
   "self_type" : "type-54",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const log_time",
   "name" : "const log_time",
   "referenced_type" : "type-58",
   "self_type" : "type-95",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const EventTagMap",
   "name" : "const EventTagMap",
   "referenced_type" : "type-62",
   "self_type" : "type-61",
   "size" : 208,
   "source_file" : "/system/core/liblog/include/log/event_tag_map.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-69",
   "self_type" : "type-68",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const timespec",
   "name" : "const timespec",
   "referenced_type" : "type-72",
   "self_type" : "type-71",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "priority",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "uid",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "pid",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tag",
     "field_offset" : 256,
     "referenced_type" : "type-20"
    },
    {
     "field_name" : "tagLen",
     "field_offset" : 320,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "messageLen",
     "field_offset" : 384,
     "referenced_type" : "type-22"
    },
    {
     "field_name" : "message",
     "field_offset" : 448,
     "referenced_type" : "type-20"
    }
   ],
   "linker_set_key" : "AndroidLogEntry_t",
   "name" : "AndroidLogEntry_t",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 64,
   "source_file" : "/system/core/liblog/include/log/logprint.h",
   "unique_id" : "AndroidLogEntry_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ctx",
     "referenced_type" : "type-40"
    },
    {
     "access" : "private",
     "field_name" : "ret",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android_log_event_list",
   "name" : "android_log_event_list",
   "record_kind" : "class",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "_ZTS22android_log_event_list"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-14"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3) at system/core/liblog/include/log/log_read.h:143:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3) at system/core/liblog/include/log/log_read.h:143:3",
   "record_kind" : "union",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-49"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3) at system/core/liblog/include/log/log_read.h:143:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3) at system/core/liblog/include/log/log_read.h:143:3",
   "record_kind" : "union",
   "referenced_type" : "type-45",
   "self_type" : "type-45",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-49",
   "self_type" : "type-49",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 8,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "realtime",
     "field_offset" : 24,
     "referenced_type" : "type-58"
    }
   ],
   "linker_set_key" : "android_log_header_t",
   "name" : "android_log_header_t",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 11,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_header_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-39"
    }
   ],
   "linker_set_key" : "__android_log_event_list",
   "name" : "__android_log_event_list",
   "record_kind" : "class",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "_ZTS24__android_log_event_list"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h",
   "unique_id" : "log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "complete",
     "field_offset" : 32,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "len",
     "field_offset" : 48,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-75"
    }
   ],
   "linker_set_key" : "android_log_list_element",
   "name" : "android_log_list_element",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 16,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "android_log_list_element"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "int64",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "string",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "float32",
     "referenced_type" : "type-77"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:68:3) at system/core/liblog/include/log/log_event_list.h:68:3",
   "name" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:68:3) at system/core/liblog/include/log/log_event_list.h:68:3",
   "record_kind" : "union",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_event_list.h",
   "unique_id" : "android_log_list_element::(anonymous union at system/core/liblog/include/log/log_event_list.h:68:3)"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "len",
     "field_offset" : 8,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "uid",
     "field_offset" : 24,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "pid",
     "field_offset" : 40,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "android_pmsg_log_header_t",
   "name" : "android_pmsg_log_header_t",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 7,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_pmsg_log_header_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "tid",
     "field_offset" : 8,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "realtime",
     "field_offset" : 24,
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "android_log_header_t",
   "name" : "android_log_header_t",
   "referenced_type" : "type-79",
   "self_type" : "type-79",
   "size" : 11,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_header_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android_event_header_t",
   "name" : "android_event_header_t",
   "referenced_type" : "type-80",
   "self_type" : "type-80",
   "size" : 4,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_header_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "android_event_int_t",
   "name" : "android_event_int_t",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_int_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android_log_event_int_t",
   "name" : "android_log_event_int_t",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_int_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "data",
     "field_offset" : 8,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "android_event_long_t",
   "name" : "android_event_long_t",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_long_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "payload",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "android_log_event_long_t",
   "name" : "android_log_event_long_t",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 13,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_long_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "data",
     "field_offset" : 40,
     "referenced_type" : "type-87"
    }
   ],
   "linker_set_key" : "android_event_string_t",
   "name" : "android_event_string_t",
   "referenced_type" : "type-86",
   "self_type" : "type-86",
   "size" : 5,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_event_string_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "header",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "length",
     "field_offset" : 40,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "data",
     "field_offset" : 72,
     "referenced_type" : "type-89"
    }
   ],
   "linker_set_key" : "android_log_event_string_t",
   "name" : "android_log_event_string_t",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 9,
   "source_file" : "/system/core/liblog/include/private/android_logger.h",
   "unique_id" : "android_log_event_string_t"
  }
 ],
 "rvalue_reference_types" : []
}
