{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "int [28]",
   "name" : "int [28]",
   "referenced_type" : "type-12",
   "self_type" : "type-1447",
   "size" : 112,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [10]",
   "name" : "int [10]",
   "referenced_type" : "type-12",
   "self_type" : "type-1191",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [12]",
   "name" : "int [12]",
   "referenced_type" : "type-12",
   "self_type" : "type-1189",
   "size" : 48,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [14]",
   "name" : "int [14]",
   "referenced_type" : "type-12",
   "self_type" : "type-1193",
   "size" : 56,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [2]",
   "name" : "int [2]",
   "referenced_type" : "type-12",
   "self_type" : "type-1183",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "__attribute__((neon_vector_type(8))) signed char [2]",
   "name" : "__attribute__((neon_vector_type(8))) signed char [2]",
   "referenced_type" : "type-1636",
   "self_type" : "type-1635",
   "size" : 16,

   "size" : 68,
   "source_file" : "/external/skia/include/core/SkMatrix44.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const short",
   "name" : "const short",
   "referenced_type" : "type-78",
   "self_type" : "type-494",
   "size" : 2,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SkRefCntBase",
   "name" : "const SkRefCntBase",
   "referenced_type" : "type-790",
   "self_type" : "type-797",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRefCnt.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::__atomic_base<int, false>",
   "name" : "const std::__atomic_base<int, false>",
   "referenced_type" : "type-793",
   "self_type" : "type-1531",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const long",
   "name" : "const long",
   "referenced_type" : "type-79",
   "self_type" : "type-502",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const JNINativeInterface",
   "name" : "const JNINativeInterface",
   "referenced_type" : "type-7",
   "self_type" : "type-6",
   "size" : 1864,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const sk_sp<SkColorSpace>",
   "name" : "const sk_sp<SkColorSpace>",
   "referenced_type" : "type-801",
   "self_type" : "type-804",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SkColorSpace",
   "name" : "const SkColorSpace",
   "referenced_type" : "type-803",
   "self_type" : "type-821",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColorSpace.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const sk_sp<SkPixelRef>",
   "name" : "const sk_sp<SkPixelRef>",
   "referenced_type" : "type-807",
   "self_type" : "type-811",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const float",
   "name" : "const float",
   "referenced_type" : "type-80",
   "self_type" : "type-506",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const double",
   "name" : "const double",
   "referenced_type" : "type-81",
   "self_type" : "type-510",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const SkData",
   "name" : "const SkData",
   "referenced_type" : "type-825",
   "self_type" : "type-824",
   "source_file" : "/external/skia/include/core/SkColorSpace.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SkImageInfo",
   "name" : "const SkImageInfo",
   "referenced_type" : "type-830",
   "self_type" : "type-832",
   "size" : 24,
   "source_file" : "/external/skia/include/core/SkImageInfo.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SkPixmap",
   "name" : "const SkPixmap",
   "referenced_type" : "type-836",
   "self_type" : "type-841",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkPixmap.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-837",
   "self_type" : "type-1289",
   "size" : 8,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long",
   "name" : "const unsigned long",
   "referenced_type" : "type-839",
   "self_type" : "type-846",
   "size" : 8,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SkBitmap",
   "name" : "const SkBitmap",
   "referenced_type" : "type-850",
   "self_type" : "type-851",
   "size" : 56,
   "source_file" : "/external/skia/include/core/SkBitmap.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const SkPaint",
   "name" : "const SkPaint",
   "referenced_type" : "type-859",
   "self_type" : "type-858",
   "source_file" : "/external/skia/include/core/SkBitmap.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const std::pair<unsigned long, unsigned long>",
   "name" : "const std::pair<unsigned long, unsigned long>",
   "referenced_type" : "type-873",
   "self_type" : "type-875",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-8",
   "self_type" : "type-1290",
   "size" : 8,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const bool",
   "name" : "const bool",
   "referenced_type" : "type-906",
   "self_type" : "type-910",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const wchar_t",
   "name" : "const wchar_t",
   "referenced_type" : "type-982",
   "self_type" : "type-1486",
   "size" : 4,
   "source_file" : "/external/libcxx/include/wchar.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-9",
   "self_type" : "type-838",
   "source_file" : "/bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-991"
    }
   ],
   "linker_set_key" : "std::is_integral<long>",
   "name" : "std::is_integral<long>",
   "referenced_type" : "type-1000",
   "self_type" : "type-1000",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__111is_integralIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-975"
    }
   ],
   "linker_set_key" : "std::is_integral<double>",
   "name" : "std::is_integral<double>",
   "referenced_type" : "type-1001",
   "self_type" : "type-1001",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__111is_integralIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-976"
    }
   ],
   "linker_set_key" : "std::is_integral<float>",
   "name" : "std::is_integral<float>",
   "referenced_type" : "type-1002",
   "self_type" : "type-1002",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__111is_integralIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-989"
    }
   ],
   "linker_set_key" : "std::is_integral<int>",
   "name" : "std::is_integral<int>",
   "referenced_type" : "type-1003",
   "self_type" : "type-1003",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__111is_integralIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-987"
    }
   ],
   "linker_set_key" : "std::is_integral<short>",
   "name" : "std::is_integral<short>",
   "referenced_type" : "type-1004",
   "self_type" : "type-1004",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__111is_integralIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<long>",
   "name" : "std::__libcpp_is_floating_point<long>",
   "referenced_type" : "type-1005",
   "self_type" : "type-1005",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<int>",
   "name" : "std::__libcpp_is_floating_point<int>",
   "referenced_type" : "type-1006",
   "self_type" : "type-1006",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<short>",
   "name" : "std::__libcpp_is_floating_point<short>",
   "referenced_type" : "type-1007",
   "self_type" : "type-1007",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<__fp16>",
   "name" : "std::__libcpp_is_floating_point<__fp16>",
   "referenced_type" : "type-1008",
   "self_type" : "type-1008",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1009" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<_Float16>",
   "name" : "std::__libcpp_is_floating_point<_Float16>",
   "referenced_type" : "type-1010",
   "self_type" : "type-1010",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1011" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIDF16_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<float>",
   "name" : "std::__libcpp_is_floating_point<float>",
   "referenced_type" : "type-1012",
   "self_type" : "type-1012",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<double>",
   "name" : "std::__libcpp_is_floating_point<double>",
   "referenced_type" : "type-1013",
   "self_type" : "type-1013",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<long double>",
   "name" : "std::__libcpp_is_floating_point<long double>",
   "referenced_type" : "type-1014",
   "self_type" : "type-1014",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1005"
    }
   ],
   "linker_set_key" : "std::is_floating_point<long>",
   "name" : "std::is_floating_point<long>",
   "referenced_type" : "type-1015",
   "self_type" : "type-1015",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1006"
    }
   ],
   "linker_set_key" : "std::is_floating_point<int>",
   "name" : "std::is_floating_point<int>",
   "referenced_type" : "type-1016",
   "self_type" : "type-1016",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1007"
    }
   ],
   "linker_set_key" : "std::is_floating_point<short>",
   "name" : "std::is_floating_point<short>",
   "referenced_type" : "type-1017",
   "self_type" : "type-1017",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_array<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_array<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1018",
   "self_type" : "type-1018",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__18is_arrayINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_reference<unsigned long>",
   "name" : "std::is_reference<unsigned long>",
   "referenced_type" : "type-1019",
   "self_type" : "type-1019",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__112is_referenceImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_reference<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_reference<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1020",
   "self_type" : "type-1020",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__112is_referenceINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_union<unsigned long>",
   "name" : "std::is_union<unsigned long>",
   "referenced_type" : "type-1021",
   "self_type" : "type-1021",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__18is_unionImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_union<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_union<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1022",
   "self_type" : "type-1022",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__18is_unionINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_class<unsigned long>",
   "name" : "std::is_class<unsigned long>",
   "referenced_type" : "type-1023",
   "self_type" : "type-1023",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__18is_classImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_class<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_class<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1024",
   "self_type" : "type-1024",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__18is_classINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_same<int, bool>",
   "name" : "std::is_same<int, bool>",
   "referenced_type" : "type-1025",
   "self_type" : "type-1025",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12", "type-906" ],
   "unique_id" : "_ZTSNSt3__17is_sameIibEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_same<unsigned long &, std::__two>",
   "name" : "std::is_same<unsigned long &, std::__two>",
   "referenced_type" : "type-1026",
   "self_type" : "type-1026",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-908" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRmNS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_same<const unsigned long &, std::__two>",
   "name" : "std::is_same<const unsigned long &, std::__two>",
   "referenced_type" : "type-1027",
   "self_type" : "type-1027",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-879", "type-908" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRKmNS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_same<std::pair<unsigned long, unsigned long> &, std::__two>",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long> &, std::__two>",
   "referenced_type" : "type-1028",
   "self_type" : "type-1028",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-881", "type-908" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRNS_4pairImmEENS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_same<std::pair<unsigned long, unsigned long>, void>",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long>, void>",
   "referenced_type" : "type-1029",
   "self_type" : "type-1029",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873", "type-9" ],
   "unique_id" : "_ZTSNSt3__17is_sameINS_4pairImmEEvEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_same<std::pair<unsigned long, unsigned long>, std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_same<std::pair<unsigned long, unsigned long>, std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1030",
   "self_type" : "type-1030",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873", "type-873" ],
   "unique_id" : "_ZTSNSt3__17is_sameINS_4pairImmEES2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_is_function_imp::__dummy_type",
   "name" : "std::__libcpp_is_function_imp::__dummy_type",
   "referenced_type" : "type-1031",
   "self_type" : "type-1031",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__124__libcpp_is_function_imp12__dummy_typeE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_function<unsigned long, false>",
   "name" : "std::__libcpp_is_function<unsigned long, false>",
   "referenced_type" : "type-1032",
   "self_type" : "type-1032",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_functionImLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_function<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__libcpp_is_function<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-1033",
   "self_type" : "type-1033",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1032"
    }
   ],
   "linker_set_key" : "std::is_function<unsigned long>",
   "name" : "std::is_function<unsigned long>",
   "referenced_type" : "type-1034",
   "self_type" : "type-1034",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__111is_functionImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1033"
    }
   ],
   "linker_set_key" : "std::is_function<std::pair<unsigned long, unsigned long> >",
   "name" : "std::is_function<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1035",
   "self_type" : "type-1035",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__111is_functionINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_enum<int>",
   "name" : "std::is_enum<int>",
   "referenced_type" : "type-1036",
   "self_type" : "type-1036",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__17is_enumIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_enum<short>",
   "name" : "std::is_enum<short>",
   "referenced_type" : "type-1037",
   "self_type" : "type-1037",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__17is_enumIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<long>",
   "name" : "std::is_arithmetic<long>",
   "referenced_type" : "type-1038",
   "self_type" : "type-1038",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<int>",
   "name" : "std::is_arithmetic<int>",
   "referenced_type" : "type-1039",
   "self_type" : "type-1039",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<short>",
   "name" : "std::is_arithmetic<short>",
   "referenced_type" : "type-1040",
   "self_type" : "type-1040",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_scalar<nullptr_t>",
   "name" : "std::is_scalar<nullptr_t>",
   "referenced_type" : "type-1041",
   "self_type" : "type-1041",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-972" ],
   "unique_id" : "_ZTSNSt3__19is_scalarIDnEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_referenceable_impl",
   "name" : "std::__is_referenceable_impl",
   "referenced_type" : "type-1042",
   "self_type" : "type-1042",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__is_referenceable_implE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<unsigned long>",
   "name" : "std::__is_referenceable<unsigned long>",
   "referenced_type" : "type-1043",
   "self_type" : "type-1043",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<const unsigned long>",
   "name" : "std::__is_referenceable<const unsigned long>",
   "referenced_type" : "type-1044",
   "self_type" : "type-1044",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-846" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableIKmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__is_referenceable<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1045",
   "self_type" : "type-1045",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_const<unsigned long, false>",
   "name" : "std::__add_const<unsigned long, false>",
   "referenced_type" : "type-1046",
   "self_type" : "type-1046",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__111__add_constImLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_const<unsigned long>",
   "name" : "std::add_const<unsigned long>",
   "referenced_type" : "type-1047",
   "self_type" : "type-1047",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__19add_constImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<sk_sp<SkColorSpace> &>",
   "name" : "std::remove_reference<sk_sp<SkColorSpace> &>",
   "referenced_type" : "type-1048",
   "self_type" : "type-1048",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1049" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIR5sk_spI12SkColorSpaceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<std::pair<unsigned long, unsigned long> >",
   "name" : "std::remove_reference<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<unsigned long>",
   "name" : "std::remove_reference<unsigned long>",
   "referenced_type" : "type-1051",
   "self_type" : "type-1051",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<unsigned long &>",
   "name" : "std::remove_reference<unsigned long &>",
   "referenced_type" : "type-1052",
   "self_type" : "type-1052",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<int &>",
   "name" : "std::remove_reference<int &>",
   "referenced_type" : "type-1053",
   "self_type" : "type-1053",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1054" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_reference<float &>",
   "name" : "std::remove_reference<float &>",
   "referenced_type" : "type-1055",
   "self_type" : "type-1055",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1056" ],
   "unique_id" : "_ZTSNSt3__116remove_referenceIRfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-1057",
   "self_type" : "type-1057",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "name" : "std::__add_lvalue_reference_impl<const unsigned long, true>",
   "referenced_type" : "type-1058",
   "self_type" : "type-1058",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-846" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implIKmLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_lvalue_reference<unsigned long>",
   "name" : "std::add_lvalue_reference<unsigned long>",
   "referenced_type" : "type-1059",
   "self_type" : "type-1059",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__120add_lvalue_referenceImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_lvalue_reference<const unsigned long>",
   "name" : "std::add_lvalue_reference<const unsigned long>",
   "referenced_type" : "type-1060",
   "self_type" : "type-1060",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-846" ],
   "unique_id" : "_ZTSNSt3__120add_lvalue_referenceIKmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "name" : "std::__add_rvalue_reference_impl<unsigned long, true>",
   "referenced_type" : "type-1061",
   "self_type" : "type-1061",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__127__add_rvalue_reference_implImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_rvalue_reference<unsigned long>",
   "name" : "std::add_rvalue_reference<unsigned long>",
   "referenced_type" : "type-1062",
   "self_type" : "type-1062",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__120add_rvalue_referenceImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__uncvref<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__uncvref<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1063",
   "self_type" : "type-1063",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__19__uncvrefINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__any",
   "name" : "std::__any",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__15__anyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__add_pointer_impl<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-1065",
   "self_type" : "type-1065",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__118__add_pointer_implINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_pointer<std::pair<unsigned long, unsigned long> >",
   "name" : "std::add_pointer<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1066",
   "self_type" : "type-1066",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__111add_pointerINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_extent<std::pair<unsigned long, unsigned long> >",
   "name" : "std::remove_extent<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__113remove_extentINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "name" : "std::__decay<std::pair<unsigned long, unsigned long>, true>",
   "referenced_type" : "type-1068",
   "self_type" : "type-1068",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__17__decayINS_4pairImmEELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::decay<std::pair<unsigned long, unsigned long> >",
   "name" : "std::decay<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1069",
   "self_type" : "type-1069",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__15decayINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_abstract<SkColorSpace *>",
   "name" : "std::is_abstract<SkColorSpace *>",
   "referenced_type" : "type-1070",
   "self_type" : "type-1070",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-802" ],
   "unique_id" : "_ZTSNSt3__111is_abstractIP12SkColorSpaceEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_abstract<unsigned long>",
   "name" : "std::is_abstract<unsigned long>",
   "referenced_type" : "type-1071",
   "self_type" : "type-1071",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__111is_abstractImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_convertible<SkColorSpace *, SkColorSpace *>",
   "name" : "std::is_convertible<SkColorSpace *, SkColorSpace *>",
   "referenced_type" : "type-1072",
   "self_type" : "type-1072",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-802", "type-802" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleIP12SkColorSpaceS2_EE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_convertible<const unsigned long &, unsigned long>",
   "name" : "std::is_convertible<const unsigned long &, unsigned long>",
   "referenced_type" : "type-1073",
   "self_type" : "type-1073",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-879", "type-839" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleIRKmmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_convertible<unsigned long, unsigned long>",
   "name" : "std::is_convertible<unsigned long, unsigned long>",
   "referenced_type" : "type-1074",
   "self_type" : "type-1074",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839", "type-839" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleImmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-916"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned char>",
   "name" : "std::alignment_of<unsigned char>",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-912"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned short>",
   "name" : "std::alignment_of<unsigned short>",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-917"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned int>",
   "name" : "std::alignment_of<unsigned int>",
   "referenced_type" : "type-1077",
   "self_type" : "type-1077",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-918"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long>",
   "name" : "std::alignment_of<unsigned long>",
   "referenced_type" : "type-1078",
   "self_type" : "type-1078",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-918"
    }
   ],
   "linker_set_key" : "std::alignment_of<unsigned long long>",
   "name" : "std::alignment_of<unsigned long long>",
   "referenced_type" : "type-1079",
   "self_type" : "type-1079",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-995" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-918"
    }
   ],
   "linker_set_key" : "std::alignment_of<double>",
   "name" : "std::alignment_of<double>",
   "referenced_type" : "type-1080",
   "self_type" : "type-1080",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::alignment_of<long double>",
   "name" : "std::alignment_of<long double>",
   "referenced_type" : "type-1081",
   "self_type" : "type-1081",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double>",
   "name" : "std::alignment_of<std::__struct_double>",
   "referenced_type" : "type-1082",
   "self_type" : "type-1082",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1083" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "std::__struct_double",
   "name" : "std::__struct_double",
   "referenced_type" : "type-1083",
   "self_type" : "type-1083",
   "size" : 16,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115__struct_doubleE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-918"
    }
   ],
   "linker_set_key" : "std::alignment_of<std::__struct_double4>",
   "name" : "std::alignment_of<std::__struct_double4>",
   "referenced_type" : "type-1084",
   "self_type" : "type-1084",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1085" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofINS_16__struct_double4EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-1086"
    }
   ],
   "linker_set_key" : "std::__struct_double4",
   "name" : "std::__struct_double4",
   "referenced_type" : "type-1085",
   "self_type" : "type-1085",
   "size" : 32,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__116__struct_double4E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-918"
    }
   ],
   "linker_set_key" : "std::alignment_of<int *>",
   "name" : "std::alignment_of<int *>",
   "referenced_type" : "type-1087",
   "self_type" : "type-1087",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-441" ],
   "unique_id" : "_ZTSNSt3__112alignment_ofIPiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat> > > > > >",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat> > > > > >",
   "referenced_type" : "type-1088",
   "self_type" : "type-1088",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-25", "type-1089" ],
   "unique_id" : "_ZTSNSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat> > > > > >",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat> > > > > >",
   "referenced_type" : "type-1090",
   "self_type" : "type-1090",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38", "type-1091" ],
   "unique_id" : "_ZTSNSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned char>",
   "name" : "std::__align_type<unsigned char>",
   "referenced_type" : "type-1092",
   "self_type" : "type-1092",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned short>",
   "name" : "std::__align_type<unsigned short>",
   "referenced_type" : "type-1093",
   "self_type" : "type-1093",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__112__align_typeItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned int>",
   "name" : "std::__align_type<unsigned int>",
   "referenced_type" : "type-1094",
   "self_type" : "type-1094",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long>",
   "name" : "std::__align_type<unsigned long>",
   "referenced_type" : "type-1095",
   "self_type" : "type-1095",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__112__align_typeImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<unsigned long long>",
   "name" : "std::__align_type<unsigned long long>",
   "referenced_type" : "type-1096",
   "self_type" : "type-1096",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-995" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<double>",
   "name" : "std::__align_type<double>",
   "referenced_type" : "type-1097",
   "self_type" : "type-1097",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<long double>",
   "name" : "std::__align_type<long double>",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIeEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double>",
   "name" : "std::__align_type<std::__struct_double>",
   "referenced_type" : "type-1099",
   "self_type" : "type-1099",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1083" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_15__struct_doubleEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<std::__struct_double4>",
   "name" : "std::__align_type<std::__struct_double4>",
   "referenced_type" : "type-1100",
   "self_type" : "type-1100",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1085" ],
   "unique_id" : "_ZTSNSt3__112__align_typeINS_16__struct_double4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__align_type<int *>",
   "name" : "std::__align_type<int *>",
   "referenced_type" : "type-1101",
   "self_type" : "type-1101",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-441" ],
   "unique_id" : "_ZTSNSt3__112__align_typeIPiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned char>, std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > > >, 24>",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1103" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIhEENS1_INS2_ItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned short>, std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > > >, 24>",
   "referenced_type" : "type-1104",
   "self_type" : "type-1104",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1105" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeItEENS1_INS2_IjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned int>, std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > > >, 24>",
   "referenced_type" : "type-1106",
   "self_type" : "type-1106",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1107" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIjEENS1_INS2_ImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long>, std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > > >, 24>",
   "referenced_type" : "type-1108",
   "self_type" : "type-1108",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1109" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeImEENS1_INS2_IyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<unsigned long long>, std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > > >, 24>",
   "referenced_type" : "type-1110",
   "self_type" : "type-1110",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1111" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIyEENS1_INS2_IdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<double>, std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > > >, 24>",
   "referenced_type" : "type-1112",
   "self_type" : "type-1112",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1113" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIdEENS1_INS2_IeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<long double>, std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > > >, 24>",
   "referenced_type" : "type-1114",
   "self_type" : "type-1114",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1115" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIeEENS1_INS2_INS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-919"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double>, std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> > >, 24>",
   "referenced_type" : "type-1116",
   "self_type" : "type-1116",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1117" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_15__struct_doubleEEENS1_INS2_INS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-918"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<std::__struct_double4>, std::__type_list<std::__align_type<int *>, std::__nat> >, 24>",
   "referenced_type" : "type-1118",
   "self_type" : "type-1118",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1119" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeINS_16__struct_double4EEENS1_INS2_IPiEENS_5__natEEEEELm24EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-918"
    }
   ],
   "linker_set_key" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "name" : "std::__find_max_align<std::__type_list<std::__align_type<int *>, std::__nat>, 24>",
   "referenced_type" : "type-1120",
   "self_type" : "type-1120",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1121" ],
   "unique_id" : "_ZTSNSt3__116__find_max_alignINS_11__type_listINS_12__align_typeIPiEENS_5__natEEELm24EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 8, 8>",
   "name" : "std::__select_align<24, 8, 8>",
   "referenced_type" : "type-1122",
   "self_type" : "type-1122",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm8ELm8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 16, 8>",
   "name" : "std::__select_align<24, 16, 8>",
   "referenced_type" : "type-1123",
   "self_type" : "type-1123",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm16ELm8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 16, 16>",
   "name" : "std::__select_align<24, 16, 16>",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm16ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 8, 16>",
   "name" : "std::__select_align<24, 8, 16>",
   "referenced_type" : "type-1125",
   "self_type" : "type-1125",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm8ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 4, 16>",
   "name" : "std::__select_align<24, 4, 16>",
   "referenced_type" : "type-1126",
   "self_type" : "type-1126",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm4ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 2, 16>",
   "name" : "std::__select_align<24, 2, 16>",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm2ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_align<24, 1, 16>",
   "name" : "std::__select_align<24, 1, 16>",
   "referenced_type" : "type-1128",
   "self_type" : "type-1128",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__select_alignILm24ELm1ELm16EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::aligned_storage<24, 16>",
   "name" : "std::aligned_storage<24, 16>",
   "referenced_type" : "type-1129",
   "self_type" : "type-1129",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILm24ELm16EEE"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "type-1131"
    }
   ],
   "linker_set_key" : "std::aligned_storage<24, 16>::type",
   "name" : "std::aligned_storage<24, 16>::type",
   "referenced_type" : "type-1130",
   "self_type" : "type-1130",
   "size" : 32,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__115aligned_storageILm24ELm16EE4typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__numeric_type<void>",
   "name" : "std::__numeric_type<void>",
   "referenced_type" : "type-1132",
   "self_type" : "type-1132",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__114__numeric_typeIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<bool, true>",
   "name" : "std::__make_signed<bool, true>",
   "referenced_type" : "type-1133",
   "self_type" : "type-1133",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-906" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<short, true>",
   "name" : "std::__make_signed<short, true>",
   "referenced_type" : "type-1134",
   "self_type" : "type-1134",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned short, true>",
   "name" : "std::__make_signed<unsigned short, true>",
   "referenced_type" : "type-1135",
   "self_type" : "type-1135",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__113__make_signedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<int, true>",
   "name" : "std::__make_signed<int, true>",
   "referenced_type" : "type-1136",
   "self_type" : "type-1136",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned int, true>",
   "name" : "std::__make_signed<unsigned int, true>",
   "referenced_type" : "type-1137",
   "self_type" : "type-1137",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long, true>",
   "name" : "std::__make_signed<long, true>",
   "referenced_type" : "type-1138",
   "self_type" : "type-1138",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long, true>",
   "name" : "std::__make_signed<unsigned long, true>",
   "referenced_type" : "type-1139",
   "self_type" : "type-1139",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__113__make_signedImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<long long, true>",
   "name" : "std::__make_signed<long long, true>",
   "referenced_type" : "type-1140",
   "self_type" : "type-1140",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<unsigned long long, true>",
   "name" : "std::__make_signed<unsigned long long, true>",
   "referenced_type" : "type-1141",
   "self_type" : "type-1141",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-995" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIyLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<__int128_t, true>",
   "name" : "std::__make_signed<__int128_t, true>",
   "referenced_type" : "type-1142",
   "self_type" : "type-1142",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-997" ],
   "unique_id" : "_ZTSNSt3__113__make_signedInLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_signed<__uint128_t, true>",
   "name" : "std::__make_signed<__uint128_t, true>",
   "referenced_type" : "type-1143",
   "self_type" : "type-1143",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-999" ],
   "unique_id" : "_ZTSNSt3__113__make_signedIoLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<bool, true>",
   "name" : "std::__make_unsigned<bool, true>",
   "referenced_type" : "type-1144",
   "self_type" : "type-1144",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-906" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<short, true>",
   "name" : "std::__make_unsigned<short, true>",
   "referenced_type" : "type-1145",
   "self_type" : "type-1145",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned short, true>",
   "name" : "std::__make_unsigned<unsigned short, true>",
   "referenced_type" : "type-1146",
   "self_type" : "type-1146",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedItLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<int, true>",
   "name" : "std::__make_unsigned<int, true>",
   "referenced_type" : "type-1147",
   "self_type" : "type-1147",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned int, true>",
   "name" : "std::__make_unsigned<unsigned int, true>",
   "referenced_type" : "type-1148",
   "self_type" : "type-1148",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long, true>",
   "name" : "std::__make_unsigned<long, true>",
   "referenced_type" : "type-1149",
   "self_type" : "type-1149",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long, true>",
   "name" : "std::__make_unsigned<unsigned long, true>",
   "referenced_type" : "type-1150",
   "self_type" : "type-1150",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedImLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<long long, true>",
   "name" : "std::__make_unsigned<long long, true>",
   "referenced_type" : "type-1151",
   "self_type" : "type-1151",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIxLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<unsigned long long, true>",
   "name" : "std::__make_unsigned<unsigned long long, true>",
   "referenced_type" : "type-1152",
   "self_type" : "type-1152",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-995" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIyLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<__int128_t, true>",
   "name" : "std::__make_unsigned<__int128_t, true>",
   "referenced_type" : "type-1153",
   "self_type" : "type-1153",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-997" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedInLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_unsigned<__uint128_t, true>",
   "name" : "std::__make_unsigned<__uint128_t, true>",
   "referenced_type" : "type-1154",
   "self_type" : "type-1154",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-999" ],
   "unique_id" : "_ZTSNSt3__115__make_unsignedIoLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__select_2nd<unsigned long &, std::integral_constant<bool, true> >",
   "name" : "std::__select_2nd<unsigned long &, std::integral_constant<bool, true> >",
   "referenced_type" : "type-1155",
   "self_type" : "type-1155",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-921" ],
   "unique_id" : "_ZTSNSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__is_assignable_imp<unsigned long &, const unsigned long &, false>",
   "name" : "std::__is_assignable_imp<unsigned long &, const unsigned long &, false>",
   "referenced_type" : "type-1156",
   "self_type" : "type-1156",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-879" ],
   "unique_id" : "_ZTSNSt3__119__is_assignable_impIRmRKmLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__is_assignable_imp<unsigned long &, unsigned long &&, false>",
   "name" : "std::__is_assignable_imp<unsigned long &, unsigned long &&, false>",
   "referenced_type" : "type-1157",
   "self_type" : "type-1157",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-880" ],
   "unique_id" : "_ZTSNSt3__119__is_assignable_impIRmOmLb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1156"
    }
   ],
   "linker_set_key" : "std::is_assignable<unsigned long &, const unsigned long &>",
   "name" : "std::is_assignable<unsigned long &, const unsigned long &>",
   "referenced_type" : "type-1158",
   "self_type" : "type-1158",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-879" ],
   "unique_id" : "_ZTSNSt3__113is_assignableIRmRKmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1157"
    }
   ],
   "linker_set_key" : "std::is_assignable<unsigned long &, unsigned long &&>",
   "name" : "std::is_assignable<unsigned long &, unsigned long &&>",
   "referenced_type" : "type-1159",
   "self_type" : "type-1159",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-880" ],
   "unique_id" : "_ZTSNSt3__113is_assignableIRmOmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1158"
    }
   ],
   "linker_set_key" : "std::is_copy_assignable<unsigned long>",
   "name" : "std::is_copy_assignable<unsigned long>",
   "referenced_type" : "type-1160",
   "self_type" : "type-1160",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__118is_copy_assignableImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1159"
    }
   ],
   "linker_set_key" : "std::is_move_assignable<unsigned long>",
   "name" : "std::is_move_assignable<unsigned long>",
   "referenced_type" : "type-1161",
   "self_type" : "type-1161",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__118is_move_assignableImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "std::is_destructible<void>",
   "name" : "std::is_destructible<void>",
   "referenced_type" : "type-1162",
   "self_type" : "type-1162",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__115is_destructibleIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__is_construct::__nat",
   "name" : "std::__is_construct::__nat",
   "referenced_type" : "type-1166",
   "self_type" : "type-1166",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__114__is_construct5__natE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_constructible<unsigned long, unsigned long &&>",
   "name" : "std::is_constructible<unsigned long, unsigned long &&>",
   "referenced_type" : "type-1167",
   "self_type" : "type-1167",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__116is_constructibleImJOmEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_constructible<unsigned long, const unsigned long &>",
   "name" : "std::is_constructible<unsigned long, const unsigned long &>",
   "referenced_type" : "type-1168",
   "self_type" : "type-1168",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__116is_constructibleImJRKmEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::is_constructible<unsigned long, unsigned long>",
   "name" : "std::is_constructible<unsigned long, unsigned long>",
   "referenced_type" : "type-1169",
   "self_type" : "type-1169",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__116is_constructibleImJmEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1167"
    }
   ],
   "linker_set_key" : "std::is_move_constructible<unsigned long>",
   "name" : "std::is_move_constructible<unsigned long>",
   "referenced_type" : "type-1170",
   "self_type" : "type-1170",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__121is_move_constructibleImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_nothrow_constructible<true, false, unsigned long, unsigned long &&>",
   "name" : "std::__libcpp_is_nothrow_constructible<true, false, unsigned long, unsigned long &&>",
   "referenced_type" : "type-1171",
   "self_type" : "type-1171",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__133__libcpp_is_nothrow_constructibleILb1ELb0EmJOmEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1171"
    }
   ],
   "linker_set_key" : "std::is_nothrow_constructible<unsigned long, unsigned long &&>",
   "name" : "std::is_nothrow_constructible<unsigned long, unsigned long &&>",
   "referenced_type" : "type-1172",
   "self_type" : "type-1172",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__124is_nothrow_constructibleImJOmEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1172"
    }
   ],
   "linker_set_key" : "std::is_nothrow_move_constructible<unsigned long>",
   "name" : "std::is_nothrow_move_constructible<unsigned long>",
   "referenced_type" : "type-1173",
   "self_type" : "type-1173",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__129is_nothrow_move_constructibleImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_nothrow_assignable<true, unsigned long &, unsigned long &&>",
   "name" : "std::__libcpp_is_nothrow_assignable<true, unsigned long &, unsigned long &&>",
   "referenced_type" : "type-1174",
   "self_type" : "type-1174",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-880" ],
   "unique_id" : "_ZTSNSt3__130__libcpp_is_nothrow_assignableILb1ERmOmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1174"
    }
   ],
   "linker_set_key" : "std::is_nothrow_assignable<unsigned long &, unsigned long &&>",
   "name" : "std::is_nothrow_assignable<unsigned long &, unsigned long &&>",
   "referenced_type" : "type-1175",
   "self_type" : "type-1175",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-934", "type-880" ],
   "unique_id" : "_ZTSNSt3__121is_nothrow_assignableIRmOmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1175"
    }
   ],
   "linker_set_key" : "std::is_nothrow_move_assignable<unsigned long>",
   "name" : "std::is_nothrow_move_assignable<unsigned long>",
   "referenced_type" : "type-1176",
   "self_type" : "type-1176",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__126is_nothrow_move_assignableImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_fail_tag",
   "name" : "std::__extract_key_fail_tag",
   "referenced_type" : "type-1177",
   "self_type" : "type-1177",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_fail_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_self_tag",
   "name" : "std::__extract_key_self_tag",
   "referenced_type" : "type-1178",
   "self_type" : "type-1178",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__122__extract_key_self_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__extract_key_first_tag",
   "name" : "std::__extract_key_first_tag",
   "referenced_type" : "type-1179",
   "self_type" : "type-1179",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "unique_id" : "_ZTSNSt3__123__extract_key_first_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-1181"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-1180",
   "self_type" : "type-1180",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1183"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-1182",
   "self_type" : "type-1182",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "type-1185"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-1184",
   "self_type" : "type-1184",
   "size" : 56,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1187"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-1186",
   "self_type" : "type-1186",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS17pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1189"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-1188",
   "self_type" : "type-1188",
   "size" : 48,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1191"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-1190",
   "self_type" : "type-1190",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1193"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-1192",
   "self_type" : "type-1192",
   "size" : 56,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-1194",
   "self_type" : "type-1194",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS18pthread_spinlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "type-839"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-1197",
   "self_type" : "type-1197",
   "size" : 80,
   "source_file" : "/bionic/libc/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-1210",
   "self_type" : "type-1210",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-1211",
   "self_type" : "type-1211",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-1212",
   "self_type" : "type-1212",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "std::exception",
   "name" : "std::exception",
   "record_kind" : "class",
   "referenced_type" : "type-1214",
   "self_type" : "type-1214",
   "size" : 8,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt9exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "linker_set_key" : "std::bad_exception",
   "name" : "std::bad_exception",
   "record_kind" : "class",
   "referenced_type" : "type-1215",
   "self_type" : "type-1215",
   "size" : 8,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt13bad_exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13bad_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13bad_exceptionD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13bad_exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "std::exception_ptr",
   "name" : "std::exception_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-1217",
   "self_type" : "type-1217",
   "size" : 8,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt13exception_ptr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "field_offset" : 64,
     "referenced_type" : "type-1217"
    }
   ],
   "linker_set_key" : "std::nested_exception",
   "name" : "std::nested_exception",
   "record_kind" : "class",
   "referenced_type" : "type-1222",
   "self_type" : "type-1222",
   "size" : 16,
   "source_file" : "/external/libcxx/include/exception",
   "unique_id" : "_ZTSSt16nested_exception",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16nested_exception"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16nested_exceptionD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__type_name",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "std::type_info",
   "name" : "std::type_info",
   "record_kind" : "class",
   "referenced_type" : "type-1225",
   "self_type" : "type-1225",
   "size" : 16,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt9type_info",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9type_info"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9type_infoD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "linker_set_key" : "std::bad_cast",
   "name" : "std::bad_cast",
   "record_kind" : "class",
   "referenced_type" : "type-1230",
   "self_type" : "type-1230",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt8bad_cast",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt8bad_cast"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt8bad_castD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt8bad_cast4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "linker_set_key" : "std::bad_typeid",
   "name" : "std::bad_typeid",
   "record_kind" : "class",
   "referenced_type" : "type-1231",
   "self_type" : "type-1231",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo",
   "unique_id" : "_ZTSSt10bad_typeid",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt10bad_typeid"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt10bad_typeidD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt10bad_typeid4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::nothrow_t",
   "name" : "std::nothrow_t",
   "referenced_type" : "type-1232",
   "self_type" : "type-1232",
   "size" : 1,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt9nothrow_t"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "linker_set_key" : "std::bad_alloc",
   "name" : "std::bad_alloc",
   "record_kind" : "class",
   "referenced_type" : "type-1234",
   "self_type" : "type-1234",
   "size" : 8,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt9bad_alloc",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt9bad_alloc"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt9bad_allocD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9bad_alloc4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1234"
    }
   ],
   "linker_set_key" : "std::bad_array_new_length",
   "name" : "std::bad_array_new_length",
   "record_kind" : "class",
   "referenced_type" : "type-1235",
   "self_type" : "type-1235",
   "size" : 8,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt20bad_array_new_length",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt20bad_array_new_length"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt20bad_array_new_lengthD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt20bad_array_new_length4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1234"
    }
   ],
   "linker_set_key" : "std::bad_array_length",
   "name" : "std::bad_array_length",
   "record_kind" : "class",
   "referenced_type" : "type-1236",
   "self_type" : "type-1236",
   "size" : 8,
   "source_file" : "/external/libcxx/include/new",
   "unique_id" : "_ZTSSt16bad_array_length",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16bad_array_length"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16bad_array_lengthD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16bad_array_lengthD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt16bad_array_length4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-912"
    }
   ],
   "linker_set_key" : "std::tuple_size<std::pair<unsigned long, unsigned long> >",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long> >",
   "record_kind" : "class",
   "referenced_type" : "type-1238",
   "self_type" : "type-1238",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__110tuple_sizeINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__tuple_like<std::pair<unsigned long, unsigned long> >",
   "name" : "std::__tuple_like<std::pair<unsigned long, unsigned long> >",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "template_args" : [ "type-873" ],
   "unique_id" : "_ZTSNSt3__112__tuple_likeINS_4pairImmEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_indices<>",
   "name" : "std::__tuple_indices<>",
   "referenced_type" : "type-1240",
   "self_type" : "type-1240",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__115__tuple_indicesIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__integer_sequence<unsigned long>",
   "name" : "std::__integer_sequence<unsigned long>",
   "referenced_type" : "type-1241",
   "self_type" : "type-1241",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__118__integer_sequenceImJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__make_tuple_indices<0, 0>",
   "name" : "std::__make_tuple_indices<0, 0>",
   "referenced_type" : "type-1242",
   "self_type" : "type-1242",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__make_tuple_indicesILm0ELm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_types<>",
   "name" : "std::__tuple_types<>",
   "referenced_type" : "type-1243",
   "self_type" : "type-1243",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_typesIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, false>",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "referenced_type" : "type-1244",
   "self_type" : "type-1244",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, false>",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "referenced_type" : "type-1245",
   "self_type" : "type-1245",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, false, true>",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "referenced_type" : "type-1246",
   "self_type" : "type-1246",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<false, true, true>",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "referenced_type" : "type-1247",
   "self_type" : "type-1247",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb0ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, false>",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "referenced_type" : "type-1248",
   "self_type" : "type-1248",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, false>",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "referenced_type" : "type-1249",
   "self_type" : "type-1249",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, false, true>",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "referenced_type" : "type-1250",
   "self_type" : "type-1250",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__apply_cv_mf<true, true, true>",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "referenced_type" : "type-1251",
   "self_type" : "type-1251",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__113__apply_cv_mfILb1ELb1ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_sfinae_base",
   "name" : "std::__tuple_sfinae_base",
   "referenced_type" : "type-1252",
   "self_type" : "type-1252",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__119__tuple_sfinae_baseE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "std::__tuple_like_with_size_imp<true, std::tuple_size<std::pair<unsigned long, unsigned long> >, 2>",
   "name" : "std::__tuple_like_with_size_imp<true, std::tuple_size<std::pair<unsigned long, unsigned long> >, 2>",
   "referenced_type" : "type-1253",
   "self_type" : "type-1253",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "template_args" : [ "type-1238" ],
   "unique_id" : "_ZTSNSt3__126__tuple_like_with_size_impILb1ENS_10tuple_sizeINS_4pairImmEEEELm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_ctor_base<false, false>",
   "name" : "std::__sfinae_ctor_base<false, false>",
   "referenced_type" : "type-1254",
   "self_type" : "type-1254",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__118__sfinae_ctor_baseILb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_ctor_base<true, false>",
   "name" : "std::__sfinae_ctor_base<true, false>",
   "referenced_type" : "type-1260",
   "self_type" : "type-1260",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__118__sfinae_ctor_baseILb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_ctor_base<false, true>",
   "name" : "std::__sfinae_ctor_base<false, true>",
   "referenced_type" : "type-1266",
   "self_type" : "type-1266",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__118__sfinae_ctor_baseILb0ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<false, false>",
   "name" : "std::__sfinae_assign_base<false, false>",
   "referenced_type" : "type-1272",
   "self_type" : "type-1272",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb0ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<true, false>",
   "name" : "std::__sfinae_assign_base<true, false>",
   "referenced_type" : "type-1277",
   "self_type" : "type-1277",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb1ELb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__sfinae_assign_base<false, true>",
   "name" : "std::__sfinae_assign_base<false, true>",
   "referenced_type" : "type-1283",
   "self_type" : "type-1283",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple",
   "unique_id" : "_ZTSNSt3__120__sfinae_assign_baseILb0ELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__file_",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "__line_",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "__pred_",
     "field_offset" : 128,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "__msg_",
     "field_offset" : 192,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "std::__libcpp_debug_info",
   "name" : "std::__libcpp_debug_info",
   "referenced_type" : "type-1293",
   "self_type" : "type-1293",
   "size" : 32,
   "source_file" : "/external/libcxx/include/__debug",
   "unique_id" : "_ZTSNSt3__119__libcpp_debug_infoE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::piecewise_construct_t",
   "name" : "std::piecewise_construct_t",
   "referenced_type" : "type-1299",
   "self_type" : "type-1299",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__121piecewise_construct_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<0>",
   "name" : "std::__get_pair<0>",
   "referenced_type" : "type-1301",
   "self_type" : "type-1301",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__get_pair<1>",
   "name" : "std::__get_pair<1>",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110__get_pairILm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::in_place_t",
   "name" : "std::in_place_t",
   "referenced_type" : "type-1303",
   "self_type" : "type-1303",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__110in_place_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__murmur2_or_cityhash<unsigned long, 64>",
   "name" : "std::__murmur2_or_cityhash<unsigned long, 64>",
   "referenced_type" : "type-1307",
   "self_type" : "type-1307",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__121__murmur2_or_cityhashImLm64EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1309"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<std::_PairT, 2>",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "type-1308",
   "self_type" : "type-1308",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-1310" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashINS_6_PairTELm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<std::_PairT, unsigned long>",
   "name" : "std::unary_function<std::_PairT, unsigned long>",
   "referenced_type" : "type-1309",
   "self_type" : "type-1309",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-1310", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionINS_6_PairTEmEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "type-839"
    }
   ],
   "linker_set_key" : "std::_PairT",
   "name" : "std::_PairT",
   "referenced_type" : "type-1310",
   "self_type" : "type-1310",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__16_PairTE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1314"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long long, 1>",
   "name" : "std::__scalar_hash<long long, 1>",
   "referenced_type" : "type-1313",
   "self_type" : "type-1313",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIxLm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long long, unsigned long>",
   "name" : "std::unary_function<long long, unsigned long>",
   "referenced_type" : "type-1314",
   "self_type" : "type-1314",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIxmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1316"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<unsigned long long, 1>",
   "name" : "std::__scalar_hash<unsigned long long, 1>",
   "referenced_type" : "type-1315",
   "self_type" : "type-1315",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-995" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIyLm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long long, unsigned long>",
   "name" : "std::unary_function<unsigned long long, unsigned long>",
   "referenced_type" : "type-1316",
   "self_type" : "type-1316",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-995", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIymEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1318"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<__int128, 2>",
   "name" : "std::__scalar_hash<__int128, 2>",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-997" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashInLm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<__int128, unsigned long>",
   "name" : "std::unary_function<__int128, unsigned long>",
   "referenced_type" : "type-1318",
   "self_type" : "type-1318",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-997", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionInmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1320"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<unsigned __int128, 2>",
   "name" : "std::__scalar_hash<unsigned __int128, 2>",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-999" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIoLm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned __int128, unsigned long>",
   "name" : "std::unary_function<unsigned __int128, unsigned long>",
   "referenced_type" : "type-1320",
   "self_type" : "type-1320",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-999", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIomEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1322"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<float, 0>",
   "name" : "std::__scalar_hash<float, 0>",
   "referenced_type" : "type-1321",
   "self_type" : "type-1321",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIfLm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<float, unsigned long>",
   "name" : "std::unary_function<float, unsigned long>",
   "referenced_type" : "type-1322",
   "self_type" : "type-1322",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIfmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1326"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<double, 1>",
   "name" : "std::__scalar_hash<double, 1>",
   "referenced_type" : "type-1325",
   "self_type" : "type-1325",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIdLm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<double, unsigned long>",
   "name" : "std::unary_function<double, unsigned long>",
   "referenced_type" : "type-1326",
   "self_type" : "type-1326",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-81", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIdmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1330"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long double, 2>",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "type-1329",
   "self_type" : "type-1329",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIeLm2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long double, unsigned long>",
   "name" : "std::unary_function<long double, unsigned long>",
   "referenced_type" : "type-1330",
   "self_type" : "type-1330",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIemEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1334"
    }
   ],
   "linker_set_key" : "std::hash<bool>",
   "name" : "std::hash<bool>",
   "referenced_type" : "type-1333",
   "self_type" : "type-1333",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-906" ],
   "unique_id" : "_ZTSNSt3__14hashIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<bool, unsigned long>",
   "name" : "std::unary_function<bool, unsigned long>",
   "referenced_type" : "type-1334",
   "self_type" : "type-1334",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-906", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIbmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1338"
    }
   ],
   "linker_set_key" : "std::hash<char>",
   "name" : "std::hash<char>",
   "referenced_type" : "type-1337",
   "self_type" : "type-1337",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSNSt3__14hashIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char, unsigned long>",
   "name" : "std::unary_function<char, unsigned long>",
   "referenced_type" : "type-1338",
   "self_type" : "type-1338",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-21", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIcmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1342"
    }
   ],
   "linker_set_key" : "std::hash<signed char>",
   "name" : "std::hash<signed char>",
   "referenced_type" : "type-1341",
   "self_type" : "type-1341",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSNSt3__14hashIaEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<signed char, unsigned long>",
   "name" : "std::unary_function<signed char, unsigned long>",
   "referenced_type" : "type-1342",
   "self_type" : "type-1342",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-25", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIamEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1346"
    }
   ],
   "linker_set_key" : "std::hash<unsigned char>",
   "name" : "std::hash<unsigned char>",
   "referenced_type" : "type-1345",
   "self_type" : "type-1345",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__14hashIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned char, unsigned long>",
   "name" : "std::unary_function<unsigned char, unsigned long>",
   "referenced_type" : "type-1346",
   "self_type" : "type-1346",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIhmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1350"
    }
   ],
   "linker_set_key" : "std::hash<char16_t>",
   "name" : "std::hash<char16_t>",
   "referenced_type" : "type-1349",
   "self_type" : "type-1349",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-984" ],
   "unique_id" : "_ZTSNSt3__14hashIDsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char16_t, unsigned long>",
   "name" : "std::unary_function<char16_t, unsigned long>",
   "referenced_type" : "type-1350",
   "self_type" : "type-1350",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-984", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDsmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1354"
    }
   ],
   "linker_set_key" : "std::hash<char32_t>",
   "name" : "std::hash<char32_t>",
   "referenced_type" : "type-1353",
   "self_type" : "type-1353",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-986" ],
   "unique_id" : "_ZTSNSt3__14hashIDiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char32_t, unsigned long>",
   "name" : "std::unary_function<char32_t, unsigned long>",
   "referenced_type" : "type-1354",
   "self_type" : "type-1354",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-986", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDimEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1358"
    }
   ],
   "linker_set_key" : "std::hash<wchar_t>",
   "name" : "std::hash<wchar_t>",
   "referenced_type" : "type-1357",
   "self_type" : "type-1357",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-982" ],
   "unique_id" : "_ZTSNSt3__14hashIwEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<wchar_t, unsigned long>",
   "name" : "std::unary_function<wchar_t, unsigned long>",
   "referenced_type" : "type-1358",
   "self_type" : "type-1358",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-982", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIwmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1362"
    }
   ],
   "linker_set_key" : "std::hash<short>",
   "name" : "std::hash<short>",
   "referenced_type" : "type-1361",
   "self_type" : "type-1361",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__14hashIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<short, unsigned long>",
   "name" : "std::unary_function<short, unsigned long>",
   "referenced_type" : "type-1362",
   "self_type" : "type-1362",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-78", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIsmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1366"
    }
   ],
   "linker_set_key" : "std::hash<unsigned short>",
   "name" : "std::hash<unsigned short>",
   "referenced_type" : "type-1365",
   "self_type" : "type-1365",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__14hashItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned short, unsigned long>",
   "name" : "std::unary_function<unsigned short, unsigned long>",
   "referenced_type" : "type-1366",
   "self_type" : "type-1366",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-77", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionItmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1370"
    }
   ],
   "linker_set_key" : "std::hash<int>",
   "name" : "std::hash<int>",
   "referenced_type" : "type-1369",
   "self_type" : "type-1369",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__14hashIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<int, unsigned long>",
   "name" : "std::unary_function<int, unsigned long>",
   "referenced_type" : "type-1370",
   "self_type" : "type-1370",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-12", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIimEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1374"
    }
   ],
   "linker_set_key" : "std::hash<unsigned int>",
   "name" : "std::hash<unsigned int>",
   "referenced_type" : "type-1373",
   "self_type" : "type-1373",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-556" ],
   "unique_id" : "_ZTSNSt3__14hashIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned int, unsigned long>",
   "name" : "std::unary_function<unsigned int, unsigned long>",
   "referenced_type" : "type-1374",
   "self_type" : "type-1374",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-556", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIjmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1378"
    }
   ],
   "linker_set_key" : "std::hash<long>",
   "name" : "std::hash<long>",
   "referenced_type" : "type-1377",
   "self_type" : "type-1377",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__14hashIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long, unsigned long>",
   "name" : "std::unary_function<long, unsigned long>",
   "referenced_type" : "type-1378",
   "self_type" : "type-1378",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIlmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1382"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long>",
   "name" : "std::hash<unsigned long>",
   "referenced_type" : "type-1381",
   "self_type" : "type-1381",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-839" ],
   "unique_id" : "_ZTSNSt3__14hashImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long, unsigned long>",
   "name" : "std::unary_function<unsigned long, unsigned long>",
   "referenced_type" : "type-1382",
   "self_type" : "type-1382",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-839", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionImmEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1313"
    }
   ],
   "linker_set_key" : "std::hash<long long>",
   "name" : "std::hash<long long>",
   "referenced_type" : "type-1385",
   "self_type" : "type-1385",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__14hashIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1315"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long long>",
   "name" : "std::hash<unsigned long long>",
   "referenced_type" : "type-1386",
   "self_type" : "type-1386",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-995" ],
   "unique_id" : "_ZTSNSt3__14hashIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1317"
    }
   ],
   "linker_set_key" : "std::hash<__int128_t>",
   "name" : "std::hash<__int128_t>",
   "referenced_type" : "type-1387",
   "self_type" : "type-1387",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-997" ],
   "unique_id" : "_ZTSNSt3__14hashInEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1319"
    }
   ],
   "linker_set_key" : "std::hash<__uint128_t>",
   "name" : "std::hash<__uint128_t>",
   "referenced_type" : "type-1388",
   "self_type" : "type-1388",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-999" ],
   "unique_id" : "_ZTSNSt3__14hashIoEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1321"
    }
   ],
   "linker_set_key" : "std::hash<float>",
   "name" : "std::hash<float>",
   "referenced_type" : "type-1389",
   "self_type" : "type-1389",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__14hashIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1325"
    }
   ],
   "linker_set_key" : "std::hash<double>",
   "name" : "std::hash<double>",
   "referenced_type" : "type-1392",
   "self_type" : "type-1392",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__14hashIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1329"
    }
   ],
   "linker_set_key" : "std::hash<long double>",
   "name" : "std::hash<long double>",
   "referenced_type" : "type-1395",
   "self_type" : "type-1395",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__14hashIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1399"
    }
   ],
   "linker_set_key" : "std::hash<nullptr_t>",
   "name" : "std::hash<nullptr_t>",
   "referenced_type" : "type-1398",
   "self_type" : "type-1398",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-972" ],
   "unique_id" : "_ZTSNSt3__14hashIDnEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<nullptr_t, unsigned long>",
   "name" : "std::unary_function<nullptr_t, unsigned long>",
   "referenced_type" : "type-1399",
   "self_type" : "type-1399",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-972", "type-839" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDnmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<long, true>",
   "name" : "std::__libcpp_numeric_limits<long, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1406",
   "self_type" : "type-1406",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIlLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<int, true>",
   "name" : "std::__libcpp_numeric_limits<int, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1407",
   "self_type" : "type-1407",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<short, true>",
   "name" : "std::__libcpp_numeric_limits<short, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1408",
   "self_type" : "type-1408",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_compute_min<long, 63, true>",
   "name" : "std::__libcpp_compute_min<long, 63, true>",
   "referenced_type" : "type-1409",
   "self_type" : "type-1409",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_compute_minIlLi63ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<bool, true>",
   "name" : "std::__libcpp_numeric_limits<bool, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1410",
   "self_type" : "type-1410",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-906" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<float, true>",
   "name" : "std::__libcpp_numeric_limits<float, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1411",
   "self_type" : "type-1411",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIfLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<double, true>",
   "name" : "std::__libcpp_numeric_limits<double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1412",
   "self_type" : "type-1412",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-81" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIdLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<long double, true>",
   "name" : "std::__libcpp_numeric_limits<long double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1413",
   "self_type" : "type-1413",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIeLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1406"
    }
   ],
   "linker_set_key" : "std::numeric_limits<long>",
   "name" : "std::numeric_limits<long>",
   "record_kind" : "class",
   "referenced_type" : "type-1414",
   "self_type" : "type-1414",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1407"
    }
   ],
   "linker_set_key" : "std::numeric_limits<int>",
   "name" : "std::numeric_limits<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1415",
   "self_type" : "type-1415",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1408"
    }
   ],
   "linker_set_key" : "std::numeric_limits<short>",
   "name" : "std::numeric_limits<short>",
   "record_kind" : "class",
   "referenced_type" : "type-1416",
   "self_type" : "type-1416",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIsEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-1417",
   "self_type" : "type-1417",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-1418",
   "self_type" : "type-1418",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-1419",
   "self_type" : "type-1419",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1417"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1417"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-1420",
   "self_type" : "type-1420",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1418"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1418"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-1421",
   "self_type" : "type-1421",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-1422",
   "self_type" : "type-1422",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1422"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1422"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-1423",
   "self_type" : "type-1423",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-1424",
   "self_type" : "type-1424",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "type-995"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "type-1426"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "type-995"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "type-995"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "type-995"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "type-1427"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-1425",
   "self_type" : "type-1425",
   "size" : 4384,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "referenced_type" : "type-1428",
   "self_type" : "type-1428",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS12_aarch64_ctx"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-1428"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "type-1430"
    }
   ],
   "linker_set_key" : "fpsimd_context",
   "name" : "fpsimd_context",
   "referenced_type" : "type-1429",
   "self_type" : "type-1429",
   "size" : 528,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS14fpsimd_context"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-1428"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "type-995"
    }
   ],
   "linker_set_key" : "esr_context",
   "name" : "esr_context",
   "referenced_type" : "type-1431",
   "self_type" : "type-1431",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS11esr_context"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-1428"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "type-995"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "type-1433"
    }
   ],
   "linker_set_key" : "extra_context",
   "name" : "extra_context",
   "referenced_type" : "type-1432",
   "self_type" : "type-1432",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS13extra_context"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "type-1428"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "type-1435"
    }
   ],
   "linker_set_key" : "sve_context",
   "name" : "sve_context",
   "referenced_type" : "type-1434",
   "self_type" : "type-1434",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h",
   "unique_id" : "_ZTS11sve_context"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "type-1437"
    }
   ],
   "linker_set_key" : "sigset_t",
   "name" : "sigset_t",
   "referenced_type" : "type-1436",
   "self_type" : "type-1436",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/signal.h",
   "unique_id" : "_ZTS8sigset_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1439"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "type-1441"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "type-1436"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-1438",
   "self_type" : "type-1438",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "type-839"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-1443",
   "self_type" : "type-1443",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-1444",
   "self_type" : "type-1444",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "type-1446"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-1445",
   "self_type" : "type-1445",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1447"
    },
    {
     "field_name" : "_kill",
     "referenced_type" : "type-1448"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-1449"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-1450"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-1451"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-1452"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-1457"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-1458"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "record_kind" : "union",
   "referenced_type" : "type-1446",
   "self_type" : "type-1446",
   "size" : 112,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "referenced_type" : "type-1448",
   "self_type" : "type-1448",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1444"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "referenced_type" : "type-1449",
   "self_type" : "type-1449",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1444"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "referenced_type" : "type-1450",
   "self_type" : "type-1450",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut1_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "type-79"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "referenced_type" : "type-1451",
   "self_type" : "type-1451",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut2_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-8"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1453"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "referenced_type" : "type-1452",
   "self_type" : "type-1452",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-1454"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-1456"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "record_kind" : "union",
   "referenced_type" : "type-1453",
   "self_type" : "type-1453",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-1455"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "referenced_type" : "type-1454",
   "self_type" : "type-1454",
   "size" : 24,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-1455"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "referenced_type" : "type-1456",
   "self_type" : "type-1456",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut0_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "referenced_type" : "type-1457",
   "self_type" : "type-1457",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut4_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "type-556"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "referenced_type" : "type-1458",
   "self_type" : "type-1458",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut5_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-1444"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "type-1460"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-1459",
   "self_type" : "type-1459",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1189"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-1461"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "record_kind" : "union",
   "referenced_type" : "type-1460",
   "self_type" : "type-1460",
   "size" : 48,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-1462"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "referenced_type" : "type-1461",
   "self_type" : "type-1461",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-12"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1465"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-1436"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-1441"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-1464",
   "self_type" : "type-1464",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1439"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1466"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:79:20) at bionic/libc/include/bits/signal_types.h:79:20 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:79:20) at bionic/libc/include/bits/signal_types.h:79:20 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-1465",
   "self_type" : "type-1465",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "type-12"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "type-1470"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "type-1436"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "type-1441"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-1469",
   "self_type" : "type-1469",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1439"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1466"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:80:22) at bionic/libc/include/bits/signal_types.h:80:22 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:80:22) at bionic/libc/include/bits/signal_types.h:80:22 <Spelling=bionic/libc/include/bits/signal_types.h:72:3>",
   "record_kind" : "union",
   "referenced_type" : "type-1470",
   "self_type" : "type-1470",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-1472"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "type-839"
    }
   ],
   "linker_set_key" : "user_regs_struct",
   "name" : "user_regs_struct",
   "referenced_type" : "type-1471",
   "self_type" : "type-1471",
   "size" : 272,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_regs_struct"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "type-1430"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "referenced_type" : "type-1473",
   "self_type" : "type-1473",
   "size" : 528,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_fpsimd_struct"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "type-1475"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "type-1443"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "type-1476"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "type-1477"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "type-1425"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-1474",
   "self_type" : "type-1474",
   "size" : 4560,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-1436"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-1436"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:117:3) at bionic/libc/include/sys/ucontext.h:117:3",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:117:3) at bionic/libc/include/sys/ucontext.h:117:3",
   "record_kind" : "union",
   "referenced_type" : "type-1476",
   "self_type" : "type-1476",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:117:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-1181"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-1480",
   "self_type" : "type-1480",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-1482",
   "self_type" : "type-1482",
   "size" : 56,
   "source_file" : "/bionic/libc/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-1484"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "type-1484"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-1483",
   "self_type" : "type-1483",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less<void>",
   "name" : "std::less<void>",
   "referenced_type" : "type-1488",
   "self_type" : "type-1488",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__14lessIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__invoke_void_return_wrapper<void>",
   "name" : "std::__invoke_void_return_wrapper<void>",
   "referenced_type" : "type-1489",
   "self_type" : "type-1489",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__128__invoke_void_return_wrapperIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator_arg_t",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "type-1490",
   "self_type" : "type-1490",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "unique_id" : "_ZTSNSt3__115allocator_arg_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::input_iterator_tag",
   "name" : "std::input_iterator_tag",
   "referenced_type" : "type-1492",
   "self_type" : "type-1492",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__118input_iterator_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::output_iterator_tag",
   "name" : "std::output_iterator_tag",
   "referenced_type" : "type-1493",
   "self_type" : "type-1493",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__119output_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1492"
    }
   ],
   "linker_set_key" : "std::forward_iterator_tag",
   "name" : "std::forward_iterator_tag",
   "referenced_type" : "type-1494",
   "self_type" : "type-1494",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__120forward_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1494"
    }
   ],
   "linker_set_key" : "std::bidirectional_iterator_tag",
   "name" : "std::bidirectional_iterator_tag",
   "referenced_type" : "type-1495",
   "self_type" : "type-1495",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__126bidirectional_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1495"
    }
   ],
   "linker_set_key" : "std::random_access_iterator_tag",
   "name" : "std::random_access_iterator_tag",
   "referenced_type" : "type-1496",
   "self_type" : "type-1496",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__126random_access_iterator_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "name" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "referenced_type" : "type-1497",
   "self_type" : "type-1497",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-1493", "type-9", "type-9", "type-9", "type-9" ],
   "unique_id" : "_ZTSNSt3__18iteratorINS_19output_iterator_tagEvvvvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::tuple<>",
   "name" : "std::tuple<>",
   "record_kind" : "class",
   "referenced_type" : "type-1498",
   "self_type" : "type-1498",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__15tupleIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__ignore_t<unsigned char>",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "type-1501",
   "self_type" : "type-1501",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__110__ignore_tIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_equal<0>",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "type-1503",
   "self_type" : "type-1503",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_equalILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_less<0>",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "type-1504",
   "self_type" : "type-1504",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__112__tuple_lessILm0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_cat_return<>",
   "name" : "std::__tuple_cat_return<>",
   "referenced_type" : "type-1505",
   "self_type" : "type-1505",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__118__tuple_cat_returnIJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "std::__libcpp_refstring",
   "name" : "std::__libcpp_refstring",
   "record_kind" : "class",
   "referenced_type" : "type-1506",
   "self_type" : "type-1506",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSNSt3__118__libcpp_refstringE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 64,
     "referenced_type" : "type-1506"
    }
   ],
   "linker_set_key" : "std::logic_error",
   "name" : "std::logic_error",
   "record_kind" : "class",
   "referenced_type" : "type-1509",
   "self_type" : "type-1509",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11logic_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11logic_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 64,
     "referenced_type" : "type-1506"
    }
   ],
   "linker_set_key" : "std::runtime_error",
   "name" : "std::runtime_error",
   "record_kind" : "class",
   "referenced_type" : "type-1510",
   "self_type" : "type-1510",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt13runtime_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13runtime_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1509"
    }
   ],
   "linker_set_key" : "std::domain_error",
   "name" : "std::domain_error",
   "record_kind" : "class",
   "referenced_type" : "type-1511",
   "self_type" : "type-1511",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12domain_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12domain_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1509"
    }
   ],
   "linker_set_key" : "std::invalid_argument",
   "name" : "std::invalid_argument",
   "record_kind" : "class",
   "referenced_type" : "type-1516",
   "self_type" : "type-1516",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt16invalid_argument",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16invalid_argument"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1509"
    }
   ],
   "linker_set_key" : "std::length_error",
   "name" : "std::length_error",
   "record_kind" : "class",
   "referenced_type" : "type-1518",
   "self_type" : "type-1518",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12length_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12length_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1509"
    }
   ],
   "linker_set_key" : "std::out_of_range",
   "name" : "std::out_of_range",
   "record_kind" : "class",
   "referenced_type" : "type-1520",
   "self_type" : "type-1520",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12out_of_range",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12out_of_range"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1510"
    }
   ],
   "linker_set_key" : "std::range_error",
   "name" : "std::range_error",
   "record_kind" : "class",
   "referenced_type" : "type-1522",
   "self_type" : "type-1522",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11range_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11range_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1510"
    }
   ],
   "linker_set_key" : "std::overflow_error",
   "name" : "std::overflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1524",
   "self_type" : "type-1524",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt14overflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt14overflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1510"
    }
   ],
   "linker_set_key" : "std::underflow_error",
   "name" : "std::underflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1526",
   "self_type" : "type-1526",
   "size" : 16,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt15underflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt15underflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-1535"
    }
   ],
   "linker_set_key" : "std::atomic_flag",
   "name" : "std::atomic_flag",
   "referenced_type" : "type-1534",
   "self_type" : "type-1534",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic",
   "unique_id" : "_ZTSNSt3__111atomic_flagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<void>",
   "name" : "std::allocator<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1539",
   "self_type" : "type-1539",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__19allocatorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<const void>",
   "name" : "std::allocator<const void>",
   "record_kind" : "class",
   "referenced_type" : "type-1540",
   "self_type" : "type-1540",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-838" ],
   "unique_id" : "_ZTSNSt3__19allocatorIKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__second_tag",
   "name" : "std::__second_tag",
   "referenced_type" : "type-1541",
   "self_type" : "type-1541",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__second_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "type-839"
    }
   ],
   "linker_set_key" : "std::__destruct_n",
   "name" : "std::__destruct_n",
   "referenced_type" : "type-1542",
   "self_type" : "type-1542",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__destruct_nE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "linker_set_key" : "std::bad_weak_ptr",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-1545",
   "self_type" : "type-1545",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112bad_weak_ptrE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "std::__shared_count",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "type-1546",
   "self_type" : "type-1546",
   "size" : 16,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114__shared_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1546"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__shared_weak_owners_",
     "field_offset" : 128,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "std::__shared_weak_count",
   "name" : "std::__shared_weak_count",
   "record_kind" : "class",
   "referenced_type" : "type-1550",
   "self_type" : "type-1550",
   "size" : 24,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__119__shared_weak_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__119__shared_weak_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__119__shared_weak_count21__on_zero_shared_weakEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "name" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "record_kind" : "class",
   "referenced_type" : "type-1554",
   "self_type" : "type-1554",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-1555" ],
   "unique_id" : "_ZTSNSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::owner_less<void>",
   "name" : "std::owner_less<void>",
   "referenced_type" : "type-1556",
   "self_type" : "type-1556",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__110owner_lessIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__lx",
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "std::__sp_mut",
   "name" : "std::__sp_mut",
   "record_kind" : "class",
   "referenced_type" : "type-1557",
   "self_type" : "type-1557",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__18__sp_mutE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "type-1559"
    }
   ],
   "linker_set_key" : "std::pointer_safety",
   "name" : "std::pointer_safety",
   "referenced_type" : "type-1558",
   "self_type" : "type-1558",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114pointer_safetyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::plus<void>",
   "name" : "std::plus<void>",
   "referenced_type" : "type-1563",
   "self_type" : "type-1563",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__14plusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::minus<void>",
   "name" : "std::minus<void>",
   "referenced_type" : "type-1564",
   "self_type" : "type-1564",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__15minusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::multiplies<void>",
   "name" : "std::multiplies<void>",
   "referenced_type" : "type-1565",
   "self_type" : "type-1565",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__110multipliesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::divides<void>",
   "name" : "std::divides<void>",
   "referenced_type" : "type-1566",
   "self_type" : "type-1566",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__17dividesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::modulus<void>",
   "name" : "std::modulus<void>",
   "referenced_type" : "type-1567",
   "self_type" : "type-1567",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__17modulusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::negate<void>",
   "name" : "std::negate<void>",
   "referenced_type" : "type-1568",
   "self_type" : "type-1568",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__16negateIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::equal_to<void>",
   "name" : "std::equal_to<void>",
   "referenced_type" : "type-1569",
   "self_type" : "type-1569",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__18equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::not_equal_to<void>",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "type-1570",
   "self_type" : "type-1570",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__112not_equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater<void>",
   "name" : "std::greater<void>",
   "referenced_type" : "type-1571",
   "self_type" : "type-1571",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__17greaterIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater_equal<void>",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "type-1572",
   "self_type" : "type-1572",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__113greater_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less_equal<void>",
   "name" : "std::less_equal<void>",
   "referenced_type" : "type-1573",
   "self_type" : "type-1573",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__110less_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_and<void>",
   "name" : "std::logical_and<void>",
   "referenced_type" : "type-1574",
   "self_type" : "type-1574",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__111logical_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_or<void>",
   "name" : "std::logical_or<void>",
   "referenced_type" : "type-1575",
   "self_type" : "type-1575",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__110logical_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_not<void>",
   "name" : "std::logical_not<void>",
   "referenced_type" : "type-1576",
   "self_type" : "type-1576",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__111logical_notIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_and<void>",
   "name" : "std::bit_and<void>",
   "referenced_type" : "type-1577",
   "self_type" : "type-1577",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__17bit_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_or<void>",
   "name" : "std::bit_or<void>",
   "referenced_type" : "type-1578",
   "self_type" : "type-1578",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__16bit_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_xor<void>",
   "name" : "std::bit_xor<void>",
   "referenced_type" : "type-1579",
   "self_type" : "type-1579",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__17bit_xorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_not<void>",
   "name" : "std::bit_not<void>",
   "referenced_type" : "type-1580",
   "self_type" : "type-1580",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-9" ],
   "unique_id" : "_ZTSNSt3__17bit_notIvEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1214"
    }
   ],
   "linker_set_key" : "std::bad_function_call",
   "name" : "std::bad_function_call",
   "record_kind" : "class",
   "referenced_type" : "type-1581",
   "self_type" : "type-1581",
   "size" : 8,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__117bad_function_callE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__117bad_function_callE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<1>",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "type-1582",
   "self_type" : "type-1582",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<2>",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "type-1583",
   "self_type" : "type-1583",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<3>",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "type-1584",
   "self_type" : "type-1584",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi3EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<4>",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "type-1585",
   "self_type" : "type-1585",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<5>",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "type-1586",
   "self_type" : "type-1586",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi5EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<6>",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "type-1587",
   "self_type" : "type-1587",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi6EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<7>",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "type-1588",
   "self_type" : "type-1588",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi7EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<8>",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "type-1589",
   "self_type" : "type-1589",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<9>",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "type-1590",
   "self_type" : "type-1590",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi9EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<10>",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "type-1591",
   "self_type" : "type-1591",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi10EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__less<unsigned long, unsigned long>",
   "name" : "std::__less<unsigned long, unsigned long>",
   "referenced_type" : "type-1602",
   "self_type" : "type-1602",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-839", "type-839" ],
   "unique_id" : "_ZTSNSt3__16__lessImmEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__p_",
     "referenced_type" : "type-1610"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<long>",
   "name" : "std::uniform_int_distribution<long>",
   "record_kind" : "class",
   "referenced_type" : "type-1609",
   "self_type" : "type-1609",
   "size" : 16,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIlEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__a_",
     "referenced_type" : "type-79"
    },
    {
     "access" : "private",
     "field_name" : "__b_",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<long>::param_type",
   "name" : "std::uniform_int_distribution<long>::param_type",
   "record_kind" : "class",
   "referenced_type" : "type-1610",
   "self_type" : "type-1610",
   "size" : 16,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIlE10param_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__return_temporary_buffer",
   "name" : "std::__return_temporary_buffer",
   "referenced_type" : "type-1611",
   "self_type" : "type-1611",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__125__return_temporary_bufferE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<>",
   "name" : "skstd::index_sequence<>",
   "referenced_type" : "type-1612",
   "self_type" : "type-1612",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<0>",
   "name" : "skstd::index_sequence<0>",
   "referenced_type" : "type-1613",
   "self_type" : "type-1613",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJLm0EEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1612"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<0>",
   "name" : "skstd::make_index_sequence<0>",
   "referenced_type" : "type-1614",
   "self_type" : "type-1614",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILm0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1613"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<1>",
   "name" : "skstd::make_index_sequence<1>",
   "referenced_type" : "type-1615",
   "self_type" : "type-1615",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILm1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "name" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "referenced_type" : "type-1616",
   "self_type" : "type-1616",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-883", "type-1617", "type-1618", "type-1619" ],
   "unique_id" : "_ZTSN9sktfitsin7Private6SkTMuxILb1ELb1ENS0_23SkTFitsIn_Signed2SignedIsiEENS0_25SkTFitsIn_Signed2UnsignedIsiEENS0_25SkTFitsIn_Unsigned2SignedIsiEENS0_26SkTFitsIn_Unsigned2UnsigedIsiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-923"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "referenced_type" : "type-1620",
   "self_type" : "type-1620",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-12" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIsiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-921"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "referenced_type" : "type-1621",
   "self_type" : "type-1621",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-12", "type-78" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIisEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "name" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "referenced_type" : "type-1622",
   "self_type" : "type-1622",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-12" ],
   "unique_id" : "_ZTSN9sktfitsin7Private9SkTFitsInIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<int, false>",
   "name" : "sktfitsin::Private::underlying_type<int, false>",
   "referenced_type" : "type-1623",
   "self_type" : "type-1623",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIiLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<short, false>",
   "name" : "sktfitsin::Private::underlying_type<short, false>",
   "referenced_type" : "type-1624",
   "self_type" : "type-1624",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIsLb0EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fFloat",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fSignBitInt",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkFloatIntUnion",
   "name" : "SkFloatIntUnion",
   "record_kind" : "union",
   "referenced_type" : "type-1633",
   "self_type" : "type-1633",
   "size" : 4,
   "source_file" : "/external/skia/include/private/SkFloatBits.h",
   "unique_id" : "_ZTS15SkFloatIntUnion"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1635"
    }
   ],
   "linker_set_key" : "int8x8x2_t",
   "name" : "int8x8x2_t",
   "referenced_type" : "type-1634",
   "self_type" : "type-1634",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1638"
    }
   ],
   "linker_set_key" : "int8x16x2_t",
   "name" : "int8x16x2_t",
   "referenced_type" : "type-1637",
   "self_type" : "type-1637",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1641"
    }
   ],
   "linker_set_key" : "int16x4x2_t",
   "name" : "int16x4x2_t",
   "referenced_type" : "type-1640",
   "self_type" : "type-1640",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1644"
    }
   ],
   "linker_set_key" : "int16x8x2_t",
   "name" : "int16x8x2_t",
   "referenced_type" : "type-1643",
   "self_type" : "type-1643",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1647"
    }
   ],
   "linker_set_key" : "int32x2x2_t",
   "name" : "int32x2x2_t",
   "referenced_type" : "type-1646",
   "self_type" : "type-1646",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1650"
    }
   ],
   "linker_set_key" : "int32x4x2_t",
   "name" : "int32x4x2_t",
   "referenced_type" : "type-1649",
   "self_type" : "type-1649",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1653"
    }
   ],
   "linker_set_key" : "int64x1x2_t",
   "name" : "int64x1x2_t",
   "referenced_type" : "type-1652",
   "self_type" : "type-1652",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1656"
    }
   ],
   "linker_set_key" : "int64x2x2_t",
   "name" : "int64x2x2_t",
   "referenced_type" : "type-1655",
   "self_type" : "type-1655",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1659"
    }
   ],
   "linker_set_key" : "uint8x8x2_t",
   "name" : "uint8x8x2_t",
   "referenced_type" : "type-1658",
   "self_type" : "type-1658",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11uint8x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1662"
    }
   ],
   "linker_set_key" : "uint8x16x2_t",
   "name" : "uint8x16x2_t",
   "referenced_type" : "type-1661",
   "self_type" : "type-1661",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint8x16x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1665"
    }
   ],
   "linker_set_key" : "uint16x4x2_t",
   "name" : "uint16x4x2_t",
   "referenced_type" : "type-1664",
   "self_type" : "type-1664",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1668"
    }
   ],
   "linker_set_key" : "uint16x8x2_t",
   "name" : "uint16x8x2_t",
   "referenced_type" : "type-1667",
   "self_type" : "type-1667",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1671"
    }
   ],
   "linker_set_key" : "uint32x2x2_t",
   "name" : "uint32x2x2_t",
   "referenced_type" : "type-1670",
   "self_type" : "type-1670",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1674"
    }
   ],
   "linker_set_key" : "uint32x4x2_t",
   "name" : "uint32x4x2_t",
   "referenced_type" : "type-1673",
   "self_type" : "type-1673",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1677"
    }
   ],
   "linker_set_key" : "uint64x1x2_t",
   "name" : "uint64x1x2_t",
   "referenced_type" : "type-1676",
   "self_type" : "type-1676",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x1x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1680"
    }
   ],
   "linker_set_key" : "uint64x2x2_t",
   "name" : "uint64x2x2_t",
   "referenced_type" : "type-1679",
   "self_type" : "type-1679",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x2x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1683"
    }
   ],
   "linker_set_key" : "float16x4x2_t",
   "name" : "float16x4x2_t",
   "referenced_type" : "type-1682",
   "self_type" : "type-1682",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1686"
    }
   ],
   "linker_set_key" : "float16x8x2_t",
   "name" : "float16x8x2_t",
   "referenced_type" : "type-1685",
   "self_type" : "type-1685",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1689"
    }
   ],
   "linker_set_key" : "float32x2x2_t",
   "name" : "float32x2x2_t",
   "referenced_type" : "type-1688",
   "self_type" : "type-1688",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1692"
    }
   ],
   "linker_set_key" : "float32x4x2_t",
   "name" : "float32x4x2_t",
   "referenced_type" : "type-1691",
   "self_type" : "type-1691",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1695"
    }
   ],
   "linker_set_key" : "float64x1x2_t",
   "name" : "float64x1x2_t",
   "referenced_type" : "type-1694",
   "self_type" : "type-1694",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x1x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1698"
    }
   ],
   "linker_set_key" : "float64x2x2_t",
   "name" : "float64x2x2_t",
   "referenced_type" : "type-1697",
   "self_type" : "type-1697",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x2x2_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jclass"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1701"
    }
   ],
   "linker_set_key" : "poly8x8x2_t",
   "name" : "poly8x8x2_t",
   "referenced_type" : "type-1700",
   "self_type" : "type-1700",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1704"
    }
   ],
   "linker_set_key" : "poly8x16x2_t",
   "name" : "poly8x16x2_t",
   "referenced_type" : "type-1703",
   "self_type" : "type-1703",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1707"
    }
   ],
   "linker_set_key" : "poly16x4x2_t",
   "name" : "poly16x4x2_t",
   "referenced_type" : "type-1706",
   "self_type" : "type-1706",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1710"
    }
   ],
   "linker_set_key" : "poly16x8x2_t",
   "name" : "poly16x8x2_t",
   "referenced_type" : "type-1709",
   "self_type" : "type-1709",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1713"
    }
   ],
   "linker_set_key" : "poly64x1x2_t",
   "name" : "poly64x1x2_t",
   "referenced_type" : "type-1712",
   "self_type" : "type-1712",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x1x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1716"
    }
   ],
   "linker_set_key" : "poly64x2x2_t",
   "name" : "poly64x2x2_t",
   "referenced_type" : "type-1715",
   "self_type" : "type-1715",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x2x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1719"
    }
   ],
   "linker_set_key" : "int8x8x3_t",
   "name" : "int8x8x3_t",
   "referenced_type" : "type-1718",
   "self_type" : "type-1718",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1722"
    }
   ],
   "linker_set_key" : "int8x16x3_t",
   "name" : "int8x16x3_t",
   "referenced_type" : "type-1721",
   "self_type" : "type-1721",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1725"
    }
   ],
   "linker_set_key" : "int16x4x3_t",
   "name" : "int16x4x3_t",
   "referenced_type" : "type-1724",
   "self_type" : "type-1724",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x3_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jobject"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "type-368",
   "self_type" : "type-368",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jstring"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "type-387",
   "self_type" : "type-387",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jarray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "type-391",
   "self_type" : "type-391",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jobjectArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "type-399",
   "self_type" : "type-399",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14_jbooleanArray"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-5"
    }
   ],
   "linker_set_key" : "_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JNIEnv"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "type-403",
   "self_type" : "type-403",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jbyteArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "type-407",
   "self_type" : "type-407",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jcharArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "type-411",
   "self_type" : "type-411",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jshortArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "type-415",
   "self_type" : "type-415",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS10_jintArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "type-419",
   "self_type" : "type-419",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jlongArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jfloatArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-387"
    }
   ],
   "linker_set_key" : "_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jdoubleArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jthrowable"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "type-515",
   "self_type" : "type-515",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS15JNINativeMethod"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "type-524",
   "self_type" : "type-524",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JavaVM"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 192,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 256,
     "referenced_type" : "type-530"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 320,
     "referenced_type" : "type-528"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 384,
     "referenced_type" : "type-533"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 448,
     "referenced_type" : "type-530"
    }
   ],
   "linker_set_key" : "JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "type-527",
   "self_type" : "type-527",
   "size" : 64,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNIInvokeInterface"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-558"
    }
   ],
   "linker_set_key" : "int16x8x3_t",
   "name" : "int16x8x3_t",
   "referenced_type" : "type-557",
   "self_type" : "type-557",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-561"
    }
   ],
   "linker_set_key" : "int32x2x3_t",
   "name" : "int32x2x3_t",
   "referenced_type" : "type-560",
   "self_type" : "type-560",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-564"
    }
   ],
   "linker_set_key" : "int32x4x3_t",
   "name" : "int32x4x3_t",
   "referenced_type" : "type-563",
   "self_type" : "type-563",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-567"
    }
   ],
   "linker_set_key" : "int64x1x3_t",
   "name" : "int64x1x3_t",
   "referenced_type" : "type-566",
   "self_type" : "type-566",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-570"
    }
   ],
   "linker_set_key" : "int64x2x3_t",
   "name" : "int64x2x3_t",
   "referenced_type" : "type-569",
   "self_type" : "type-569",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-573"
    }
   ],
   "linker_set_key" : "uint8x8x3_t",
   "name" : "uint8x8x3_t",
   "referenced_type" : "type-572",
   "self_type" : "type-572",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11uint8x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-576"
    }
   ],
   "linker_set_key" : "uint8x16x3_t",
   "name" : "uint8x16x3_t",
   "referenced_type" : "type-575",
   "self_type" : "type-575",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint8x16x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-579"
    }
   ],
   "linker_set_key" : "uint16x4x3_t",
   "name" : "uint16x4x3_t",
   "referenced_type" : "type-578",
   "self_type" : "type-578",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-582"
    }
   ],
   "linker_set_key" : "uint16x8x3_t",
   "name" : "uint16x8x3_t",
   "referenced_type" : "type-581",
   "self_type" : "type-581",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-585"
    }
   ],
   "linker_set_key" : "uint32x2x3_t",
   "name" : "uint32x2x3_t",
   "referenced_type" : "type-584",
   "self_type" : "type-584",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-588"
    }
   ],
   "linker_set_key" : "uint32x4x3_t",
   "name" : "uint32x4x3_t",
   "referenced_type" : "type-587",
   "self_type" : "type-587",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-591"
    }
   ],
   "linker_set_key" : "uint64x1x3_t",
   "name" : "uint64x1x3_t",
   "referenced_type" : "type-590",
   "self_type" : "type-590",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x1x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-594"
    }
   ],
   "linker_set_key" : "uint64x2x3_t",
   "name" : "uint64x2x3_t",
   "referenced_type" : "type-593",
   "self_type" : "type-593",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-597"
    }
   ],
   "linker_set_key" : "float16x4x3_t",
   "name" : "float16x4x3_t",
   "referenced_type" : "type-596",
   "self_type" : "type-596",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-600"
    }
   ],
   "linker_set_key" : "float16x8x3_t",
   "name" : "float16x8x3_t",
   "referenced_type" : "type-599",
   "self_type" : "type-599",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-603"
    }
   ],
   "linker_set_key" : "float32x2x3_t",
   "name" : "float32x2x3_t",
   "referenced_type" : "type-602",
   "self_type" : "type-602",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-606"
    }
   ],
   "linker_set_key" : "float32x4x3_t",
   "name" : "float32x4x3_t",
   "referenced_type" : "type-605",
   "self_type" : "type-605",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-609"
    }
   ],
   "linker_set_key" : "float64x1x3_t",
   "name" : "float64x1x3_t",
   "referenced_type" : "type-608",
   "self_type" : "type-608",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x1x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-612"
    }
   ],
   "linker_set_key" : "float64x2x3_t",
   "name" : "float64x2x3_t",
   "referenced_type" : "type-611",
   "self_type" : "type-611",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-615"
    }
   ],
   "linker_set_key" : "poly8x8x3_t",
   "name" : "poly8x8x3_t",
   "referenced_type" : "type-614",
   "self_type" : "type-614",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-618"
    }
   ],
   "linker_set_key" : "poly8x16x3_t",
   "name" : "poly8x16x3_t",
   "referenced_type" : "type-617",
   "self_type" : "type-617",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-621"
    }
   ],
   "linker_set_key" : "poly16x4x3_t",
   "name" : "poly16x4x3_t",
   "referenced_type" : "type-620",
   "self_type" : "type-620",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-624"
    }
   ],
   "linker_set_key" : "poly16x8x3_t",
   "name" : "poly16x8x3_t",
   "referenced_type" : "type-623",
   "self_type" : "type-623",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-627"
    }
   ],
   "linker_set_key" : "poly64x1x3_t",
   "name" : "poly64x1x3_t",
   "referenced_type" : "type-626",
   "self_type" : "type-626",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x1x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-630"
    }
   ],
   "linker_set_key" : "poly64x2x3_t",
   "name" : "poly64x2x3_t",
   "referenced_type" : "type-629",
   "self_type" : "type-629",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-633"
    }
   ],
   "linker_set_key" : "int8x8x4_t",
   "name" : "int8x8x4_t",
   "referenced_type" : "type-632",
   "self_type" : "type-632",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-636"
    }
   ],
   "linker_set_key" : "int8x16x4_t",
   "name" : "int8x16x4_t",
   "referenced_type" : "type-635",
   "self_type" : "type-635",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-639"
    }
   ],
   "linker_set_key" : "int16x4x4_t",
   "name" : "int16x4x4_t",
   "referenced_type" : "type-638",
   "self_type" : "type-638",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-642"
    }
   ],
   "linker_set_key" : "int16x8x4_t",
   "name" : "int16x8x4_t",
   "referenced_type" : "type-641",
   "self_type" : "type-641",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-645"
    }
   ],
   "linker_set_key" : "int32x2x4_t",
   "name" : "int32x2x4_t",
   "referenced_type" : "type-644",
   "self_type" : "type-644",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-648"
    }
   ],
   "linker_set_key" : "int32x4x4_t",
   "name" : "int32x4x4_t",
   "referenced_type" : "type-647",
   "self_type" : "type-647",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-651"
    }
   ],
   "linker_set_key" : "int64x1x4_t",
   "name" : "int64x1x4_t",
   "referenced_type" : "type-650",
   "self_type" : "type-650",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "int64x2x4_t",
   "name" : "int64x2x4_t",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-657"
    }
   ],
   "linker_set_key" : "uint8x8x4_t",
   "name" : "uint8x8x4_t",
   "referenced_type" : "type-656",
   "self_type" : "type-656",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11uint8x8x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-660"
    }
   ],
   "linker_set_key" : "uint8x16x4_t",
   "name" : "uint8x16x4_t",
   "referenced_type" : "type-659",
   "self_type" : "type-659",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint8x16x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-663"
    }
   ],
   "linker_set_key" : "uint16x4x4_t",
   "name" : "uint16x4x4_t",
   "referenced_type" : "type-662",
   "self_type" : "type-662",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-666"
    }
   ],
   "linker_set_key" : "uint16x8x4_t",
   "name" : "uint16x8x4_t",
   "referenced_type" : "type-665",
   "self_type" : "type-665",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-669"
    }
   ],
   "linker_set_key" : "uint32x2x4_t",
   "name" : "uint32x2x4_t",
   "referenced_type" : "type-668",
   "self_type" : "type-668",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-672"
    }
   ],
   "linker_set_key" : "uint32x4x4_t",
   "name" : "uint32x4x4_t",
   "referenced_type" : "type-671",
   "self_type" : "type-671",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-675"
    }
   ],
   "linker_set_key" : "uint64x1x4_t",
   "name" : "uint64x1x4_t",
   "referenced_type" : "type-674",
   "self_type" : "type-674",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-678"
    }
   ],
   "linker_set_key" : "uint64x2x4_t",
   "name" : "uint64x2x4_t",
   "referenced_type" : "type-677",
   "self_type" : "type-677",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x2x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-681"
    }
   ],
   "linker_set_key" : "float16x4x4_t",
   "name" : "float16x4x4_t",
   "referenced_type" : "type-680",
   "self_type" : "type-680",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-684"
    }
   ],
   "linker_set_key" : "float16x8x4_t",
   "name" : "float16x8x4_t",
   "referenced_type" : "type-683",
   "self_type" : "type-683",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-687"
    }
   ],
   "linker_set_key" : "float32x2x4_t",
   "name" : "float32x2x4_t",
   "referenced_type" : "type-686",
   "self_type" : "type-686",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-690"
    }
   ],
   "linker_set_key" : "float32x4x4_t",
   "name" : "float32x4x4_t",
   "referenced_type" : "type-689",
   "self_type" : "type-689",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-693"
    }
   ],
   "linker_set_key" : "float64x1x4_t",
   "name" : "float64x1x4_t",
   "referenced_type" : "type-692",
   "self_type" : "type-692",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-696"
    }
   ],
   "linker_set_key" : "float64x2x4_t",
   "name" : "float64x2x4_t",
   "referenced_type" : "type-695",
   "self_type" : "type-695",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float64x2x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-699"
    }
   ],
   "linker_set_key" : "poly8x8x4_t",
   "name" : "poly8x8x4_t",
   "referenced_type" : "type-698",
   "self_type" : "type-698",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 192,
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 320,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 384,
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 448,
     "referenced_type" : "type-28"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 512,
     "referenced_type" : "type-32"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 576,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 640,
     "referenced_type" : "type-39"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 704,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 768,
     "referenced_type" : "type-43"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 832,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 896,
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 960,
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 1024,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 1088,
     "referenced_type" : "type-53"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 1152,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 1216,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 1280,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 1344,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 1408,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 1472,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 1536,
     "referenced_type" : "type-63"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 1600,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 1664,
     "referenced_type" : "type-57"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 1728,
     "referenced_type" : "type-65"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 1792,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 1856,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 1920,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 1984,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 2048,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 2112,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 2176,
     "referenced_type" : "type-88"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 2240,
     "referenced_type" : "type-90"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 2304,
     "referenced_type" : "type-93"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 2368,
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 2432,
     "referenced_type" : "type-97"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 2496,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 2560,
     "referenced_type" : "type-102"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 2624,
     "referenced_type" : "type-104"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 2688,
     "referenced_type" : "type-107"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 2752,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 2816,
     "referenced_type" : "type-111"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 2880,
     "referenced_type" : "type-114"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 2944,
     "referenced_type" : "type-116"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 3008,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 3072,
     "referenced_type" : "type-121"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 3136,
     "referenced_type" : "type-123"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 3200,
     "referenced_type" : "type-125"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 3264,
     "referenced_type" : "type-128"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 3328,
     "referenced_type" : "type-130"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 3392,
     "referenced_type" : "type-132"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 3456,
     "referenced_type" : "type-135"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 3520,
     "referenced_type" : "type-137"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 3584,
     "referenced_type" : "type-139"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 3648,
     "referenced_type" : "type-142"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 3712,
     "referenced_type" : "type-144"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 3776,
     "referenced_type" : "type-146"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 3840,
     "referenced_type" : "type-149"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 3904,
     "referenced_type" : "type-151"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 3968,
     "referenced_type" : "type-153"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 4032,
     "referenced_type" : "type-156"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 4096,
     "referenced_type" : "type-158"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 4160,
     "referenced_type" : "type-160"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 4224,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 4288,
     "referenced_type" : "type-165"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 4352,
     "referenced_type" : "type-167"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 4416,
     "referenced_type" : "type-170"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 4480,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 4544,
     "referenced_type" : "type-174"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 4608,
     "referenced_type" : "type-177"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 4672,
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 4736,
     "referenced_type" : "type-181"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 4800,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 4864,
     "referenced_type" : "type-186"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 4928,
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 4992,
     "referenced_type" : "type-191"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 5056,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 5120,
     "referenced_type" : "type-195"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 5184,
     "referenced_type" : "type-198"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 5248,
     "referenced_type" : "type-200"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 5312,
     "referenced_type" : "type-202"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 5376,
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 5440,
     "referenced_type" : "type-207"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 5504,
     "referenced_type" : "type-209"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 5568,
     "referenced_type" : "type-212"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 5632,
     "referenced_type" : "type-214"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 5696,
     "referenced_type" : "type-216"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 5760,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 5824,
     "referenced_type" : "type-221"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 5888,
     "referenced_type" : "type-223"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 5952,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 6016,
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 6080,
     "referenced_type" : "type-230"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 6144,
     "referenced_type" : "type-232"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 6208,
     "referenced_type" : "type-234"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 6272,
     "referenced_type" : "type-236"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 6336,
     "referenced_type" : "type-238"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 6400,
     "referenced_type" : "type-240"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 6464,
     "referenced_type" : "type-242"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 6528,
     "referenced_type" : "type-244"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 6592,
     "referenced_type" : "type-246"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 6656,
     "referenced_type" : "type-248"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 6720,
     "referenced_type" : "type-250"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 6784,
     "referenced_type" : "type-252"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 6848,
     "referenced_type" : "type-254"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 6912,
     "referenced_type" : "type-256"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 6976,
     "referenced_type" : "type-258"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 7040,
     "referenced_type" : "type-260"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 7104,
     "referenced_type" : "type-262"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 7168,
     "referenced_type" : "type-264"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 7232,
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 7296,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 7360,
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 7424,
     "referenced_type" : "type-72"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 7488,
     "referenced_type" : "type-266"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 7552,
     "referenced_type" : "type-268"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 7616,
     "referenced_type" : "type-271"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 7680,
     "referenced_type" : "type-273"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 7744,
     "referenced_type" : "type-275"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 7808,
     "referenced_type" : "type-278"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 7872,
     "referenced_type" : "type-280"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 7936,
     "referenced_type" : "type-282"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 8000,
     "referenced_type" : "type-285"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 8064,
     "referenced_type" : "type-287"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 8128,
     "referenced_type" : "type-289"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 8192,
     "referenced_type" : "type-292"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 8256,
     "referenced_type" : "type-294"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 8320,
     "referenced_type" : "type-296"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 8384,
     "referenced_type" : "type-299"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 8448,
     "referenced_type" : "type-301"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 8512,
     "referenced_type" : "type-303"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 8576,
     "referenced_type" : "type-306"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 8640,
     "referenced_type" : "type-308"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 8704,
     "referenced_type" : "type-310"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 8768,
     "referenced_type" : "type-313"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 8832,
     "referenced_type" : "type-315"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 8896,
     "referenced_type" : "type-317"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 8960,
     "referenced_type" : "type-320"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 9024,
     "referenced_type" : "type-322"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 9088,
     "referenced_type" : "type-324"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 9152,
     "referenced_type" : "type-327"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 9216,
     "referenced_type" : "type-228"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 9280,
     "referenced_type" : "type-329"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 9344,
     "referenced_type" : "type-331"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 9408,
     "referenced_type" : "type-333"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 9472,
     "referenced_type" : "type-335"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 9536,
     "referenced_type" : "type-337"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 9600,
     "referenced_type" : "type-339"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 9664,
     "referenced_type" : "type-341"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 9728,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 9792,
     "referenced_type" : "type-345"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 9856,
     "referenced_type" : "type-347"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 9920,
     "referenced_type" : "type-349"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 9984,
     "referenced_type" : "type-351"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 10048,
     "referenced_type" : "type-353"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 10112,
     "referenced_type" : "type-355"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 10176,
     "referenced_type" : "type-357"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 10240,
     "referenced_type" : "type-359"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 10304,
     "referenced_type" : "type-361"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 10368,
     "referenced_type" : "type-363"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 10432,
     "referenced_type" : "type-365"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 10496,
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 10560,
     "referenced_type" : "type-373"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 10624,
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 10688,
     "referenced_type" : "type-378"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 10752,
     "referenced_type" : "type-371"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 10816,
     "referenced_type" : "type-380"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 10880,
     "referenced_type" : "type-382"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 10944,
     "referenced_type" : "type-384"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 11008,
     "referenced_type" : "type-388"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 11072,
     "referenced_type" : "type-392"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 11136,
     "referenced_type" : "type-394"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 11200,
     "referenced_type" : "type-396"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 11264,
     "referenced_type" : "type-400"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 11328,
     "referenced_type" : "type-404"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 11392,
     "referenced_type" : "type-408"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 11456,
     "referenced_type" : "type-412"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 11520,
     "referenced_type" : "type-416"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 11584,
     "referenced_type" : "type-420"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 11648,
     "referenced_type" : "type-424"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 11712,
     "referenced_type" : "type-428"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 11776,
     "referenced_type" : "type-430"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 11840,
     "referenced_type" : "type-433"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 11904,
     "referenced_type" : "type-436"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 11968,
     "referenced_type" : "type-439"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 12032,
     "referenced_type" : "type-442"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 12096,
     "referenced_type" : "type-445"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 12160,
     "referenced_type" : "type-448"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 12224,
     "referenced_type" : "type-451"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 12288,
     "referenced_type" : "type-453"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 12352,
     "referenced_type" : "type-455"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 12416,
     "referenced_type" : "type-457"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 12480,
     "referenced_type" : "type-459"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 12544,
     "referenced_type" : "type-461"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 12608,
     "referenced_type" : "type-463"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 12672,
     "referenced_type" : "type-465"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 12736,
     "referenced_type" : "type-467"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 12800,
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 12864,
     "referenced_type" : "type-471"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 12928,
     "referenced_type" : "type-473"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 12992,
     "referenced_type" : "type-475"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 13056,
     "referenced_type" : "type-477"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 13120,
     "referenced_type" : "type-479"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 13184,
     "referenced_type" : "type-481"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 13248,
     "referenced_type" : "type-483"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 13312,
     "referenced_type" : "type-487"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 13376,
     "referenced_type" : "type-489"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 13440,
     "referenced_type" : "type-491"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 13504,
     "referenced_type" : "type-495"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 13568,
     "referenced_type" : "type-499"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 13632,
     "referenced_type" : "type-503"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 13696,
     "referenced_type" : "type-507"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 13760,
     "referenced_type" : "type-511"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 13824,
     "referenced_type" : "type-516"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 13888,
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 13952,
     "referenced_type" : "type-518"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 14016,
     "referenced_type" : "type-520"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 14080,
     "referenced_type" : "type-536"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 14144,
     "referenced_type" : "type-538"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 14208,
     "referenced_type" : "type-541"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 14272,
     "referenced_type" : "type-543"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 14336,
     "referenced_type" : "type-373"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 14400,
     "referenced_type" : "type-376"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 14464,
     "referenced_type" : "type-59"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 14528,
     "referenced_type" : "type-61"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 14592,
     "referenced_type" : "type-545"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 14656,
     "referenced_type" : "type-547"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 14720,
     "referenced_type" : "type-549"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 14784,
     "referenced_type" : "type-551"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 14848,
     "referenced_type" : "type-553"
    }
   ],
   "linker_set_key" : "JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "type-7",
   "self_type" : "type-7",
   "size" : 1864,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNINativeInterface"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-702"
    }
   ],
   "linker_set_key" : "poly8x16x4_t",
   "name" : "poly8x16x4_t",
   "referenced_type" : "type-701",
   "self_type" : "type-701",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-705"
    }
   ],
   "linker_set_key" : "poly16x4x4_t",
   "name" : "poly16x4x4_t",
   "referenced_type" : "type-704",
   "self_type" : "type-704",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-708"
    }
   ],
   "linker_set_key" : "poly16x8x4_t",
   "name" : "poly16x8x4_t",
   "referenced_type" : "type-707",
   "self_type" : "type-707",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-711"
    }
   ],
   "linker_set_key" : "poly64x1x4_t",
   "name" : "poly64x1x4_t",
   "referenced_type" : "type-710",
   "self_type" : "type-710",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-714"
    }
   ],
   "linker_set_key" : "poly64x2x4_t",
   "name" : "poly64x2x4_t",
   "referenced_type" : "type-713",
   "self_type" : "type-713",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly64x2x4_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkColor4f",
   "name" : "SkColor4f",
   "referenced_type" : "type-717",
   "self_type" : "type-717",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColor.h",
   "unique_id" : "_ZTS9SkColor4f"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "fY",
     "field_offset" : 16,
     "referenced_type" : "type-78"
    }
   ],
   "linker_set_key" : "SkIPoint16",
   "name" : "SkIPoint16",
   "referenced_type" : "type-722",
   "self_type" : "type-722",
   "size" : 4,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS10SkIPoint16"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkIPoint",
   "name" : "SkIPoint",
   "referenced_type" : "type-726",
   "self_type" : "type-726",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS8SkIPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkPoint",
   "name" : "SkPoint",
   "referenced_type" : "type-731",
   "self_type" : "type-731",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS7SkPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkISize",
   "name" : "SkISize",
   "referenced_type" : "type-737",
   "self_type" : "type-737",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS7SkISize"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkSize",
   "name" : "SkSize",
   "referenced_type" : "type-741",
   "self_type" : "type-741",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS6SkSize"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "SkIRect",
   "name" : "SkIRect",
   "referenced_type" : "type-747",
   "self_type" : "type-747",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS7SkIRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkRect",
   "name" : "SkRect",
   "referenced_type" : "type-753",
   "self_type" : "type-753",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRect.h",
   "unique_id" : "_ZTS6SkRect"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-759"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 288,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "SkMatrix",
   "name" : "SkMatrix",
   "record_kind" : "class",
   "referenced_type" : "type-758",
   "self_type" : "type-758",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkMatrix.h",
   "unique_id" : "_ZTS8SkMatrix"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "b",
     "referenced_type" : "type-25"
    },
    {
     "field_name" : "c",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "s",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "i",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "j",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "f",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-81"
    },
    {
     "field_name" : "l",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS6jvalue"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fData",
     "referenced_type" : "type-775"
    }
   ],
   "linker_set_key" : "SkVector4",
   "name" : "SkVector4",
   "referenced_type" : "type-774",
   "self_type" : "type-774",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS9SkVector4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "type-781"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 512,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "SkMatrix44",
   "name" : "SkMatrix44",
   "record_kind" : "class",
   "referenced_type" : "type-780",
   "self_type" : "type-780",
   "size" : 68,
   "source_file" : "/external/skia/include/core/SkMatrix44.h",
   "unique_id" : "_ZTS10SkMatrix44"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-795"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "field_offset" : 64,
     "referenced_type" : "type-791"
    }
   ],
   "linker_set_key" : "SkRefCntBase",
   "name" : "SkRefCntBase",
   "record_kind" : "class",
   "referenced_type" : "type-790",
   "self_type" : "type-790",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS12SkRefCntBase",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkRefCntBase"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-792"
    }
   ],
   "linker_set_key" : "std::atomic<int>",
   "name" : "std::atomic<int>",
   "referenced_type" : "type-791",
   "self_type" : "type-791",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__16atomicIiEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-793"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, true>",
   "name" : "std::__atomic_base<int, true>",
   "referenced_type" : "type-792",
   "self_type" : "type-792",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb1EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-794"
    }
   ],
   "linker_set_key" : "std::__atomic_base<int, false>",
   "name" : "std::__atomic_base<int, false>",
   "referenced_type" : "type-793",
   "self_type" : "type-793",
   "size" : 4,
   "source_file" : "/external/libcxx/include/atomic",
   "template_args" : [ "type-12" ],
   "unique_id" : "_ZTSNSt3__113__atomic_baseIiLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "SkNoncopyable",
   "name" : "SkNoncopyable",
   "record_kind" : "class",
   "referenced_type" : "type-795",
   "self_type" : "type-795",
   "size" : 1,
   "source_file" : "/external/skia/include/core/SkTypes.h",
   "unique_id" : "_ZTS13SkNoncopyable"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-790"
    }
   ],
   "linker_set_key" : "SkRefCnt",
   "name" : "SkRefCnt",
   "record_kind" : "class",
   "referenced_type" : "type-799",
   "self_type" : "type-799",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "unique_id" : "_ZTS8SkRefCnt",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkRefCnt"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-802"
    }
   ],
   "linker_set_key" : "sk_sp<SkColorSpace>",
   "name" : "sk_sp<SkColorSpace>",
   "record_kind" : "class",
   "referenced_type" : "type-801",
   "self_type" : "type-801",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-803" ],
   "unique_id" : "_ZTS5sk_spI12SkColorSpaceE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-799"
    }
   ],
   "linker_set_key" : "SkColorSpace",
   "name" : "SkColorSpace",
   "record_kind" : "class",
   "referenced_type" : "type-803",
   "self_type" : "type-803",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS12SkColorSpace",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkColorSpace"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkColorSpaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkColorSpaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace15makeLinearGammaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace13makeSRGBGammaEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace13makeColorSpinEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace10onToXYZD50Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace14onToXYZD50HashEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace12onFromXYZD50Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace12onGammaNamedEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace18onGammaCloseToSRGBEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace15onGammaIsLinearEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK12SkColorSpace23onIsNumericalTransferFnEP22SkColorSpaceTransferFn"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace8onIsCMYKEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkColorSpace13onProfileDataEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "type-808"
    }
   ],
   "linker_set_key" : "sk_sp<SkPixelRef>",
   "name" : "sk_sp<SkPixelRef>",
   "record_kind" : "class",
   "referenced_type" : "type-807",
   "self_type" : "type-807",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkRefCnt.h",
   "template_args" : [ "type-810" ],
   "unique_id" : "_ZTS5sk_spI10SkPixelRefE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fRX",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fRY",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fGX",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fGY",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fBX",
     "field_offset" : 128,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fBY",
     "field_offset" : 160,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fWX",
     "field_offset" : 192,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fWY",
     "field_offset" : 224,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkColorSpacePrimaries",
   "name" : "SkColorSpacePrimaries",
   "referenced_type" : "type-815",
   "self_type" : "type-815",
   "size" : 32,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS21SkColorSpacePrimaries"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fG",
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fA",
     "field_offset" : 32,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fC",
     "field_offset" : 96,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fD",
     "field_offset" : 128,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fE",
     "field_offset" : 160,
     "referenced_type" : "type-80"
    },
    {
     "field_name" : "fF",
     "field_offset" : 192,
     "referenced_type" : "type-80"
    }
   ],
   "linker_set_key" : "SkColorSpaceTransferFn",
   "name" : "SkColorSpaceTransferFn",
   "referenced_type" : "type-816",
   "self_type" : "type-816",
   "size" : 28,
   "source_file" : "/external/skia/include/core/SkColorSpace.h",
   "unique_id" : "_ZTS22SkColorSpaceTransferFn"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fColorSpace",
     "referenced_type" : "type-801"
    },
    {
     "access" : "private",
     "field_name" : "fWidth",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "fHeight",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "access" : "private",
     "field_name" : "fColorType",
     "field_offset" : 128,
     "referenced_type" : "type-828"
    },
    {
     "access" : "private",
     "field_name" : "fAlphaType",
     "field_offset" : 160,
     "referenced_type" : "type-827"
    }
   ],
   "linker_set_key" : "SkImageInfo",
   "name" : "SkImageInfo",
   "referenced_type" : "type-830",
   "self_type" : "type-830",
   "size" : 24,
   "source_file" : "/external/skia/include/core/SkImageInfo.h",
   "unique_id" : "_ZTS11SkImageInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixels",
     "referenced_type" : "type-837"
    },
    {
     "access" : "private",
     "field_name" : "fRowBytes",
     "field_offset" : 64,
     "referenced_type" : "type-839"
    },
    {
     "access" : "private",
     "field_name" : "fInfo",
     "field_offset" : 128,
     "referenced_type" : "type-830"
    }
   ],
   "linker_set_key" : "SkPixmap",
   "name" : "SkPixmap",
   "record_kind" : "class",
   "referenced_type" : "type-836",
   "self_type" : "type-836",
   "size" : 40,
   "source_file" : "/external/skia/include/core/SkPixmap.h",
   "unique_id" : "_ZTS8SkPixmap"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixelRef",
     "referenced_type" : "type-807"
    },
    {
     "access" : "private",
     "field_name" : "fPixmap",
     "field_offset" : 64,
     "referenced_type" : "type-836"
    },
    {
     "access" : "private",
     "field_name" : "fFlags",
     "field_offset" : 384,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "SkBitmap",
   "name" : "SkBitmap",
   "record_kind" : "class",
   "referenced_type" : "type-850",
   "self_type" : "type-850",
   "size" : 56,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTS8SkBitmap"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-799"
    }
   ],
   "linker_set_key" : "SkBitmap::Allocator",
   "name" : "SkBitmap::Allocator",
   "record_kind" : "class",
   "referenced_type" : "type-856",
   "self_type" : "type-856",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap9AllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap9AllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap9AllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkBitmap9Allocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-856"
    }
   ],
   "linker_set_key" : "SkBitmap::HeapAllocator",
   "name" : "SkBitmap::HeapAllocator",
   "record_kind" : "class",
   "referenced_type" : "type-861",
   "self_type" : "type-861",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkBitmap.h",
   "unique_id" : "_ZTSN8SkBitmap13HeapAllocatorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN8SkBitmap13HeapAllocatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "mangled_component_name" : "_ZN8SkBitmap13HeapAllocator13allocPixelRefEPS_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "group",
     "field_offset" : 128,
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "type-864",
   "self_type" : "type-864",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS16JavaVMAttachArgs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "type-865",
   "self_type" : "type-865",
   "size" : 16,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12JavaVMOption"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "type-867"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 128,
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "type-866",
   "self_type" : "type-866",
   "size" : 24,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14JavaVMInitArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "type-556"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "type-556"
    }
   ],
   "linker_set_key" : "AndroidBitmapInfo",
   "name" : "AndroidBitmapInfo",
   "referenced_type" : "type-869",
   "self_type" : "type-869",
   "size" : 20,
   "source_file" : "/frameworks/native/include/android/bitmap.h",
   "unique_id" : "AndroidBitmapInfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "first",
     "referenced_type" : "type-839"
    },
    {
     "field_name" : "second",
     "field_offset" : 64,
     "referenced_type" : "type-839"
    }
   ],
   "linker_set_key" : "std::pair<unsigned long, unsigned long>",
   "name" : "std::pair<unsigned long, unsigned long>",
   "referenced_type" : "type-873",
   "self_type" : "type-873",
   "size" : 16,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-839", "type-839" ],
   "unique_id" : "_ZTSNSt3__14pairImmEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::pair<unsigned long, unsigned long>::_CheckArgs",
   "name" : "std::pair<unsigned long, unsigned long>::_CheckArgs",
   "referenced_type" : "type-878",
   "self_type" : "type-878",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "unique_id" : "_ZTSNSt3__14pairImmE10_CheckArgsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int> >",
   "referenced_type" : "type-882",
   "self_type" : "type-882",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-883", "type-884" ],
   "unique_id" : "_ZTSNSt3__111conditionalILb1EN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEENS2_25SkTFitsIn_Signed2UnsignedIsiEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>",
   "name" : "sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>",
   "referenced_type" : "type-883",
   "self_type" : "type-883",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-12" ],
   "unique_id" : "_ZTSN9sktfitsin7Private23SkTFitsIn_Signed2SignedIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "name" : "std::conditional<true, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "referenced_type" : "type-885",
   "self_type" : "type-885",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
