{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "long [2]",
   "name" : "long [2]",
   "referenced_type" : "type-106",
   "self_type" : "type-263",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTimestamp.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "long [5]",
   "name" : "long [5]",
   "referenced_type" : "type-106",
   "self_type" : "type-262",
   "size" : 40,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTimestamp.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-110",
   "self_type" : "type-750",
   "source_file" : "/system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float [256]",
   "name" : "float [256]",
   "referenced_type" : "type-110",
   "self_type" : "type-120",
   "size" : 1024,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "float [2]",
   "name" : "float [2]",
   "referenced_type" : "type-110",
   "self_type" : "type-254",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "audio_microphone_channel_mapping_t [30]",
   "name" : "audio_microphone_channel_mapping_t [30]",
   "referenced_type" : "type-116",
   "self_type" : "type-118",
   "size" : 120,

   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::Vector<android::sp<android::AudioSystem::AudioPortCallback> >",
   "name" : "const android::Vector<android::sp<android::AudioSystem::AudioPortCallback> >",
   "referenced_type" : "type-716",
   "self_type" : "type-2660",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const audio_config_base",
   "name" : "const audio_config_base",
   "referenced_type" : "type-729",
   "self_type" : "type-728",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SLRecordItf_",
   "name" : "const SLRecordItf_",
   "referenced_type" : "type-768",
   "self_type" : "type-774",
   "size" : 96,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SLRecordItf_ *const",
   "name" : "const SLRecordItf_ *const",
   "referenced_type" : "type-773",
   "self_type" : "type-772",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const char",
   "name" : "const char",
   "referenced_type" : "type-78",
   "self_type" : "type-340",
   "size" : 1,
   "source_file" : "/system/core/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::MemoryDealer",
   "name" : "const android::MemoryDealer",
   "referenced_type" : "type-796",
   "self_type" : "type-799",
   "size" : 32,
   "source_file" : "/frameworks/native/libs/binder/include/binder/MemoryDealer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SLVibraItf_ *const",
   "name" : "const SLVibraItf_ *const",
   "referenced_type" : "type-7",
   "self_type" : "type-6",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::binder::Status",
   "name" : "const android::binder::Status",
   "referenced_type" : "type-824",
   "self_type" : "type-827",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/binder/include/binder/Status.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const signed char",
   "name" : "const signed char",
   "referenced_type" : "type-837",
   "self_type" : "type-2613",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::AudioClient",
   "name" : "const android::AudioClient",
   "referenced_type" : "type-867",
   "self_type" : "type-870",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioClient.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::IAudioFlinger::CreateTrackInput",
   "name" : "const android::IAudioFlinger::CreateTrackInput",
   "referenced_type" : "type-873",
   "self_type" : "type-875",
   "size" : 432,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/IAudioFlinger.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::IAudioFlinger::CreateTrackOutput",
   "name" : "const android::IAudioFlinger::CreateTrackOutput",
   "referenced_type" : "type-878",
   "self_type" : "type-880",
   "size" : 72,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/IAudioFlinger.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::IAudioFlinger::CreateRecordInput",
   "name" : "const android::IAudioFlinger::CreateRecordInput",
   "referenced_type" : "type-882",
   "self_type" : "type-884",
   "size" : 368,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/IAudioFlinger.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const android::IAudioFlinger::CreateRecordOutput",
   "name" : "const android::IAudioFlinger::CreateRecordOutput",
   "referenced_type" : "type-886",
   "self_type" : "type-888",
   "size" : 64,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/IAudioFlinger.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const android::wp<android::IBinder>",
   "name" : "const android::wp<android::IBinder>",
   "referenced_type" : "type-894",
   "self_type" : "type-893",
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioEffect.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SLEqualizerItf_",
   "name" : "const SLEqualizerItf_",
   "referenced_type" : "type-895",
   "self_type" : "type-901",
   "size" : 104,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SLEqualizerItf_ *const",
   "name" : "const SLEqualizerItf_ *const",
   "referenced_type" : "type-900",
   "self_type" : "type-899",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[16]",
   "name" : "unsigned char const[16]",
   "referenced_type" : "type-999",
   "self_type" : "type-1940",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const SLVibraItf_",
   "name" : "const SLVibraItf_",
   "referenced_type" : "type-9",
   "self_type" : "type-8",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_low",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "time_mid",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "time_hi_and_version",
     "field_offset" : 48,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "clock_seq",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "SLInterfaceID_",
   "name" : "SLInterfaceID_",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLInterfaceID_"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1002"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1001",
   "self_type" : "type-1001",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJlmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1003"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1002",
   "self_type" : "type-1002",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1004"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1003",
   "self_type" : "type-1003",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1005"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1004",
   "self_type" : "type-1004",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1006"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1005",
   "self_type" : "type-1005",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1007"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1006",
   "self_type" : "type-1006",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJNS_7AStringEPvNS_2spINS_8AMessageEEENS3_INS_7ABufferEEENS3_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1008"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1007",
   "self_type" : "type-1007",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJPvNS_2spINS_8AMessageEEENS2_INS_7ABufferEEENS2_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1009"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1008",
   "self_type" : "type-1008",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJNS_2spINS_8AMessageEEENS1_INS_7ABufferEEENS1_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1010"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::is_one_of<int, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1009",
   "self_type" : "type-1009",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJNS_2spINS_7ABufferEEENS1_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "audio_port_config_session_ext",
   "name" : "audio_port_config_session_ext",
   "referenced_type" : "type-101",
   "self_type" : "type-101",
   "size" : 4,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_port_config_session_ext"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1011"
    }
   ],
   "linker_set_key" : "android::is_one_of<int, sp<RefBase> >",
   "name" : "android::is_one_of<int, sp<RefBase> >",
   "referenced_type" : "type-1010",
   "self_type" : "type-1010",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJNS_2spINS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1012"
    }
   ],
   "linker_set_key" : "android::is_one_of<int>",
   "name" : "android::is_one_of<int>",
   "referenced_type" : "type-1011",
   "self_type" : "type-1011",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android9is_one_ofIiJEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1014"
    }
   ],
   "linker_set_key" : "android::are_unique<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1013",
   "self_type" : "type-1013",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJilmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1016"
    }
   ],
   "linker_set_key" : "android::are_unique<long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1015",
   "self_type" : "type-1015",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJlmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1018"
    }
   ],
   "linker_set_key" : "android::are_unique<unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1017",
   "self_type" : "type-1017",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1020"
    }
   ],
   "linker_set_key" : "android::are_unique<float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1019",
   "self_type" : "type-1019",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "session",
     "referenced_type" : "type-81"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "audio_port::(anonymous union at system/media/audio/include/system/audio.h:491:5) at system/media/audio/include/system/audio.h:491:5",
   "name" : "audio_port::(anonymous union at system/media/audio/include/system/audio.h:491:5) at system/media/audio/include/system/audio.h:491:5",
   "record_kind" : "union",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 40,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_port::(anonymous union at system/media/audio/include/system/audio.h:491:5)"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1022"
    }
   ],
   "linker_set_key" : "android::are_unique<double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1021",
   "self_type" : "type-1021",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetDestinationOutputDeviceIDs",
     "referenced_type" : "type-1024"
    },
    {
     "field_name" : "RegisterDeviceChangeCallback",
     "field_offset" : 64,
     "referenced_type" : "type-1030"
    },
    {
     "field_name" : "ReRoute",
     "field_offset" : 128,
     "referenced_type" : "type-1034"
    }
   ],
   "linker_set_key" : "XAOutputMixItf_",
   "name" : "XAOutputMixItf_",
   "referenced_type" : "type-1023",
   "self_type" : "type-1023",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAOutputMixItf_"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1037"
    }
   ],
   "linker_set_key" : "android::are_unique<Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1036",
   "self_type" : "type-1036",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1039"
    }
   ],
   "linker_set_key" : "android::are_unique<AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1038",
   "self_type" : "type-1038",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_7AStringEPvNS_2spINS_8AMessageEEENS3_INS_7ABufferEEENS3_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "shared_memory_address",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "shared_memory_fd",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "buffer_size_frames",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "burst_size_frames",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-103"
    }
   ],
   "linker_set_key" : "audio_mmap_buffer_info",
   "name" : "audio_mmap_buffer_info",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 24,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_mmap_buffer_info"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1041"
    }
   ],
   "linker_set_key" : "android::are_unique<void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1040",
   "self_type" : "type-1040",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJPvNS_2spINS_8AMessageEEENS2_INS_7ABufferEEENS2_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1043"
    }
   ],
   "linker_set_key" : "android::are_unique<sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1042",
   "self_type" : "type-1042",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_2spINS_8AMessageEEENS1_INS_7ABufferEEENS1_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1045"
    }
   ],
   "linker_set_key" : "android::are_unique<sp<ABuffer>, sp<RefBase> >",
   "name" : "android::are_unique<sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1044",
   "self_type" : "type-1044",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_2spINS_7ABufferEEENS1_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1047"
    }
   ],
   "linker_set_key" : "android::are_unique<sp<RefBase> >",
   "name" : "android::are_unique<sp<RefBase> >",
   "referenced_type" : "type-1046",
   "self_type" : "type-1046",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJNS_2spINS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1049"
    }
   ],
   "linker_set_key" : "android::are_unique<>",
   "name" : "android::are_unique<>",
   "referenced_type" : "type-1048",
   "self_type" : "type-1048",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/TypeTraits.h",
   "unique_id" : "_ZTSN7android10are_uniqueIJEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "time_nanoseconds",
     "referenced_type" : "type-106"
    },
    {
     "field_name" : "position_frames",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "audio_mmap_position",
   "name" : "audio_mmap_position",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_mmap_position"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::_Flagged_helper",
   "name" : "android::_Flagged_helper",
   "referenced_type" : "type-1050",
   "self_type" : "type-1050",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/Flagged.h",
   "unique_id" : "_ZTSN7android15_Flagged_helperE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::_AUnion_impl",
   "name" : "android::_AUnion_impl",
   "referenced_type" : "type-1051",
   "self_type" : "type-1051",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AData.h",
   "unique_id" : "_ZTSN7android12_AUnion_implE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::AData<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "name" : "android::AData<int, long, unsigned long, float, double, Rect, AString, void *, sp<AMessage>, sp<ABuffer>, sp<RefBase> >",
   "referenced_type" : "type-1052",
   "self_type" : "type-1052",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AData.h",
   "unique_id" : "_ZTSN7android5ADataIJilmfdNS_8AMessage4RectENS_7AStringEPvNS_2spIS1_EENS5_INS_7ABufferEEENS5_INS_7RefBaseEEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-147"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLooper",
     "field_offset" : 128,
     "referenced_type" : "type-310"
    },
    {
     "access" : "private",
     "field_name" : "mReply",
     "field_offset" : 256,
     "referenced_type" : "type-319"
    },
    {
     "access" : "private",
     "field_name" : "mReplied",
     "field_offset" : 320,
     "referenced_type" : "type-206"
    }
   ],
   "linker_set_key" : "android::AReplyToken",
   "name" : "android::AReplyToken",
   "referenced_type" : "type-1053",
   "self_type" : "type-1053",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libstagefright/foundation/include/media/stagefright/foundation/AMessage.h",
   "unique_id" : "_ZTSN7android11AReplyTokenE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AReplyTokenE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AReplyTokenD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "module_api_version",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hal_api_version",
     "field_offset" : 48,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "id",
     "field_offset" : 64,
     "referenced_type" : "type-339"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "type-339"
    },
    {
     "field_name" : "author",
     "field_offset" : 192,
     "referenced_type" : "type-339"
    },
    {
     "field_name" : "methods",
     "field_offset" : 256,
     "referenced_type" : "type-1058"
    },
    {
     "field_name" : "dso",
     "field_offset" : 320,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "type-1071"
    }
   ],
   "linker_set_key" : "hw_module_t",
   "name" : "hw_module_t",
   "referenced_type" : "type-1057",
   "self_type" : "type-1057",
   "size" : 248,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_module_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "open",
     "referenced_type" : "type-1060"
    }
   ],
   "linker_set_key" : "hw_module_methods_t",
   "name" : "hw_module_methods_t",
   "referenced_type" : "type-1059",
   "self_type" : "type-1059",
   "size" : 8,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_module_methods_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tag",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "module",
     "field_offset" : 64,
     "referenced_type" : "type-1067"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 128,
     "referenced_type" : "type-1068"
    },
    {
     "field_name" : "close",
     "field_offset" : 896,
     "referenced_type" : "type-1069"
    }
   ],
   "linker_set_key" : "hw_device_t",
   "name" : "hw_device_t",
   "referenced_type" : "type-1066",
   "self_type" : "type-1066",
   "size" : 120,
   "source_file" : "/hardware/libhardware/include/hardware/hardware.h",
   "unique_id" : "hw_device_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "content_type",
     "field_offset" : 32,
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "gain",
     "field_offset" : 64,
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "playback_track_metadata",
   "name" : "playback_track_metadata",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "playback_track_metadata"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-1075"
    },
    {
     "field_name" : "total_time_in_msec_voted_for_since_boot",
     "field_offset" : 832,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "total_number_of_times_voted_since_boot",
     "field_offset" : 896,
     "referenced_type" : "type-219"
    }
   ],
   "linker_set_key" : "power_state_voter_t",
   "name" : "power_state_voter_t",
   "referenced_type" : "type-1074",
   "self_type" : "type-1074",
   "size" : 120,
   "source_file" : "/hardware/libhardware/include/hardware/power.h",
   "unique_id" : "power_state_voter_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-1075"
    },
    {
     "field_name" : "residency_in_msec_since_boot",
     "field_offset" : 832,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "total_transitions",
     "field_offset" : 896,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "supported_only_in_suspend",
     "field_offset" : 960,
     "referenced_type" : "type-206"
    },
    {
     "field_name" : "number_of_voters",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "voters",
     "field_offset" : 1024,
     "referenced_type" : "type-1077"
    }
   ],
   "linker_set_key" : "power_state_platform_sleep_state_t",
   "name" : "power_state_platform_sleep_state_t",
   "referenced_type" : "type-1076",
   "self_type" : "type-1076",
   "size" : 136,
   "source_file" : "/hardware/libhardware/include/hardware/power.h",
   "unique_id" : "power_state_platform_sleep_state_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-1057"
    },
    {
     "field_name" : "init",
     "field_offset" : 1984,
     "referenced_type" : "type-1079"
    },
    {
     "field_name" : "setInteractive",
     "field_offset" : 2048,
     "referenced_type" : "type-1082"
    },
    {
     "field_name" : "powerHint",
     "field_offset" : 2112,
     "referenced_type" : "type-1084"
    },
    {
     "field_name" : "setFeature",
     "field_offset" : 2176,
     "referenced_type" : "type-1086"
    },
    {
     "field_name" : "get_platform_low_power_stats",
     "field_offset" : 2240,
     "referenced_type" : "type-1088"
    },
    {
     "field_name" : "get_number_of_platform_modes",
     "field_offset" : 2304,
     "referenced_type" : "type-1091"
    },
    {
     "field_name" : "get_voter_list",
     "field_offset" : 2368,
     "referenced_type" : "type-1093"
    }
   ],
   "linker_set_key" : "power_module",
   "name" : "power_module",
   "referenced_type" : "type-1078",
   "self_type" : "type-1078",
   "size" : 304,
   "source_file" : "/hardware/libhardware/include/hardware/power.h",
   "unique_id" : "power_module"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-525"
    }
   ],
   "linker_set_key" : "android::media::IPlayerDefault",
   "name" : "android::media::IPlayerDefault",
   "record_kind" : "class",
   "referenced_type" : "type-1096",
   "self_type" : "type-1096",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/frameworks/av/media/libaudioclient/libaudioclient/android_arm64_armv8-a_core_shared_platform/gen/aidl/android/media/IPlayer.h",
   "unique_id" : "_ZTSN7android5media14IPlayerDefaultE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android5media14IPlayerDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android5media14IPlayerDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android5media14IPlayerDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android5media7IPlayer22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault5startEv"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault5pauseEv"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault4stopEv"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault9setVolumeEf"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault6setPanEf"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault15setStartDelayMsEi"
    },
    {
     "mangled_component_name" : "_ZN7android5media14IPlayerDefault17applyVolumeShaperERKNS0_12VolumeShaper13ConfigurationERKNS2_9OperationE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android5media14IPlayerDefaultE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android5media14IPlayerDefaultD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android5media14IPlayerDefaultD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "type-1099"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 320,
     "referenced_type" : "type-1100"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 384,
     "referenced_type" : "type-1100"
    }
   ],
   "linker_set_key" : "android_native_base_t",
   "name" : "android_native_base_t",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 56,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_base_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android_native_rect_t",
   "name" : "android_native_rect_t",
   "referenced_type" : "type-1103",
   "self_type" : "type-1103",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "android_native_rect_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "type-1098"
    },
    {
     "field_name" : "width",
     "field_offset" : 448,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "height",
     "field_offset" : 480,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "stride",
     "field_offset" : 512,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "format",
     "field_offset" : 544,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 576,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 640,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 704,
     "referenced_type" : "type-1105"
    },
    {
     "field_name" : "handle",
     "field_offset" : 768,
     "referenced_type" : "type-1106"
    },
    {
     "field_name" : "usage",
     "field_offset" : 832,
     "referenced_type" : "type-219"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 896,
     "referenced_type" : "type-1108"
    }
   ],
   "linker_set_key" : "ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "referenced_type" : "type-1104",
   "self_type" : "type-1104",
   "size" : 168,
   "source_file" : "/frameworks/native/libs/nativebase/include/nativebase/nativebase.h",
   "unique_id" : "ANativeWindowBuffer"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "source",
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "gain",
     "field_offset" : 32,
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "record_track_metadata",
   "name" : "record_track_metadata",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 8,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "record_track_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "ARect",
   "name" : "ARect",
   "referenced_type" : "type-1112",
   "self_type" : "type-1112",
   "size" : 16,
   "source_file" : "/frameworks/native/libs/arect/include/android/rect.h",
   "unique_id" : "ARect"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "SLDataSink_",
   "name" : "SLDataSink_",
   "referenced_type" : "type-1113",
   "self_type" : "type-1113",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLDataSink_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetVolumeLevel",
     "referenced_type" : "type-1115"
    },
    {
     "field_name" : "GetVolumeLevel",
     "field_offset" : 64,
     "referenced_type" : "type-1121"
    },
    {
     "field_name" : "GetMaxVolumeLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1121"
    },
    {
     "field_name" : "SetMute",
     "field_offset" : 192,
     "referenced_type" : "type-1123"
    },
    {
     "field_name" : "GetMute",
     "field_offset" : 256,
     "referenced_type" : "type-1125"
    },
    {
     "field_name" : "EnableStereoPosition",
     "field_offset" : 320,
     "referenced_type" : "type-1123"
    },
    {
     "field_name" : "IsEnabledStereoPosition",
     "field_offset" : 384,
     "referenced_type" : "type-1125"
    },
    {
     "field_name" : "SetStereoPosition",
     "field_offset" : 448,
     "referenced_type" : "type-1115"
    },
    {
     "field_name" : "GetStereoPosition",
     "field_offset" : 512,
     "referenced_type" : "type-1121"
    }
   ],
   "linker_set_key" : "SLVolumeItf_",
   "name" : "SLVolumeItf_",
   "referenced_type" : "type-1114",
   "self_type" : "type-1114",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLVolumeItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timeLow",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "timeMid",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "timeHiAndVersion",
     "field_offset" : 48,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "clockSeq",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "audio_uuid_s",
   "name" : "audio_uuid_s",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 16,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_uuid_s"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetVolumeScale",
     "referenced_type" : "type-1128"
    },
    {
     "field_name" : "SetVolume",
     "field_offset" : 64,
     "referenced_type" : "type-1134"
    },
    {
     "field_name" : "GetVolume",
     "field_offset" : 128,
     "referenced_type" : "type-1136"
    }
   ],
   "linker_set_key" : "SLDeviceVolumeItf_",
   "name" : "SLDeviceVolumeItf_",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLDeviceVolumeItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "playIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLBufferQueueState_",
   "name" : "SLBufferQueueState_",
   "referenced_type" : "type-1138",
   "self_type" : "type-1138",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLBufferQueueState_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Enqueue",
     "referenced_type" : "type-1140"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 64,
     "referenced_type" : "type-1146"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 128,
     "referenced_type" : "type-1148"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 192,
     "referenced_type" : "type-1151"
    }
   ],
   "linker_set_key" : "SLBufferQueueItf_",
   "name" : "SLBufferQueueItf_",
   "referenced_type" : "type-1139",
   "self_type" : "type-1139",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLBufferQueueItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-110"
    }
   ],
   "linker_set_key" : "audio_microphone_coordinate",
   "name" : "audio_microphone_coordinate",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 12,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_microphone_coordinate"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetPreset",
     "referenced_type" : "type-1156"
    },
    {
     "field_name" : "GetPreset",
     "field_offset" : 64,
     "referenced_type" : "type-1162"
    }
   ],
   "linker_set_key" : "SLPresetReverbItf_",
   "name" : "SLPresetReverbItf_",
   "referenced_type" : "type-1155",
   "self_type" : "type-1155",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLPresetReverbItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "roomLevel",
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "roomHFLevel",
     "field_offset" : 16,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "decayTime",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "decayHFRatio",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "reflectionsLevel",
     "field_offset" : 80,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "reflectionsDelay",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reverbLevel",
     "field_offset" : 128,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "reverbDelay",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "diffusion",
     "field_offset" : 192,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "density",
     "field_offset" : 208,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "SLEnvironmentalReverbSettings_",
   "name" : "SLEnvironmentalReverbSettings_",
   "referenced_type" : "type-1164",
   "self_type" : "type-1164",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLEnvironmentalReverbSettings_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetRoomLevel",
     "referenced_type" : "type-1166"
    },
    {
     "field_name" : "GetRoomLevel",
     "field_offset" : 64,
     "referenced_type" : "type-1172"
    },
    {
     "field_name" : "SetRoomHFLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1166"
    },
    {
     "field_name" : "GetRoomHFLevel",
     "field_offset" : 192,
     "referenced_type" : "type-1172"
    },
    {
     "field_name" : "SetDecayTime",
     "field_offset" : 256,
     "referenced_type" : "type-1174"
    },
    {
     "field_name" : "GetDecayTime",
     "field_offset" : 320,
     "referenced_type" : "type-1176"
    },
    {
     "field_name" : "SetDecayHFRatio",
     "field_offset" : 384,
     "referenced_type" : "type-1166"
    },
    {
     "field_name" : "GetDecayHFRatio",
     "field_offset" : 448,
     "referenced_type" : "type-1172"
    },
    {
     "field_name" : "SetReflectionsLevel",
     "field_offset" : 512,
     "referenced_type" : "type-1166"
    },
    {
     "field_name" : "GetReflectionsLevel",
     "field_offset" : 576,
     "referenced_type" : "type-1172"
    },
    {
     "field_name" : "SetReflectionsDelay",
     "field_offset" : 640,
     "referenced_type" : "type-1174"
    },
    {
     "field_name" : "GetReflectionsDelay",
     "field_offset" : 704,
     "referenced_type" : "type-1176"
    },
    {
     "field_name" : "SetReverbLevel",
     "field_offset" : 768,
     "referenced_type" : "type-1166"
    },
    {
     "field_name" : "GetReverbLevel",
     "field_offset" : 832,
     "referenced_type" : "type-1172"
    },
    {
     "field_name" : "SetReverbDelay",
     "field_offset" : 896,
     "referenced_type" : "type-1174"
    },
    {
     "field_name" : "GetReverbDelay",
     "field_offset" : 960,
     "referenced_type" : "type-1176"
    },
    {
     "field_name" : "SetDiffusion",
     "field_offset" : 1024,
     "referenced_type" : "type-1166"
    },
    {
     "field_name" : "GetDiffusion",
     "field_offset" : 1088,
     "referenced_type" : "type-1172"
    },
    {
     "field_name" : "SetDensity",
     "field_offset" : 1152,
     "referenced_type" : "type-1166"
    },
    {
     "field_name" : "GetDensity",
     "field_offset" : 1216,
     "referenced_type" : "type-1172"
    },
    {
     "field_name" : "SetEnvironmentalReverbProperties",
     "field_offset" : 1280,
     "referenced_type" : "type-1178"
    },
    {
     "field_name" : "GetEnvironmentalReverbProperties",
     "field_offset" : 1344,
     "referenced_type" : "type-1182"
    }
   ],
   "linker_set_key" : "SLEnvironmentalReverbItf_",
   "name" : "SLEnvironmentalReverbItf_",
   "referenced_type" : "type-1165",
   "self_type" : "type-1165",
   "size" : 176,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLEnvironmentalReverbItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device_id",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "device",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "address",
     "field_offset" : 320,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "channel_mapping",
     "field_offset" : 576,
     "referenced_type" : "type-118"
    },
    {
     "field_name" : "location",
     "field_offset" : 1536,
     "referenced_type" : "type-113"
    },
    {
     "field_name" : "group",
     "field_offset" : 1568,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "index_in_the_group",
     "field_offset" : 1600,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sensitivity",
     "field_offset" : 1632,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "max_spl",
     "field_offset" : 1664,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "min_spl",
     "field_offset" : 1696,
     "referenced_type" : "type-110"
    },
    {
     "field_name" : "directionality",
     "field_offset" : 1728,
     "referenced_type" : "type-114"
    },
    {
     "field_name" : "num_frequency_responses",
     "field_offset" : 1760,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "frequency_responses",
     "field_offset" : 1792,
     "referenced_type" : "type-119"
    },
    {
     "field_name" : "geometric_location",
     "field_offset" : 18176,
     "referenced_type" : "type-115"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 18272,
     "referenced_type" : "type-115"
    }
   ],
   "linker_set_key" : "audio_microphone_characteristic_t",
   "name" : "audio_microphone_characteristic_t",
   "referenced_type" : "type-117",
   "self_type" : "type-117",
   "size" : 2296,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_microphone_characteristic_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetFreqRange",
     "referenced_type" : "type-1186"
    },
    {
     "field_name" : "GetFreqRange",
     "field_offset" : 64,
     "referenced_type" : "type-1192"
    },
    {
     "field_name" : "IsFreqRangeSupported",
     "field_offset" : 128,
     "referenced_type" : "type-1194"
    },
    {
     "field_name" : "GetFreqRangeProperties",
     "field_offset" : 192,
     "referenced_type" : "type-1196"
    },
    {
     "field_name" : "SetFrequency",
     "field_offset" : 256,
     "referenced_type" : "type-1198"
    },
    {
     "field_name" : "CancelSetFrequency",
     "field_offset" : 320,
     "referenced_type" : "type-1200"
    },
    {
     "field_name" : "GetFrequency",
     "field_offset" : 384,
     "referenced_type" : "type-1202"
    },
    {
     "field_name" : "SetSquelch",
     "field_offset" : 448,
     "referenced_type" : "type-1198"
    },
    {
     "field_name" : "GetSquelch",
     "field_offset" : 512,
     "referenced_type" : "type-1202"
    },
    {
     "field_name" : "SetStereoMode",
     "field_offset" : 576,
     "referenced_type" : "type-1198"
    },
    {
     "field_name" : "GetStereoMode",
     "field_offset" : 640,
     "referenced_type" : "type-1202"
    },
    {
     "field_name" : "GetSignalStrength",
     "field_offset" : 704,
     "referenced_type" : "type-1202"
    },
    {
     "field_name" : "Seek",
     "field_offset" : 768,
     "referenced_type" : "type-1198"
    },
    {
     "field_name" : "StopSeeking",
     "field_offset" : 832,
     "referenced_type" : "type-1200"
    },
    {
     "field_name" : "GetNumberOfPresets",
     "field_offset" : 896,
     "referenced_type" : "type-1202"
    },
    {
     "field_name" : "SetPreset",
     "field_offset" : 960,
     "referenced_type" : "type-1204"
    },
    {
     "field_name" : "GetPreset",
     "field_offset" : 1024,
     "referenced_type" : "type-1206"
    },
    {
     "field_name" : "RegisterRadioCallback",
     "field_offset" : 1088,
     "referenced_type" : "type-1208"
    }
   ],
   "linker_set_key" : "XARadioItf_",
   "name" : "XARadioItf_",
   "referenced_type" : "type-1185",
   "self_type" : "type-1185",
   "size" : 144,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XARadioItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EnableEffectSend",
     "referenced_type" : "type-1213"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-1219"
    },
    {
     "field_name" : "SetDirectLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1221"
    },
    {
     "field_name" : "GetDirectLevel",
     "field_offset" : 192,
     "referenced_type" : "type-1223"
    },
    {
     "field_name" : "SetSendLevel",
     "field_offset" : 256,
     "referenced_type" : "type-1225"
    },
    {
     "field_name" : "GetSendLevel",
     "field_offset" : 320,
     "referenced_type" : "type-1227"
    }
   ],
   "linker_set_key" : "SLEffectSendItf_",
   "name" : "SLEffectSendItf_",
   "referenced_type" : "type-1212",
   "self_type" : "type-1212",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLEffectSendItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Set3DGroup",
     "referenced_type" : "type-1230"
    },
    {
     "field_name" : "Get3DGroup",
     "field_offset" : 64,
     "referenced_type" : "type-1236"
    }
   ],
   "linker_set_key" : "SL3DGroupingItf_",
   "name" : "SL3DGroupingItf_",
   "referenced_type" : "type-1229",
   "self_type" : "type-1229",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SL3DGroupingItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Commit",
     "referenced_type" : "type-1240"
    },
    {
     "field_name" : "SetDeferred",
     "field_offset" : 64,
     "referenced_type" : "type-1246"
    }
   ],
   "linker_set_key" : "SL3DCommitItf_",
   "name" : "SL3DCommitItf_",
   "referenced_type" : "type-1239",
   "self_type" : "type-1239",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SL3DCommitItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "SLVec3D_",
   "name" : "SLVec3D_",
   "referenced_type" : "type-1248",
   "self_type" : "type-1248",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLVec3D_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetLocationCartesian",
     "referenced_type" : "type-1250"
    },
    {
     "field_name" : "SetLocationSpherical",
     "field_offset" : 64,
     "referenced_type" : "type-1258"
    },
    {
     "field_name" : "Move",
     "field_offset" : 128,
     "referenced_type" : "type-1250"
    },
    {
     "field_name" : "GetLocationCartesian",
     "field_offset" : 192,
     "referenced_type" : "type-1260"
    },
    {
     "field_name" : "SetOrientationVectors",
     "field_offset" : 256,
     "referenced_type" : "type-1263"
    },
    {
     "field_name" : "SetOrientationAngles",
     "field_offset" : 320,
     "referenced_type" : "type-1258"
    },
    {
     "field_name" : "Rotate",
     "field_offset" : 384,
     "referenced_type" : "type-1265"
    },
    {
     "field_name" : "GetOrientationVectors",
     "field_offset" : 448,
     "referenced_type" : "type-1267"
    }
   ],
   "linker_set_key" : "SL3DLocationItf_",
   "name" : "SL3DLocationItf_",
   "referenced_type" : "type-1249",
   "self_type" : "type-1249",
   "size" : 64,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SL3DLocationItf_"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-125",
   "self_type" : "type-125",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-125" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetVelocityCartesian",
     "referenced_type" : "type-1270"
    },
    {
     "field_name" : "SetVelocitySpherical",
     "field_offset" : 64,
     "referenced_type" : "type-1276"
    },
    {
     "field_name" : "GetVelocityCartesian",
     "field_offset" : 128,
     "referenced_type" : "type-1278"
    },
    {
     "field_name" : "SetDopplerFactor",
     "field_offset" : 192,
     "referenced_type" : "type-1280"
    },
    {
     "field_name" : "GetDopplerFactor",
     "field_offset" : 256,
     "referenced_type" : "type-1282"
    }
   ],
   "linker_set_key" : "SL3DDopplerItf_",
   "name" : "SL3DDopplerItf_",
   "referenced_type" : "type-1269",
   "self_type" : "type-1269",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SL3DDopplerItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deviceName",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 80,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 96,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 320,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 336,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "XAAudioInputDescriptor_",
   "name" : "XAAudioInputDescriptor_",
   "referenced_type" : "type-128",
   "self_type" : "type-128",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioInputDescriptor_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetHeadRelative",
     "referenced_type" : "type-1285"
    },
    {
     "field_name" : "GetHeadRelative",
     "field_offset" : 64,
     "referenced_type" : "type-1291"
    },
    {
     "field_name" : "SetRolloffDistances",
     "field_offset" : 128,
     "referenced_type" : "type-1293"
    },
    {
     "field_name" : "GetRolloffDistances",
     "field_offset" : 192,
     "referenced_type" : "type-1295"
    },
    {
     "field_name" : "SetRolloffMaxDistanceMute",
     "field_offset" : 256,
     "referenced_type" : "type-1285"
    },
    {
     "field_name" : "GetRolloffMaxDistanceMute",
     "field_offset" : 320,
     "referenced_type" : "type-1291"
    },
    {
     "field_name" : "SetRolloffFactor",
     "field_offset" : 384,
     "referenced_type" : "type-1297"
    },
    {
     "field_name" : "GetRolloffFactor",
     "field_offset" : 448,
     "referenced_type" : "type-1299"
    },
    {
     "field_name" : "SetRoomRolloffFactor",
     "field_offset" : 512,
     "referenced_type" : "type-1297"
    },
    {
     "field_name" : "GetRoomRolloffFactor",
     "field_offset" : 576,
     "referenced_type" : "type-1299"
    },
    {
     "field_name" : "SetRolloffModel",
     "field_offset" : 640,
     "referenced_type" : "type-1301"
    },
    {
     "field_name" : "GetRolloffModel",
     "field_offset" : 704,
     "referenced_type" : "type-1303"
    },
    {
     "field_name" : "SetCone",
     "field_offset" : 768,
     "referenced_type" : "type-1305"
    },
    {
     "field_name" : "GetCone",
     "field_offset" : 832,
     "referenced_type" : "type-1307"
    }
   ],
   "linker_set_key" : "SL3DSourceItf_",
   "name" : "SL3DSourceItf_",
   "referenced_type" : "type-1284",
   "self_type" : "type-1284",
   "size" : 112,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SL3DSourceItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetSize",
     "referenced_type" : "type-1310"
    },
    {
     "field_name" : "GetSize",
     "field_offset" : 64,
     "referenced_type" : "type-1316"
    },
    {
     "field_name" : "SetOrientationAngles",
     "field_offset" : 128,
     "referenced_type" : "type-1310"
    },
    {
     "field_name" : "SetOrientationVectors",
     "field_offset" : 192,
     "referenced_type" : "type-1318"
    },
    {
     "field_name" : "Rotate",
     "field_offset" : 256,
     "referenced_type" : "type-1320"
    },
    {
     "field_name" : "GetOrientationVectors",
     "field_offset" : 320,
     "referenced_type" : "type-1322"
    }
   ],
   "linker_set_key" : "SL3DMacroscopicItf_",
   "name" : "SL3DMacroscopicItf_",
   "referenced_type" : "type-1309",
   "self_type" : "type-1309",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SL3DMacroscopicItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetChannelMute",
     "referenced_type" : "type-1325"
    },
    {
     "field_name" : "GetChannelMute",
     "field_offset" : 64,
     "referenced_type" : "type-1331"
    },
    {
     "field_name" : "SetChannelSolo",
     "field_offset" : 128,
     "referenced_type" : "type-1325"
    },
    {
     "field_name" : "GetChannelSolo",
     "field_offset" : 192,
     "referenced_type" : "type-1331"
    },
    {
     "field_name" : "GetNumChannels",
     "field_offset" : 256,
     "referenced_type" : "type-1333"
    }
   ],
   "linker_set_key" : "SLMuteSoloItf_",
   "name" : "SLMuteSoloItf_",
   "referenced_type" : "type-1324",
   "self_type" : "type-1324",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLMuteSoloItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "AddInterface",
     "referenced_type" : "type-1336"
    },
    {
     "field_name" : "RemoveInterface",
     "field_offset" : 64,
     "referenced_type" : "type-1342"
    },
    {
     "field_name" : "ResumeInterface",
     "field_offset" : 128,
     "referenced_type" : "type-1336"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 192,
     "referenced_type" : "type-1344"
    }
   ],
   "linker_set_key" : "SLDynamicInterfaceManagementItf_",
   "name" : "SLDynamicInterfaceManagementItf_",
   "referenced_type" : "type-1335",
   "self_type" : "type-1335",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLDynamicInterfaceManagementItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SendMessage",
     "referenced_type" : "type-1349"
    },
    {
     "field_name" : "RegisterMetaEventCallback",
     "field_offset" : 64,
     "referenced_type" : "type-1355"
    },
    {
     "field_name" : "RegisterMIDIMessageCallback",
     "field_offset" : 128,
     "referenced_type" : "type-1355"
    },
    {
     "field_name" : "AddMIDIMessageCallbackFilter",
     "field_offset" : 192,
     "referenced_type" : "type-1359"
    },
    {
     "field_name" : "ClearMIDIMessageCallbackFilter",
     "field_offset" : 256,
     "referenced_type" : "type-1361"
    }
   ],
   "linker_set_key" : "SLMIDIMessageItf_",
   "name" : "SLMIDIMessageItf_",
   "referenced_type" : "type-1348",
   "self_type" : "type-1348",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLMIDIMessageItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-136"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-135",
   "self_type" : "type-135",
   "size" : 12,
   "source_file" : "/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetChannelMute",
     "referenced_type" : "type-1364"
    },
    {
     "field_name" : "GetChannelMute",
     "field_offset" : 64,
     "referenced_type" : "type-1370"
    },
    {
     "field_name" : "SetChannelSolo",
     "field_offset" : 128,
     "referenced_type" : "type-1364"
    },
    {
     "field_name" : "GetChannelSolo",
     "field_offset" : 192,
     "referenced_type" : "type-1370"
    },
    {
     "field_name" : "GetTrackCount",
     "field_offset" : 256,
     "referenced_type" : "type-1372"
    },
    {
     "field_name" : "SetTrackMute",
     "field_offset" : 320,
     "referenced_type" : "type-1374"
    },
    {
     "field_name" : "GetTrackMute",
     "field_offset" : 384,
     "referenced_type" : "type-1376"
    },
    {
     "field_name" : "SetTrackSolo",
     "field_offset" : 448,
     "referenced_type" : "type-1374"
    },
    {
     "field_name" : "GetTrackSolo",
     "field_offset" : 512,
     "referenced_type" : "type-1376"
    }
   ],
   "linker_set_key" : "SLMIDIMuteSoloItf_",
   "name" : "SLMIDIMuteSoloItf_",
   "referenced_type" : "type-1363",
   "self_type" : "type-1363",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLMIDIMuteSoloItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-138"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-137",
   "self_type" : "type-137",
   "size" : 4,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-139" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetTicksPerQuarterNote",
     "referenced_type" : "type-1379"
    },
    {
     "field_name" : "GetTicksPerQuarterNote",
     "field_offset" : 64,
     "referenced_type" : "type-1385"
    },
    {
     "field_name" : "SetMicrosecondsPerQuarterNote",
     "field_offset" : 128,
     "referenced_type" : "type-1379"
    },
    {
     "field_name" : "GetMicrosecondsPerQuarterNote",
     "field_offset" : 192,
     "referenced_type" : "type-1385"
    }
   ],
   "linker_set_key" : "SLMIDITempoItf_",
   "name" : "SLMIDITempoItf_",
   "referenced_type" : "type-1378",
   "self_type" : "type-1378",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLMIDITempoItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetDuration",
     "referenced_type" : "type-1388"
    },
    {
     "field_name" : "SetPosition",
     "field_offset" : 64,
     "referenced_type" : "type-1394"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 128,
     "referenced_type" : "type-1388"
    },
    {
     "field_name" : "SetLoopPoints",
     "field_offset" : 192,
     "referenced_type" : "type-1396"
    },
    {
     "field_name" : "GetLoopPoints",
     "field_offset" : 256,
     "referenced_type" : "type-1398"
    }
   ],
   "linker_set_key" : "SLMIDITimeItf_",
   "name" : "SLMIDITimeItf_",
   "referenced_type" : "type-1387",
   "self_type" : "type-1387",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLMIDITimeItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-137"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-139",
   "self_type" : "type-139",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pDeviceName",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 80,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 96,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 320,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 336,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "XAAudioOutputDescriptor_",
   "name" : "XAAudioOutputDescriptor_",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioOutputDescriptor_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "deviceName",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 80,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 96,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 320,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 336,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "SLAudioInputDescriptor_",
   "name" : "SLAudioInputDescriptor_",
   "referenced_type" : "type-1400",
   "self_type" : "type-1400",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioInputDescriptor_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pDeviceName",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "deviceConnection",
     "field_offset" : 64,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceScope",
     "field_offset" : 80,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "deviceLocation",
     "field_offset" : 96,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "isForTelephony",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samplingRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numOfSamplingRatesSupported",
     "field_offset" : 320,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "maxChannels",
     "field_offset" : 336,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "SLAudioOutputDescriptor_",
   "name" : "SLAudioOutputDescriptor_",
   "referenced_type" : "type-1401",
   "self_type" : "type-1401",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioOutputDescriptor_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maxChannels",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minBitsPerSample",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxBitsPerSample",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSampleRatesSupported",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numSampleRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minBitRate",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxBitRate",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isBitrateRangeContinuous",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pBitratesSupported",
     "field_offset" : 384,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numBitratesSupported",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "modeSetting",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLAudioCodecDescriptor_",
   "name" : "SLAudioCodecDescriptor_",
   "referenced_type" : "type-1402",
   "self_type" : "type-1402",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioCodecDescriptor_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "profileSetting",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "modeSetting",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLAudioCodecProfileMode_",
   "name" : "SLAudioCodecProfileMode_",
   "referenced_type" : "type-1403",
   "self_type" : "type-1403",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioCodecProfileMode_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetAudioDecoders",
     "referenced_type" : "type-1405"
    },
    {
     "field_name" : "GetAudioDecoderCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-1411"
    }
   ],
   "linker_set_key" : "SLAudioDecoderCapabilitiesItf_",
   "name" : "SLAudioDecoderCapabilitiesItf_",
   "referenced_type" : "type-1404",
   "self_type" : "type-1404",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioDecoderCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetAvailableAudioInputs",
     "referenced_type" : "type-1415"
    },
    {
     "field_name" : "QueryAudioInputCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-1421"
    },
    {
     "field_name" : "RegisterAvailableAudioInputsChangedCallback",
     "field_offset" : 128,
     "referenced_type" : "type-1424"
    },
    {
     "field_name" : "GetAvailableAudioOutputs",
     "field_offset" : 192,
     "referenced_type" : "type-1415"
    },
    {
     "field_name" : "QueryAudioOutputCapabilities",
     "field_offset" : 256,
     "referenced_type" : "type-1428"
    },
    {
     "field_name" : "RegisterAvailableAudioOutputsChangedCallback",
     "field_offset" : 320,
     "referenced_type" : "type-1424"
    },
    {
     "field_name" : "RegisterDefaultDeviceIDMapChangedCallback",
     "field_offset" : 384,
     "referenced_type" : "type-1431"
    },
    {
     "field_name" : "GetAssociatedAudioInputs",
     "field_offset" : 448,
     "referenced_type" : "type-1435"
    },
    {
     "field_name" : "GetAssociatedAudioOutputs",
     "field_offset" : 512,
     "referenced_type" : "type-1435"
    },
    {
     "field_name" : "GetDefaultAudioDevices",
     "field_offset" : 576,
     "referenced_type" : "type-1435"
    },
    {
     "field_name" : "QuerySampleFormatsSupported",
     "field_offset" : 640,
     "referenced_type" : "type-1437"
    }
   ],
   "linker_set_key" : "SLAudioIODeviceCapabilitiesItf_",
   "name" : "SLAudioIODeviceCapabilitiesItf_",
   "referenced_type" : "type-1414",
   "self_type" : "type-1414",
   "size" : 88,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioIODeviceCapabilitiesItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelsIn",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelsOut",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rateControl",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "streamFormat",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "encodeOptions",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "blockAlignment",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLAudioEncoderSettings_",
   "name" : "SLAudioEncoderSettings_",
   "referenced_type" : "type-1439",
   "self_type" : "type-1439",
   "size" : 52,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioEncoderSettings_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-145"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "android::wp<android::AudioSystem::AudioDeviceCallback>",
   "name" : "android::wp<android::AudioSystem::AudioDeviceCallback>",
   "record_kind" : "class",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-146" ],
   "unique_id" : "_ZTSN7android2wpINS_11AudioSystem19AudioDeviceCallbackEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetAudioEncoders",
     "referenced_type" : "type-1441"
    },
    {
     "field_name" : "GetAudioEncoderCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-1447"
    }
   ],
   "linker_set_key" : "SLAudioEncoderCapabilitiesItf_",
   "name" : "SLAudioEncoderCapabilitiesItf_",
   "referenced_type" : "type-1440",
   "self_type" : "type-1440",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioEncoderCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetEncoderSettings",
     "referenced_type" : "type-1450"
    },
    {
     "field_name" : "GetEncoderSettings",
     "field_offset" : 64,
     "referenced_type" : "type-1450"
    }
   ],
   "linker_set_key" : "SLAudioEncoderItf_",
   "name" : "SLAudioEncoderItf_",
   "referenced_type" : "type-1449",
   "self_type" : "type-1449",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLAudioEncoderItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "type-1458"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-1464"
    },
    {
     "field_name" : "SetStrength",
     "field_offset" : 128,
     "referenced_type" : "type-1466"
    },
    {
     "field_name" : "GetRoundedStrength",
     "field_offset" : 192,
     "referenced_type" : "type-1468"
    },
    {
     "field_name" : "IsStrengthSupported",
     "field_offset" : 256,
     "referenced_type" : "type-1464"
    }
   ],
   "linker_set_key" : "SLBassBoostItf_",
   "name" : "SLBassBoostItf_",
   "referenced_type" : "type-1457",
   "self_type" : "type-1457",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLBassBoostItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "android::AudioSystem::AudioDeviceCallback",
   "name" : "android::AudioSystem::AudioDeviceCallback",
   "record_kind" : "class",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioSystem.h",
   "unique_id" : "_ZTSN7android11AudioSystem19AudioDeviceCallbackE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AudioSystem19AudioDeviceCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioSystem19AudioDeviceCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioSystem19AudioDeviceCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11AudioSystem19AudioDeviceCallback19onAudioDeviceUpdateEii"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-148"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetItemCount",
     "referenced_type" : "type-1471"
    },
    {
     "field_name" : "GetKeySize",
     "field_offset" : 64,
     "referenced_type" : "type-1477"
    },
    {
     "field_name" : "GetKey",
     "field_offset" : 128,
     "referenced_type" : "type-1479"
    },
    {
     "field_name" : "GetValueSize",
     "field_offset" : 192,
     "referenced_type" : "type-1477"
    },
    {
     "field_name" : "GetValue",
     "field_offset" : 256,
     "referenced_type" : "type-1479"
    },
    {
     "field_name" : "AddKeyFilter",
     "field_offset" : 320,
     "referenced_type" : "type-1482"
    },
    {
     "field_name" : "ClearKeyFilter",
     "field_offset" : 384,
     "referenced_type" : "type-1484"
    }
   ],
   "linker_set_key" : "SLMetadataExtractionItf_",
   "name" : "SLMetadataExtractionItf_",
   "referenced_type" : "type-1470",
   "self_type" : "type-1470",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLMetadataExtractionItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetPitch",
     "referenced_type" : "type-1487"
    },
    {
     "field_name" : "GetPitch",
     "field_offset" : 64,
     "referenced_type" : "type-1493"
    },
    {
     "field_name" : "GetPitchCapabilities",
     "field_offset" : 128,
     "referenced_type" : "type-1495"
    }
   ],
   "linker_set_key" : "SLPitchItf_",
   "name" : "SLPitchItf_",
   "referenced_type" : "type-1486",
   "self_type" : "type-1486",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLPitchItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetRate",
     "referenced_type" : "type-1498"
    },
    {
     "field_name" : "GetRate",
     "field_offset" : 64,
     "referenced_type" : "type-1504"
    },
    {
     "field_name" : "GetRatePitchCapabilities",
     "field_offset" : 128,
     "referenced_type" : "type-1506"
    }
   ],
   "linker_set_key" : "SLRatePitchItf_",
   "name" : "SLRatePitchItf_",
   "referenced_type" : "type-1497",
   "self_type" : "type-1497",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLRatePitchItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "type-1509"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-1515"
    },
    {
     "field_name" : "SetStrength",
     "field_offset" : 128,
     "referenced_type" : "type-1517"
    },
    {
     "field_name" : "GetRoundedStrength",
     "field_offset" : 192,
     "referenced_type" : "type-1519"
    },
    {
     "field_name" : "IsStrengthSupported",
     "field_offset" : 256,
     "referenced_type" : "type-1515"
    }
   ],
   "linker_set_key" : "SLVirtualizerItf_",
   "name" : "SLVirtualizerItf_",
   "referenced_type" : "type-1508",
   "self_type" : "type-1508",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLVirtualizerItf_"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-152",
   "self_type" : "type-152",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "RegisterVisualizationCallback",
     "referenced_type" : "type-1522"
    },
    {
     "field_name" : "GetMaxRate",
     "field_offset" : 64,
     "referenced_type" : "type-1530"
    }
   ],
   "linker_set_key" : "SLVisualizationItf_",
   "name" : "SLVisualizationItf_",
   "referenced_type" : "type-1521",
   "self_type" : "type-1521",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLVisualizationItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "CreateLEDDevice",
     "referenced_type" : "type-1533"
    },
    {
     "field_name" : "CreateVibraDevice",
     "field_offset" : 64,
     "referenced_type" : "type-1533"
    },
    {
     "field_name" : "CreateAudioPlayer",
     "field_offset" : 128,
     "referenced_type" : "type-1542"
    },
    {
     "field_name" : "CreateAudioRecorder",
     "field_offset" : 192,
     "referenced_type" : "type-1542"
    },
    {
     "field_name" : "CreateMidiPlayer",
     "field_offset" : 256,
     "referenced_type" : "type-1547"
    },
    {
     "field_name" : "CreateListener",
     "field_offset" : 320,
     "referenced_type" : "type-1549"
    },
    {
     "field_name" : "Create3DGroup",
     "field_offset" : 384,
     "referenced_type" : "type-1549"
    },
    {
     "field_name" : "CreateOutputMix",
     "field_offset" : 448,
     "referenced_type" : "type-1549"
    },
    {
     "field_name" : "CreateMetadataExtractor",
     "field_offset" : 512,
     "referenced_type" : "type-1551"
    },
    {
     "field_name" : "CreateExtensionObject",
     "field_offset" : 576,
     "referenced_type" : "type-1553"
    },
    {
     "field_name" : "QueryNumSupportedInterfaces",
     "field_offset" : 640,
     "referenced_type" : "type-1555"
    },
    {
     "field_name" : "QuerySupportedInterfaces",
     "field_offset" : 704,
     "referenced_type" : "type-1557"
    },
    {
     "field_name" : "QueryNumSupportedExtensions",
     "field_offset" : 768,
     "referenced_type" : "type-1559"
    },
    {
     "field_name" : "QuerySupportedExtension",
     "field_offset" : 832,
     "referenced_type" : "type-1561"
    },
    {
     "field_name" : "IsExtensionSupported",
     "field_offset" : 896,
     "referenced_type" : "type-1563"
    }
   ],
   "linker_set_key" : "SLEngineItf_",
   "name" : "SLEngineItf_",
   "referenced_type" : "type-1532",
   "self_type" : "type-1532",
   "size" : 120,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLEngineItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-155"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "android::wp<android::media::VolumeShaper::Configuration>",
   "name" : "android::wp<android::media::VolumeShaper::Configuration>",
   "record_kind" : "class",
   "referenced_type" : "type-154",
   "self_type" : "type-154",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-157" ],
   "unique_id" : "_ZTSN7android2wpINS_5media12VolumeShaper13ConfigurationEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "SLDataSource_",
   "name" : "SLDataSource_",
   "referenced_type" : "type-1545",
   "self_type" : "type-1545",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLDataSource_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "QuerySupportedProfiles",
     "referenced_type" : "type-1566"
    },
    {
     "field_name" : "QueryAvailableVoices",
     "field_offset" : 64,
     "referenced_type" : "type-1572"
    },
    {
     "field_name" : "QueryNumberOfMIDISynthesizers",
     "field_offset" : 128,
     "referenced_type" : "type-1574"
    },
    {
     "field_name" : "QueryAPIVersion",
     "field_offset" : 192,
     "referenced_type" : "type-1576"
    },
    {
     "field_name" : "QueryLEDCapabilities",
     "field_offset" : 256,
     "referenced_type" : "type-1578"
    },
    {
     "field_name" : "QueryVibraCapabilities",
     "field_offset" : 320,
     "referenced_type" : "type-1582"
    },
    {
     "field_name" : "IsThreadSafe",
     "field_offset" : 384,
     "referenced_type" : "type-1586"
    }
   ],
   "linker_set_key" : "SLEngineCapabilitiesItf_",
   "name" : "SLEngineCapabilitiesItf_",
   "referenced_type" : "type-1565",
   "self_type" : "type-1565",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLEngineCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-159"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "android::wp<android::media::VolumeShaper::Operation>",
   "name" : "android::wp<android::media::VolumeShaper::Operation>",
   "record_kind" : "class",
   "referenced_type" : "type-158",
   "self_type" : "type-158",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-161" ],
   "unique_id" : "_ZTSN7android2wpINS_5media12VolumeShaper9OperationEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ledCount",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "primaryLED",
     "field_offset" : 8,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "colorMask",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLLEDDescriptor_",
   "name" : "SLLEDDescriptor_",
   "referenced_type" : "type-1581",
   "self_type" : "type-1581",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLLEDDescriptor_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "supportsFrequency",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "supportsIntensity",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minFrequency",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFrequency",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLVibraDescriptor_",
   "name" : "SLVibraDescriptor_",
   "referenced_type" : "type-1585",
   "self_type" : "type-1585",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLVibraDescriptor_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EnterCriticalSection",
     "referenced_type" : "type-1589"
    },
    {
     "field_name" : "ExitCriticalSection",
     "field_offset" : 64,
     "referenced_type" : "type-1589"
    }
   ],
   "linker_set_key" : "SLThreadSyncItf_",
   "name" : "SLThreadSyncItf_",
   "referenced_type" : "type-1588",
   "self_type" : "type-1588",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLThreadSyncItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "feature",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLEngineOption_",
   "name" : "SLEngineOption_",
   "referenced_type" : "type-1595",
   "self_type" : "type-1595",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLEngineOption_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_low",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "time_mid",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "time_hi_and_version",
     "field_offset" : 48,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "clock_seq",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "XAInterfaceID_",
   "name" : "XAInterfaceID_",
   "referenced_type" : "type-1598",
   "self_type" : "type-1598",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAInterfaceID_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Realize",
     "referenced_type" : "type-1603"
    },
    {
     "field_name" : "Resume",
     "field_offset" : 64,
     "referenced_type" : "type-1603"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 128,
     "referenced_type" : "type-1609"
    },
    {
     "field_name" : "GetInterface",
     "field_offset" : 192,
     "referenced_type" : "type-1611"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 256,
     "referenced_type" : "type-1613"
    },
    {
     "field_name" : "AbortAsyncOperation",
     "field_offset" : 320,
     "referenced_type" : "type-1617"
    },
    {
     "field_name" : "Destroy",
     "field_offset" : 384,
     "referenced_type" : "type-1617"
    },
    {
     "field_name" : "SetPriority",
     "field_offset" : 448,
     "referenced_type" : "type-1619"
    },
    {
     "field_name" : "GetPriority",
     "field_offset" : 512,
     "referenced_type" : "type-1621"
    },
    {
     "field_name" : "SetLossOfControlInterfaces",
     "field_offset" : 576,
     "referenced_type" : "type-1623"
    }
   ],
   "linker_set_key" : "XAObjectItf_",
   "name" : "XAObjectItf_",
   "referenced_type" : "type-1602",
   "self_type" : "type-1602",
   "size" : 80,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAObjectItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetAvailableAudioInputs",
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "QueryAudioInputCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "RegisterAvailableAudioInputsChangedCallback",
     "field_offset" : 128,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "GetAvailableAudioOutputs",
     "field_offset" : 192,
     "referenced_type" : "type-163"
    },
    {
     "field_name" : "QueryAudioOutputCapabilities",
     "field_offset" : 256,
     "referenced_type" : "type-176"
    },
    {
     "field_name" : "RegisterAvailableAudioOutputsChangedCallback",
     "field_offset" : 320,
     "referenced_type" : "type-172"
    },
    {
     "field_name" : "RegisterDefaultDeviceIDMapChangedCallback",
     "field_offset" : 384,
     "referenced_type" : "type-179"
    },
    {
     "field_name" : "GetAssociatedAudioInputs",
     "field_offset" : 448,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "GetAssociatedAudioOutputs",
     "field_offset" : 512,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "GetDefaultAudioDevices",
     "field_offset" : 576,
     "referenced_type" : "type-183"
    },
    {
     "field_name" : "QuerySampleFormatsSupported",
     "field_offset" : 640,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "XAAudioIODeviceCapabilitiesItf_",
   "name" : "XAAudioIODeviceCapabilitiesItf_",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 88,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioIODeviceCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetMode",
     "referenced_type" : "type-1632"
    },
    {
     "field_name" : "GetChildCount",
     "field_offset" : 64,
     "referenced_type" : "type-1634"
    },
    {
     "field_name" : "GetChildMIMETypeSize",
     "field_offset" : 128,
     "referenced_type" : "type-1636"
    },
    {
     "field_name" : "GetChildInfo",
     "field_offset" : 192,
     "referenced_type" : "type-1638"
    },
    {
     "field_name" : "SetActiveNode",
     "field_offset" : 256,
     "referenced_type" : "type-1632"
    }
   ],
   "linker_set_key" : "XAMetadataTraversalItf_",
   "name" : "XAMetadataTraversalItf_",
   "referenced_type" : "type-1631",
   "self_type" : "type-1631",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAMetadataTraversalItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetConfiguration",
     "referenced_type" : "type-1640"
    },
    {
     "field_name" : "GetConfiguration",
     "field_offset" : 64,
     "referenced_type" : "type-1646"
    }
   ],
   "linker_set_key" : "XAConfigExtensionsItf_",
   "name" : "XAConfigExtensionsItf_",
   "referenced_type" : "type-1639",
   "self_type" : "type-1639",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAConfigExtensionsItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "AddInterface",
     "referenced_type" : "type-1649"
    },
    {
     "field_name" : "RemoveInterface",
     "field_offset" : 64,
     "referenced_type" : "type-1655"
    },
    {
     "field_name" : "ResumeInterface",
     "field_offset" : 128,
     "referenced_type" : "type-1649"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 192,
     "referenced_type" : "type-1657"
    }
   ],
   "linker_set_key" : "XADynamicInterfaceManagementItf_",
   "name" : "XADynamicInterfaceManagementItf_",
   "referenced_type" : "type-1648",
   "self_type" : "type-1648",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADynamicInterfaceManagementItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "XADataSink_",
   "name" : "XADataSink_",
   "referenced_type" : "type-1661",
   "self_type" : "type-1661",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataSink_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mimeType",
     "field_offset" : 64,
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "containerType",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XADataFormat_MIME_",
   "name" : "XADataFormat_MIME_",
   "referenced_type" : "type-1662",
   "self_type" : "type-1662",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataFormat_MIME_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numChannels",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "samplesPerSec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "containerSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "endianness",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XADataFormat_PCM_",
   "name" : "XADataFormat_PCM_",
   "referenced_type" : "type-1663",
   "self_type" : "type-1663",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataFormat_PCM_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "colorFormat",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "width",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "stride",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XADataFormat_RawImage_",
   "name" : "XADataFormat_RawImage_",
   "referenced_type" : "type-1664",
   "self_type" : "type-1664",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataFormat_RawImage_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pAddress",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "length",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XADataLocator_Address_",
   "name" : "XADataLocator_Address_",
   "referenced_type" : "type-1665",
   "self_type" : "type-1665",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataLocator_Address_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceType",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceID",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "device",
     "field_offset" : 128,
     "referenced_type" : "type-1605"
    }
   ],
   "linker_set_key" : "XADataLocator_IODevice_",
   "name" : "XADataLocator_IODevice_",
   "referenced_type" : "type-1666",
   "self_type" : "type-1666",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataLocator_IODevice_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "hWindow",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "hDisplay",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "XADataLocator_NativeDisplay_",
   "name" : "XADataLocator_NativeDisplay_",
   "referenced_type" : "type-1667",
   "self_type" : "type-1667",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataLocator_NativeDisplay_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "outputMix",
     "field_offset" : 64,
     "referenced_type" : "type-1605"
    }
   ],
   "linker_set_key" : "XADataLocator_OutputMix",
   "name" : "XADataLocator_OutputMix",
   "referenced_type" : "type-1668",
   "self_type" : "type-1668",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataLocator_OutputMix"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "URI",
     "field_offset" : 64,
     "referenced_type" : "type-129"
    }
   ],
   "linker_set_key" : "XADataLocator_URI_",
   "name" : "XADataLocator_URI_",
   "referenced_type" : "type-1669",
   "self_type" : "type-1669",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataLocator_URI_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "feature",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAEngineOption_",
   "name" : "XAEngineOption_",
   "referenced_type" : "type-1670",
   "self_type" : "type-1670",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAEngineOption_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ledCount",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "primaryLED",
     "field_offset" : 8,
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "colorMask",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XALEDDescriptor_",
   "name" : "XALEDDescriptor_",
   "referenced_type" : "type-1671",
   "self_type" : "type-1671",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XALEDDescriptor_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "supportsFrequency",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "supportsIntensity",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minFrequency",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFrequency",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAVibraDescriptor_",
   "name" : "XAVibraDescriptor_",
   "referenced_type" : "type-1672",
   "self_type" : "type-1672",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVibraDescriptor_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "CreateCameraDevice",
     "referenced_type" : "type-1674"
    },
    {
     "field_name" : "CreateRadioDevice",
     "field_offset" : 64,
     "referenced_type" : "type-1682"
    },
    {
     "field_name" : "CreateLEDDevice",
     "field_offset" : 128,
     "referenced_type" : "type-1674"
    },
    {
     "field_name" : "CreateVibraDevice",
     "field_offset" : 192,
     "referenced_type" : "type-1674"
    },
    {
     "field_name" : "CreateMediaPlayer",
     "field_offset" : 256,
     "referenced_type" : "type-1684"
    },
    {
     "field_name" : "CreateMediaRecorder",
     "field_offset" : 320,
     "referenced_type" : "type-1689"
    },
    {
     "field_name" : "CreateOutputMix",
     "field_offset" : 384,
     "referenced_type" : "type-1682"
    },
    {
     "field_name" : "CreateMetadataExtractor",
     "field_offset" : 448,
     "referenced_type" : "type-1691"
    },
    {
     "field_name" : "CreateExtensionObject",
     "field_offset" : 512,
     "referenced_type" : "type-1693"
    },
    {
     "field_name" : "GetImplementationInfo",
     "field_offset" : 576,
     "referenced_type" : "type-1695"
    },
    {
     "field_name" : "QuerySupportedProfiles",
     "field_offset" : 640,
     "referenced_type" : "type-1697"
    },
    {
     "field_name" : "QueryNumSupportedInterfaces",
     "field_offset" : 704,
     "referenced_type" : "type-1699"
    },
    {
     "field_name" : "QuerySupportedInterfaces",
     "field_offset" : 768,
     "referenced_type" : "type-1701"
    },
    {
     "field_name" : "QueryNumSupportedExtensions",
     "field_offset" : 832,
     "referenced_type" : "type-1703"
    },
    {
     "field_name" : "QuerySupportedExtension",
     "field_offset" : 896,
     "referenced_type" : "type-1705"
    },
    {
     "field_name" : "IsExtensionSupported",
     "field_offset" : 960,
     "referenced_type" : "type-1707"
    },
    {
     "field_name" : "QueryLEDCapabilities",
     "field_offset" : 1024,
     "referenced_type" : "type-1709"
    },
    {
     "field_name" : "QueryVibraCapabilities",
     "field_offset" : 1088,
     "referenced_type" : "type-1712"
    }
   ],
   "linker_set_key" : "XAEngineItf_",
   "name" : "XAEngineItf_",
   "referenced_type" : "type-1673",
   "self_type" : "type-1673",
   "size" : 144,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAEngineItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pLocator",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "pFormat",
     "field_offset" : 64,
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "XADataSource_",
   "name" : "XADataSource_",
   "referenced_type" : "type-1687",
   "self_type" : "type-1687",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADataSource_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "QueryRDSSignal",
     "referenced_type" : "type-1716"
    },
    {
     "field_name" : "GetProgrammeServiceName",
     "field_offset" : 64,
     "referenced_type" : "type-1722"
    },
    {
     "field_name" : "GetRadioText",
     "field_offset" : 128,
     "referenced_type" : "type-1722"
    },
    {
     "field_name" : "GetRadioTextPlus",
     "field_offset" : 192,
     "referenced_type" : "type-1724"
    },
    {
     "field_name" : "GetProgrammeType",
     "field_offset" : 256,
     "referenced_type" : "type-1716"
    },
    {
     "field_name" : "GetProgrammeTypeString",
     "field_offset" : 320,
     "referenced_type" : "type-1726"
    },
    {
     "field_name" : "GetProgrammeIdentificationCode",
     "field_offset" : 384,
     "referenced_type" : "type-1728"
    },
    {
     "field_name" : "GetClockTime",
     "field_offset" : 448,
     "referenced_type" : "type-1730"
    },
    {
     "field_name" : "GetTrafficAnnouncement",
     "field_offset" : 512,
     "referenced_type" : "type-1716"
    },
    {
     "field_name" : "GetTrafficProgramme",
     "field_offset" : 576,
     "referenced_type" : "type-1716"
    },
    {
     "field_name" : "SeekByProgrammeType",
     "field_offset" : 640,
     "referenced_type" : "type-1732"
    },
    {
     "field_name" : "SeekTrafficAnnouncement",
     "field_offset" : 704,
     "referenced_type" : "type-1734"
    },
    {
     "field_name" : "SeekTrafficProgramme",
     "field_offset" : 768,
     "referenced_type" : "type-1734"
    },
    {
     "field_name" : "SetAutomaticSwitching",
     "field_offset" : 832,
     "referenced_type" : "type-1734"
    },
    {
     "field_name" : "GetAutomaticSwitching",
     "field_offset" : 896,
     "referenced_type" : "type-1716"
    },
    {
     "field_name" : "SetAutomaticTrafficAnnouncement",
     "field_offset" : 960,
     "referenced_type" : "type-1734"
    },
    {
     "field_name" : "GetAutomaticTrafficAnnouncement",
     "field_offset" : 1024,
     "referenced_type" : "type-1716"
    },
    {
     "field_name" : "GetODAGroup",
     "field_offset" : 1088,
     "referenced_type" : "type-1736"
    },
    {
     "field_name" : "SubscribeODAGroup",
     "field_offset" : 1152,
     "referenced_type" : "type-1740"
    },
    {
     "field_name" : "UnsubscribeODAGroup",
     "field_offset" : 1216,
     "referenced_type" : "type-1742"
    },
    {
     "field_name" : "ListODAGroupSubscriptions",
     "field_offset" : 1280,
     "referenced_type" : "type-1744"
    },
    {
     "field_name" : "RegisterRDSCallback",
     "field_offset" : 1344,
     "referenced_type" : "type-1746"
    },
    {
     "field_name" : "RegisterODADataCallback",
     "field_offset" : 1408,
     "referenced_type" : "type-1750"
    }
   ],
   "linker_set_key" : "XARDSItf_",
   "name" : "XARDSItf_",
   "referenced_type" : "type-1715",
   "self_type" : "type-1715",
   "size" : 184,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XARDSItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EnterCriticalSection",
     "referenced_type" : "type-1755"
    },
    {
     "field_name" : "ExitCriticalSection",
     "field_offset" : 64,
     "referenced_type" : "type-1755"
    }
   ],
   "linker_set_key" : "XAThreadSyncItf_",
   "name" : "XAThreadSyncItf_",
   "referenced_type" : "type-1754",
   "self_type" : "type-1754",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAThreadSyncItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetPlayState",
     "referenced_type" : "type-1762"
    },
    {
     "field_name" : "GetPlayState",
     "field_offset" : 64,
     "referenced_type" : "type-1768"
    },
    {
     "field_name" : "GetDuration",
     "field_offset" : 128,
     "referenced_type" : "type-1768"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 192,
     "referenced_type" : "type-1768"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 256,
     "referenced_type" : "type-1770"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 320,
     "referenced_type" : "type-1762"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 384,
     "referenced_type" : "type-1768"
    },
    {
     "field_name" : "SetMarkerPosition",
     "field_offset" : 448,
     "referenced_type" : "type-1762"
    },
    {
     "field_name" : "ClearMarkerPosition",
     "field_offset" : 512,
     "referenced_type" : "type-1774"
    },
    {
     "field_name" : "GetMarkerPosition",
     "field_offset" : 576,
     "referenced_type" : "type-1768"
    },
    {
     "field_name" : "SetPositionUpdatePeriod",
     "field_offset" : 640,
     "referenced_type" : "type-1762"
    },
    {
     "field_name" : "GetPositionUpdatePeriod",
     "field_offset" : 704,
     "referenced_type" : "type-1768"
    }
   ],
   "linker_set_key" : "XAPlayItf_",
   "name" : "XAPlayItf_",
   "referenced_type" : "type-1761",
   "self_type" : "type-1761",
   "size" : 96,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAPlayItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hue",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "saturation",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "lightness",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "SLHSL_",
   "name" : "SLHSL_",
   "referenced_type" : "type-1776",
   "self_type" : "type-1776",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLHSL_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetRate",
     "referenced_type" : "type-1778"
    },
    {
     "field_name" : "GetRate",
     "field_offset" : 64,
     "referenced_type" : "type-1784"
    },
    {
     "field_name" : "SetPropertyConstraints",
     "field_offset" : 128,
     "referenced_type" : "type-1786"
    },
    {
     "field_name" : "GetProperties",
     "field_offset" : 192,
     "referenced_type" : "type-1788"
    },
    {
     "field_name" : "GetCapabilitiesOfRate",
     "field_offset" : 256,
     "referenced_type" : "type-1790"
    },
    {
     "field_name" : "GetRateRange",
     "field_offset" : 320,
     "referenced_type" : "type-1792"
    }
   ],
   "linker_set_key" : "XAPlaybackRateItf_",
   "name" : "XAPlaybackRateItf_",
   "referenced_type" : "type-1777",
   "self_type" : "type-1777",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAPlaybackRateItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ActivateLEDArray",
     "referenced_type" : "type-1795"
    },
    {
     "field_name" : "IsLEDArrayActivated",
     "field_offset" : 64,
     "referenced_type" : "type-1801"
    },
    {
     "field_name" : "SetColor",
     "field_offset" : 128,
     "referenced_type" : "type-1803"
    },
    {
     "field_name" : "GetColor",
     "field_offset" : 192,
     "referenced_type" : "type-1807"
    }
   ],
   "linker_set_key" : "SLLEDArrayItf_",
   "name" : "SLLEDArrayItf_",
   "referenced_type" : "type-1794",
   "self_type" : "type-1794",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLLEDArrayItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetPrefetchStatus",
     "referenced_type" : "type-1811"
    },
    {
     "field_name" : "GetFillLevel",
     "field_offset" : 64,
     "referenced_type" : "type-1817"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 128,
     "referenced_type" : "type-1819"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 192,
     "referenced_type" : "type-1823"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 256,
     "referenced_type" : "type-1811"
    },
    {
     "field_name" : "SetFillUpdatePeriod",
     "field_offset" : 320,
     "referenced_type" : "type-1825"
    },
    {
     "field_name" : "GetFillUpdatePeriod",
     "field_offset" : 384,
     "referenced_type" : "type-1817"
    }
   ],
   "linker_set_key" : "XAPrefetchStatusItf_",
   "name" : "XAPrefetchStatusItf_",
   "referenced_type" : "type-1810",
   "self_type" : "type-1810",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAPrefetchStatusItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetPosition",
     "referenced_type" : "type-1828"
    },
    {
     "field_name" : "SetLoop",
     "field_offset" : 64,
     "referenced_type" : "type-1834"
    },
    {
     "field_name" : "GetLoop",
     "field_offset" : 128,
     "referenced_type" : "type-1836"
    }
   ],
   "linker_set_key" : "XASeekItf_",
   "name" : "XASeekItf_",
   "referenced_type" : "type-1827",
   "self_type" : "type-1827",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XASeekItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetVolumeLevel",
     "referenced_type" : "type-1839"
    },
    {
     "field_name" : "GetVolumeLevel",
     "field_offset" : 64,
     "referenced_type" : "type-1845"
    },
    {
     "field_name" : "GetMaxVolumeLevel",
     "field_offset" : 128,
     "referenced_type" : "type-1845"
    },
    {
     "field_name" : "SetMute",
     "field_offset" : 192,
     "referenced_type" : "type-1847"
    },
    {
     "field_name" : "GetMute",
     "field_offset" : 256,
     "referenced_type" : "type-1849"
    },
    {
     "field_name" : "EnableStereoPosition",
     "field_offset" : 320,
     "referenced_type" : "type-1847"
    },
    {
     "field_name" : "IsEnabledStereoPosition",
     "field_offset" : 384,
     "referenced_type" : "type-1849"
    },
    {
     "field_name" : "SetStereoPosition",
     "field_offset" : 448,
     "referenced_type" : "type-1839"
    },
    {
     "field_name" : "GetStereoPosition",
     "field_offset" : 512,
     "referenced_type" : "type-1845"
    }
   ],
   "linker_set_key" : "XAVolumeItf_",
   "name" : "XAVolumeItf_",
   "referenced_type" : "type-1838",
   "self_type" : "type-1838",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVolumeItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetBrightness",
     "referenced_type" : "type-1852"
    },
    {
     "field_name" : "GetBrightness",
     "field_offset" : 64,
     "referenced_type" : "type-1858"
    },
    {
     "field_name" : "SetContrast",
     "field_offset" : 128,
     "referenced_type" : "type-1860"
    },
    {
     "field_name" : "GetContrast",
     "field_offset" : 192,
     "referenced_type" : "type-1862"
    },
    {
     "field_name" : "SetGamma",
     "field_offset" : 256,
     "referenced_type" : "type-1864"
    },
    {
     "field_name" : "GetGamma",
     "field_offset" : 320,
     "referenced_type" : "type-1866"
    },
    {
     "field_name" : "GetSupportedGammaSettings",
     "field_offset" : 384,
     "referenced_type" : "type-1868"
    }
   ],
   "linker_set_key" : "XAImageControlsItf_",
   "name" : "XAImageControlsItf_",
   "referenced_type" : "type-1851",
   "self_type" : "type-1851",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageControlsItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-188"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "android::wp<android::IMediaDeathNotifier>",
   "name" : "android::wp<android::IMediaDeathNotifier>",
   "record_kind" : "class",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-189" ],
   "unique_id" : "_ZTSN7android2wpINS_19IMediaDeathNotifierEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "QuerySupportedImageEffects",
     "referenced_type" : "type-1872"
    },
    {
     "field_name" : "EnableImageEffect",
     "field_offset" : 64,
     "referenced_type" : "type-1878"
    },
    {
     "field_name" : "DisableImageEffect",
     "field_offset" : 128,
     "referenced_type" : "type-1878"
    },
    {
     "field_name" : "IsImageEffectEnabled",
     "field_offset" : 192,
     "referenced_type" : "type-1872"
    }
   ],
   "linker_set_key" : "XAImageEffectsItf_",
   "name" : "XAImageEffectsItf_",
   "referenced_type" : "type-1871",
   "self_type" : "type-1871",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageEffectsItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XARectangle_",
   "name" : "XARectangle_",
   "referenced_type" : "type-1880",
   "self_type" : "type-1880",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XARectangle_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetRotation",
     "referenced_type" : "type-1882"
    },
    {
     "field_name" : "IsArbitraryRotationSupported",
     "field_offset" : 64,
     "referenced_type" : "type-1888"
    },
    {
     "field_name" : "SetScaleOptions",
     "field_offset" : 128,
     "referenced_type" : "type-1890"
    },
    {
     "field_name" : "SetSourceRectangle",
     "field_offset" : 192,
     "referenced_type" : "type-1892"
    },
    {
     "field_name" : "SetDestinationRectangle",
     "field_offset" : 256,
     "referenced_type" : "type-1892"
    },
    {
     "field_name" : "SetMirror",
     "field_offset" : 320,
     "referenced_type" : "type-1896"
    },
    {
     "field_name" : "Commit",
     "field_offset" : 384,
     "referenced_type" : "type-1898"
    }
   ],
   "linker_set_key" : "XAVideoPostProcessingItf_",
   "name" : "XAVideoPostProcessingItf_",
   "referenced_type" : "type-1881",
   "self_type" : "type-1881",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVideoPostProcessingItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "android::IMediaDeathNotifier",
   "name" : "android::IMediaDeathNotifier",
   "record_kind" : "class",
   "referenced_type" : "type-189",
   "self_type" : "type-189",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmedia/include/media/IMediaDeathNotifier.h",
   "unique_id" : "_ZTSN7android19IMediaDeathNotifierE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19IMediaDeathNotifierE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19IMediaDeathNotifierD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19IMediaDeathNotifierD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android19IMediaDeathNotifier4diedEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19IMediaDeathNotifierE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android19IMediaDeathNotifierD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android19IMediaDeathNotifierD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "URI",
     "field_offset" : 64,
     "referenced_type" : "type-129"
    }
   ],
   "linker_set_key" : "SLDataLocator_URI_",
   "name" : "SLDataLocator_URI_",
   "referenced_type" : "type-1900",
   "self_type" : "type-1900",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLDataLocator_URI_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetRecordState",
     "referenced_type" : "type-1902"
    },
    {
     "field_name" : "GetRecordState",
     "field_offset" : 64,
     "referenced_type" : "type-1908"
    },
    {
     "field_name" : "SetDurationLimit",
     "field_offset" : 128,
     "referenced_type" : "type-1902"
    },
    {
     "field_name" : "GetPosition",
     "field_offset" : 192,
     "referenced_type" : "type-1908"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 256,
     "referenced_type" : "type-1910"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 320,
     "referenced_type" : "type-1902"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 384,
     "referenced_type" : "type-1908"
    },
    {
     "field_name" : "SetMarkerPosition",
     "field_offset" : 448,
     "referenced_type" : "type-1902"
    },
    {
     "field_name" : "ClearMarkerPosition",
     "field_offset" : 512,
     "referenced_type" : "type-1914"
    },
    {
     "field_name" : "GetMarkerPosition",
     "field_offset" : 576,
     "referenced_type" : "type-1908"
    },
    {
     "field_name" : "SetPositionUpdatePeriod",
     "field_offset" : 640,
     "referenced_type" : "type-1902"
    },
    {
     "field_name" : "GetPositionUpdatePeriod",
     "field_offset" : 704,
     "referenced_type" : "type-1908"
    }
   ],
   "linker_set_key" : "XARecordItf_",
   "name" : "XARecordItf_",
   "referenced_type" : "type-1901",
   "self_type" : "type-1901",
   "size" : 96,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XARecordItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-192"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "android::wp<android::IMemory>",
   "name" : "android::wp<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-191",
   "self_type" : "type-191",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-193" ],
   "unique_id" : "_ZTSN7android2wpINS_7IMemoryEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "InitiateSnapshot",
     "referenced_type" : "type-1917"
    },
    {
     "field_name" : "TakeSnapshot",
     "field_offset" : 64,
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "CancelSnapshot",
     "field_offset" : 128,
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "ReleaseBuffers",
     "field_offset" : 192,
     "referenced_type" : "type-1931"
    },
    {
     "field_name" : "GetMaxPicsPerBurst",
     "field_offset" : 256,
     "referenced_type" : "type-1933"
    },
    {
     "field_name" : "GetBurstFPSRange",
     "field_offset" : 320,
     "referenced_type" : "type-1935"
    },
    {
     "field_name" : "SetShutterFeedback",
     "field_offset" : 384,
     "referenced_type" : "type-1937"
    },
    {
     "field_name" : "GetShutterFeedback",
     "field_offset" : 448,
     "referenced_type" : "type-1933"
    }
   ],
   "linker_set_key" : "XASnapshotItf_",
   "name" : "XASnapshotItf_",
   "referenced_type" : "type-1916",
   "self_type" : "type-1916",
   "size" : 64,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XASnapshotItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-194"
    }
   ],
   "linker_set_key" : "android::IMemory",
   "name" : "android::IMemory",
   "record_kind" : "class",
   "referenced_type" : "type-193",
   "self_type" : "type-193",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IMemory.h",
   "unique_id" : "_ZTSN7android7IMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7IMemory22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android7IMemory9getMemoryEPlPm"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 64,
     "referenced_type" : "type-1940"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "type-1000"
    }
   ],
   "linker_set_key" : "XAMetadataInfo_",
   "name" : "XAMetadataInfo_",
   "referenced_type" : "type-1939",
   "self_type" : "type-1939",
   "size" : 28,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAMetadataInfo_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "android::IInterface",
   "name" : "android::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IInterface.h",
   "unique_id" : "_ZTSN7android10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetItemCount",
     "referenced_type" : "type-1942"
    },
    {
     "field_name" : "GetKeySize",
     "field_offset" : 64,
     "referenced_type" : "type-1948"
    },
    {
     "field_name" : "GetKey",
     "field_offset" : 128,
     "referenced_type" : "type-1950"
    },
    {
     "field_name" : "GetValueSize",
     "field_offset" : 192,
     "referenced_type" : "type-1948"
    },
    {
     "field_name" : "GetValue",
     "field_offset" : 256,
     "referenced_type" : "type-1950"
    },
    {
     "field_name" : "AddKeyFilter",
     "field_offset" : 320,
     "referenced_type" : "type-1953"
    },
    {
     "field_name" : "ClearKeyFilter",
     "field_offset" : 384,
     "referenced_type" : "type-1955"
    }
   ],
   "linker_set_key" : "XAMetadataExtractionItf_",
   "name" : "XAMetadataExtractionItf_",
   "referenced_type" : "type-1941",
   "self_type" : "type-1941",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAMetadataExtractionItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-196"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "android::wp<android::AudioRecord>",
   "name" : "android::wp<android::AudioRecord>",
   "record_kind" : "class",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-197" ],
   "unique_id" : "_ZTSN7android2wpINS_11AudioRecordEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "CreateChildNode",
     "referenced_type" : "type-1958"
    },
    {
     "field_name" : "GetSupportedKeysCount",
     "field_offset" : 64,
     "referenced_type" : "type-1964"
    },
    {
     "field_name" : "GetKeySize",
     "field_offset" : 128,
     "referenced_type" : "type-1966"
    },
    {
     "field_name" : "GetKey",
     "field_offset" : 192,
     "referenced_type" : "type-1968"
    },
    {
     "field_name" : "GetFreeKeysEncoding",
     "field_offset" : 256,
     "referenced_type" : "type-1966"
    },
    {
     "field_name" : "InsertMetadataItem",
     "field_offset" : 320,
     "referenced_type" : "type-1970"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 384,
     "referenced_type" : "type-1972"
    }
   ],
   "linker_set_key" : "XAMetadataInsertionItf_",
   "name" : "XAMetadataInsertionItf_",
   "referenced_type" : "type-1957",
   "self_type" : "type-1957",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAMetadataInsertionItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-146"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAudioRecordThread",
     "field_offset" : 128,
     "referenced_type" : "type-198"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 192,
     "referenced_type" : "type-202"
    },
    {
     "access" : "private",
     "field_name" : "mActive",
     "field_offset" : 512,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mCbf",
     "field_offset" : 576,
     "referenced_type" : "type-212"
    },
    {
     "access" : "private",
     "field_name" : "mUserData",
     "field_offset" : 640,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mNotificationFramesReq",
     "field_offset" : 704,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNotificationFramesAct",
     "field_offset" : 736,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mRefreshRemaining",
     "field_offset" : 768,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mRemainingFrames",
     "field_offset" : 800,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mRetryOnPartialBuffer",
     "field_offset" : 832,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mObservedSequence",
     "field_offset" : 864,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMarkerPosition",
     "field_offset" : 896,
     "referenced_type" : "type-214"
    },
    {
     "access" : "private",
     "field_name" : "mMarkerReached",
     "field_offset" : 928,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mNewPosition",
     "field_offset" : 960,
     "referenced_type" : "type-214"
    },
    {
     "access" : "private",
     "field_name" : "mUpdatePeriod",
     "field_offset" : 992,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 1024,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mOpPackageName",
     "field_offset" : 1088,
     "referenced_type" : "type-215"
    },
    {
     "access" : "private",
     "field_name" : "mFrameCount",
     "field_offset" : 1152,
     "referenced_type" : "type-219"
    },
    {
     "access" : "private",
     "field_name" : "mReqFrameCount",
     "field_offset" : 1216,
     "referenced_type" : "type-219"
    },
    {
     "access" : "private",
     "field_name" : "mFramesRead",
     "field_offset" : 1280,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mFramesReadServerOffset",
     "field_offset" : 1344,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mSampleRate",
     "field_offset" : 1408,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFormat",
     "field_offset" : 1440,
     "referenced_type" : "type-89"
    },
    {
     "access" : "private",
     "field_name" : "mChannelCount",
     "field_offset" : 1472,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFrameSize",
     "field_offset" : 1536,
     "referenced_type" : "type-219"
    },
    {
     "access" : "private",
     "field_name" : "mLatency",
     "field_offset" : 1600,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mChannelMask",
     "field_offset" : 1632,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 1664,
     "referenced_type" : "type-220"
    },
    {
     "access" : "private",
     "field_name" : "mOrigFlags",
     "field_offset" : 1696,
     "referenced_type" : "type-220"
    },
    {
     "access" : "private",
     "field_name" : "mSessionId",
     "field_offset" : 1728,
     "referenced_type" : "type-82"
    },
    {
     "access" : "private",
     "field_name" : "mTransfer",
     "field_offset" : 1760,
     "referenced_type" : "type-221"
    },
    {
     "access" : "private",
     "field_name" : "mAudioRecord",
     "field_offset" : 1792,
     "referenced_type" : "type-222"
    },
    {
     "access" : "private",
     "field_name" : "mCblkMemory",
     "field_offset" : 1856,
     "referenced_type" : "type-225"
    },
    {
     "access" : "private",
     "field_name" : "mCblk",
     "field_offset" : 1920,
     "referenced_type" : "type-226"
    },
    {
     "access" : "private",
     "field_name" : "mBufferMemory",
     "field_offset" : 1984,
     "referenced_type" : "type-225"
    },
    {
     "access" : "private",
     "field_name" : "mInput",
     "field_offset" : 2048,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mPreviousPriority",
     "field_offset" : 2080,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mPreviousSchedulingGroup",
     "field_offset" : 2112,
     "referenced_type" : "type-228"
    },
    {
     "access" : "private",
     "field_name" : "mAwaitBoost",
     "field_offset" : 2144,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mProxy",
     "field_offset" : 2176,
     "referenced_type" : "type-229"
    },
    {
     "access" : "private",
     "field_name" : "mInOverrun",
     "field_offset" : 2240,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mDeathNotifier",
     "field_offset" : 2304,
     "referenced_type" : "type-233"
    },
    {
     "access" : "private",
     "field_name" : "mSequence",
     "field_offset" : 2368,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mClientUid",
     "field_offset" : 2400,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mClientPid",
     "field_offset" : 2432,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mAttributes",
     "field_offset" : 2464,
     "referenced_type" : "type-238"
    },
    {
     "access" : "private",
     "field_name" : "mSelectedDeviceId",
     "field_offset" : 4640,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mRoutedDeviceId",
     "field_offset" : 4672,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mDeviceCallback",
     "field_offset" : 4736,
     "referenced_type" : "type-144"
    },
    {
     "access" : "private",
     "field_name" : "mMediaMetrics",
     "field_offset" : 4864,
     "referenced_type" : "type-240"
    }
   ],
   "linker_set_key" : "android::AudioRecord",
   "name" : "android::AudioRecord",
   "record_kind" : "class",
   "referenced_type" : "type-197",
   "self_type" : "type-197",
   "size" : 672,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioRecord.h",
   "unique_id" : "_ZTSN7android11AudioRecordE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AudioRecordE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioRecordD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioRecordD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android11AudioRecord19onAudioDeviceUpdateEii"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Vibrate",
     "referenced_type" : "type-1977"
    },
    {
     "field_name" : "IsVibrating",
     "field_offset" : 64,
     "referenced_type" : "type-1983"
    },
    {
     "field_name" : "SetFrequency",
     "field_offset" : 128,
     "referenced_type" : "type-1977"
    },
    {
     "field_name" : "GetFrequency",
     "field_offset" : 192,
     "referenced_type" : "type-1983"
    },
    {
     "field_name" : "SetIntensity",
     "field_offset" : 256,
     "referenced_type" : "type-1985"
    },
    {
     "field_name" : "GetIntensity",
     "field_offset" : 320,
     "referenced_type" : "type-1987"
    }
   ],
   "linker_set_key" : "XAVibraItf_",
   "name" : "XAVibraItf_",
   "referenced_type" : "type-1976",
   "self_type" : "type-1976",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVibraItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-199"
    }
   ],
   "linker_set_key" : "android::sp<android::AudioRecord::AudioRecordThread>",
   "name" : "android::sp<android::AudioRecord::AudioRecordThread>",
   "record_kind" : "class",
   "referenced_type" : "type-198",
   "self_type" : "type-198",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-200" ],
   "unique_id" : "_ZTSN7android2spINS_11AudioRecord17AudioRecordThreadEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hue",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "saturation",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "lightness",
     "field_offset" : 48,
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "XAHSL_",
   "name" : "XAHSL_",
   "referenced_type" : "type-1992",
   "self_type" : "type-1992",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAHSL_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ActivateLEDArray",
     "referenced_type" : "type-1994"
    },
    {
     "field_name" : "IsLEDArrayActivated",
     "field_offset" : 64,
     "referenced_type" : "type-2000"
    },
    {
     "field_name" : "SetColor",
     "field_offset" : 128,
     "referenced_type" : "type-2002"
    },
    {
     "field_name" : "GetColor",
     "field_offset" : 192,
     "referenced_type" : "type-2006"
    }
   ],
   "linker_set_key" : "XALEDArrayItf_",
   "name" : "XALEDArrayItf_",
   "referenced_type" : "type-1993",
   "self_type" : "type-1993",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XALEDArrayItf_"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-207"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReceiver",
     "field_offset" : 1088,
     "referenced_type" : "type-201"
    },
    {
     "access" : "private",
     "field_name" : "mMyLock",
     "field_offset" : 1152,
     "referenced_type" : "type-202"
    },
    {
     "access" : "private",
     "field_name" : "mMyCond",
     "field_offset" : 1472,
     "referenced_type" : "type-204"
    },
    {
     "access" : "private",
     "field_name" : "mPaused",
     "field_offset" : 1856,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mPausedInt",
     "field_offset" : 1864,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mPausedNs",
     "field_offset" : 1920,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mIgnoreNextPausedInt",
     "field_offset" : 1984,
     "referenced_type" : "type-206"
    }
   ],
   "linker_set_key" : "android::AudioRecord::AudioRecordThread",
   "name" : "android::AudioRecord::AudioRecordThread",
   "record_kind" : "class",
   "referenced_type" : "type-200",
   "self_type" : "type-200",
   "size" : 272,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioRecord.h",
   "unique_id" : "_ZTSN7android11AudioRecord17AudioRecordThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 256,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AudioRecord17AudioRecordThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioRecord17AudioRecordThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioRecord17AudioRecordThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android11AudioRecord17AudioRecordThread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "mangled_component_name" : "_ZN7android11AudioRecord17AudioRecordThread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -256,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -256,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AudioRecord17AudioRecordThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11AudioRecord17AudioRecordThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11AudioRecord17AudioRecordThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-203"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-202",
   "self_type" : "type-202",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "maxChannels",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minBitsPerSample",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxBitsPerSample",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minSampleRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxSampleRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isFreqRangeContinuous",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pSampleRatesSupported",
     "field_offset" : 192,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numSampleRatesSupported",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "minBitRate",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxBitRate",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "isBitrateRangeContinuous",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "pBitratesSupported",
     "field_offset" : 384,
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "numBitratesSupported",
     "field_offset" : 448,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 480,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "modeSetting",
     "field_offset" : 512,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAAudioCodecDescriptor_",
   "name" : "XAAudioCodecDescriptor_",
   "referenced_type" : "type-2020",
   "self_type" : "type-2020",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioCodecDescriptor_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelsIn",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelsOut",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rateControl",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMode",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "streamFormat",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "encodeOptions",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "blockAlignment",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAAudioEncoderSettings_",
   "name" : "XAAudioEncoderSettings_",
   "referenced_type" : "type-2021",
   "self_type" : "type-2021",
   "size" : 52,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioEncoderSettings_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetAudioDecoders",
     "referenced_type" : "type-2023"
    },
    {
     "field_name" : "GetAudioDecoderCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-2029"
    }
   ],
   "linker_set_key" : "XAAudioDecoderCapabilitiesItf_",
   "name" : "XAAudioDecoderCapabilitiesItf_",
   "referenced_type" : "type-2022",
   "self_type" : "type-2022",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioDecoderCapabilitiesItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-205"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-204",
   "self_type" : "type-204",
   "size" : 48,
   "source_file" : "/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetEncoderSettings",
     "referenced_type" : "type-2061"
    },
    {
     "field_name" : "GetEncoderSettings",
     "field_offset" : 64,
     "referenced_type" : "type-2061"
    }
   ],
   "linker_set_key" : "XAAudioEncoderItf_",
   "name" : "XAAudioEncoderItf_",
   "referenced_type" : "type-2060",
   "self_type" : "type-2060",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioEncoderItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-147"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 64,
     "referenced_type" : "type-208"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 192,
     "referenced_type" : "type-202"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 512,
     "referenced_type" : "type-204"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 896,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 928,
     "referenced_type" : "type-209"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 936,
     "referenced_type" : "type-209"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 960,
     "referenced_type" : "type-210"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 1024,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-207",
   "self_type" : "type-207",
   "size" : 152,
   "source_file" : "/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetAudioEncoders",
     "referenced_type" : "type-2074"
    },
    {
     "field_name" : "GetAudioEncoderCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-2080"
    }
   ],
   "linker_set_key" : "XAAudioEncoderCapabilitiesItf_",
   "name" : "XAAudioEncoderCapabilitiesItf_",
   "referenced_type" : "type-2073",
   "self_type" : "type-2073",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioEncoderCapabilitiesItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxWidth",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxHeight",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAImageCodecDescriptor_",
   "name" : "XAImageCodecDescriptor_",
   "referenced_type" : "type-2097",
   "self_type" : "type-2097",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageCodecDescriptor_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "compressionLevel",
     "field_offset" : 96,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "colorFormat",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAImageSettings_",
   "name" : "XAImageSettings_",
   "referenced_type" : "type-2098",
   "self_type" : "type-2098",
   "size" : 20,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageSettings_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetImageEncoderCapabilities",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "QueryColorFormats",
     "field_offset" : 64,
     "referenced_type" : "type-2107"
    }
   ],
   "linker_set_key" : "XAImageEncoderCapabilitiesItf_",
   "name" : "XAImageEncoderCapabilitiesItf_",
   "referenced_type" : "type-2099",
   "self_type" : "type-2099",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageEncoderCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-211"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-210",
   "self_type" : "type-210",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-207" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetImageDecoderCapabilities",
     "referenced_type" : "type-2110"
    },
    {
     "field_name" : "QueryColorFormats",
     "field_offset" : 64,
     "referenced_type" : "type-2116"
    }
   ],
   "linker_set_key" : "XAImageDecoderCapabilitiesItf_",
   "name" : "XAImageDecoderCapabilitiesItf_",
   "referenced_type" : "type-2109",
   "self_type" : "type-2109",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageDecoderCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetImageSettings",
     "referenced_type" : "type-2119"
    },
    {
     "field_name" : "GetImageSettings",
     "field_offset" : 64,
     "referenced_type" : "type-2127"
    },
    {
     "field_name" : "GetSizeEstimate",
     "field_offset" : 128,
     "referenced_type" : "type-2130"
    }
   ],
   "linker_set_key" : "XAImageEncoderItf_",
   "name" : "XAImageEncoderItf_",
   "referenced_type" : "type-2118",
   "self_type" : "type-2118",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageEncoderItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxWidth",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxHeight",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxFrameRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxBitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rateControlSupported",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAVideoCodecDescriptor_",
   "name" : "XAVideoCodecDescriptor_",
   "referenced_type" : "type-2132",
   "self_type" : "type-2132",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVideoCodecDescriptor_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encoderId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "frameRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rateControl",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "profileSetting",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "levelSetting",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "keyFrameInterval",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAVideoSettings_",
   "name" : "XAVideoSettings_",
   "referenced_type" : "type-2133",
   "self_type" : "type-2133",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVideoSettings_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetVideoDecoders",
     "referenced_type" : "type-2135"
    },
    {
     "field_name" : "GetVideoDecoderCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-2141"
    }
   ],
   "linker_set_key" : "XAVideoDecoderCapabilitiesItf_",
   "name" : "XAVideoDecoderCapabilitiesItf_",
   "referenced_type" : "type-2134",
   "self_type" : "type-2134",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVideoDecoderCapabilitiesItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mValue",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::Modulo<unsigned int>",
   "name" : "android::Modulo<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-214",
   "self_type" : "type-214",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libmedia/include/media/Modulo.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android6ModuloIjEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetSource",
     "referenced_type" : "type-2145"
    }
   ],
   "linker_set_key" : "XADynamicSourceItf_",
   "name" : "XADynamicSourceItf_",
   "referenced_type" : "type-2144",
   "self_type" : "type-2144",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XADynamicSourceItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-216"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-215",
   "self_type" : "type-215",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetVideoEncoders",
     "referenced_type" : "type-2155"
    },
    {
     "field_name" : "GetVideoEncoderCapabilities",
     "field_offset" : 64,
     "referenced_type" : "type-2161"
    }
   ],
   "linker_set_key" : "XAVideoEncoderCapabilitiesItf_",
   "name" : "XAVideoEncoderCapabilitiesItf_",
   "referenced_type" : "type-2154",
   "self_type" : "type-2154",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVideoEncoderCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetVideoSettings",
     "referenced_type" : "type-2164"
    },
    {
     "field_name" : "GetVideoSettings",
     "field_offset" : 64,
     "referenced_type" : "type-2164"
    }
   ],
   "linker_set_key" : "XAVideoEncoderItf_",
   "name" : "XAVideoEncoderItf_",
   "referenced_type" : "type-2163",
   "self_type" : "type-2163",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVideoEncoderItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetMode",
     "referenced_type" : "type-2172"
    },
    {
     "field_name" : "GetChildCount",
     "field_offset" : 64,
     "referenced_type" : "type-2178"
    },
    {
     "field_name" : "GetChildMIMETypeSize",
     "field_offset" : 128,
     "referenced_type" : "type-2180"
    },
    {
     "field_name" : "GetChildInfo",
     "field_offset" : 192,
     "referenced_type" : "type-2182"
    },
    {
     "field_name" : "SetActiveNode",
     "field_offset" : 256,
     "referenced_type" : "type-2172"
    }
   ],
   "linker_set_key" : "SLMetadataTraversalItf_",
   "name" : "SLMetadataTraversalItf_",
   "referenced_type" : "type-2171",
   "self_type" : "type-2171",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLMetadataTraversalItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "containerType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "mediaDuration",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numStreams",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAMediaContainerInformation_",
   "name" : "XAMediaContainerInformation_",
   "referenced_type" : "type-2184",
   "self_type" : "type-2184",
   "size" : 12,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAMediaContainerInformation_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "frameRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "duration",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAVideoStreamInformation_",
   "name" : "XAVideoStreamInformation_",
   "referenced_type" : "type-2185",
   "self_type" : "type-2185",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVideoStreamInformation_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channels",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitRate",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 128,
     "referenced_type" : "type-999"
    },
    {
     "field_name" : "duration",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAAudioStreamInformation_",
   "name" : "XAAudioStreamInformation_",
   "referenced_type" : "type-2186",
   "self_type" : "type-2186",
   "size" : 36,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAAudioStreamInformation_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "codecId",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "presentationDuration",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAImageStreamInformation_",
   "name" : "XAImageStreamInformation_",
   "referenced_type" : "type-2187",
   "self_type" : "type-2187",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAImageStreamInformation_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "layer",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "width",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "height",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tx",
     "field_offset" : 96,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "ty",
     "field_offset" : 112,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "bitrate",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 160,
     "referenced_type" : "type-999"
    },
    {
     "field_name" : "duration",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XATimedTextStreamInformation_",
   "name" : "XATimedTextStreamInformation_",
   "referenced_type" : "type-2188",
   "self_type" : "type-2188",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XATimedTextStreamInformation_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "channels",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tracks",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bankType",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "langCountry",
     "field_offset" : 96,
     "referenced_type" : "type-999"
    },
    {
     "field_name" : "duration",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAMIDIStreamInformation_",
   "name" : "XAMIDIStreamInformation_",
   "referenced_type" : "type-2189",
   "self_type" : "type-2189",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAMIDIStreamInformation_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "VendorStreamInfo",
     "referenced_type" : "type-34"
    }
   ],
   "linker_set_key" : "XAVendorStreamInformation_",
   "name" : "XAVendorStreamInformation_",
   "referenced_type" : "type-2190",
   "self_type" : "type-2190",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAVendorStreamInformation_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "QueryMediaContainerInformation",
     "referenced_type" : "type-2192"
    },
    {
     "field_name" : "QueryStreamType",
     "field_offset" : 64,
     "referenced_type" : "type-2199"
    },
    {
     "field_name" : "QueryStreamInformation",
     "field_offset" : 128,
     "referenced_type" : "type-2201"
    },
    {
     "field_name" : "QueryStreamName",
     "field_offset" : 192,
     "referenced_type" : "type-2203"
    },
    {
     "field_name" : "RegisterStreamChangeCallback",
     "field_offset" : 256,
     "referenced_type" : "type-2205"
    },
    {
     "field_name" : "QueryActiveStreams",
     "field_offset" : 320,
     "referenced_type" : "type-2209"
    },
    {
     "field_name" : "SetActiveStream",
     "field_offset" : 384,
     "referenced_type" : "type-2211"
    }
   ],
   "linker_set_key" : "XAStreamInformationItf_",
   "name" : "XAStreamInformationItf_",
   "referenced_type" : "type-2191",
   "self_type" : "type-2191",
   "size" : 56,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XAStreamInformationItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "formatType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numChannels",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sampleRate",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "bitsPerSample",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "containerSize",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "channelMask",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "endianness",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "representation",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLAndroidDataFormat_PCM_EX_",
   "name" : "SLAndroidDataFormat_PCM_EX_",
   "referenced_type" : "type-2213",
   "self_type" : "type-2213",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidDataFormat_PCM_EX_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "CreateEffect",
     "referenced_type" : "type-2215"
    },
    {
     "field_name" : "ReleaseEffect",
     "field_offset" : 64,
     "referenced_type" : "type-2215"
    },
    {
     "field_name" : "SetEnabled",
     "field_offset" : 128,
     "referenced_type" : "type-2221"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 192,
     "referenced_type" : "type-2223"
    },
    {
     "field_name" : "SendCommand",
     "field_offset" : 256,
     "referenced_type" : "type-2225"
    }
   ],
   "linker_set_key" : "SLAndroidEffectItf_",
   "name" : "SLAndroidEffectItf_",
   "referenced_type" : "type-2214",
   "self_type" : "type-2214",
   "size" : 40,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidEffectItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-223"
    }
   ],
   "linker_set_key" : "android::sp<android::media::IAudioRecord>",
   "name" : "android::sp<android::media::IAudioRecord>",
   "record_kind" : "class",
   "referenced_type" : "type-222",
   "self_type" : "type-222",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-224" ],
   "unique_id" : "_ZTSN7android2spINS_5media12IAudioRecordEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "EnableEffectSend",
     "referenced_type" : "type-2228"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-2234"
    },
    {
     "field_name" : "SetDirectLevel",
     "field_offset" : 128,
     "referenced_type" : "type-2236"
    },
    {
     "field_name" : "GetDirectLevel",
     "field_offset" : 192,
     "referenced_type" : "type-2238"
    },
    {
     "field_name" : "SetSendLevel",
     "field_offset" : 256,
     "referenced_type" : "type-2240"
    },
    {
     "field_name" : "GetSendLevel",
     "field_offset" : 320,
     "referenced_type" : "type-2242"
    }
   ],
   "linker_set_key" : "SLAndroidEffectSendItf_",
   "name" : "SLAndroidEffectSendItf_",
   "referenced_type" : "type-2227",
   "self_type" : "type-2227",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidEffectSendItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-194"
    }
   ],
   "linker_set_key" : "android::media::IAudioRecord",
   "name" : "android::media::IAudioRecord",
   "record_kind" : "class",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 24,
   "source_file" : "/out/soong/.intermediates/frameworks/av/media/libaudioclient/libaudioclient/android_arm64_armv8-a_core_shared_platform/gen/aidl/android/media/IAudioRecord.h",
   "unique_id" : "_ZTSN7android5media12IAudioRecordE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android5media12IAudioRecordE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android5media12IAudioRecordD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android5media12IAudioRecordD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android5media12IAudioRecord22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media12IAudioRecord5startEii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media12IAudioRecord4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android5media12IAudioRecord20getActiveMicrophonesEPNSt3__16vectorINS0_14MicrophoneInfoENS2_9allocatorIS4_EEEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android5media12IAudioRecordE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android5media12IAudioRecordD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android5media12IAudioRecordD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "QueryNumEffects",
     "referenced_type" : "type-2245"
    },
    {
     "field_name" : "QueryEffect",
     "field_offset" : 64,
     "referenced_type" : "type-2251"
    }
   ],
   "linker_set_key" : "SLAndroidEffectCapabilitiesItf_",
   "name" : "SLAndroidEffectCapabilitiesItf_",
   "referenced_type" : "type-2244",
   "self_type" : "type-2244",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidEffectCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-192"
    }
   ],
   "linker_set_key" : "android::sp<android::IMemory>",
   "name" : "android::sp<android::IMemory>",
   "record_kind" : "class",
   "referenced_type" : "type-225",
   "self_type" : "type-225",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-193" ],
   "unique_id" : "_ZTSN7android2spINS_7IMemoryEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceType",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "deviceID",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "device",
     "field_offset" : 128,
     "referenced_type" : "type-454"
    }
   ],
   "linker_set_key" : "SLDataLocator_IODevice_",
   "name" : "SLDataLocator_IODevice_",
   "referenced_type" : "type-2253",
   "self_type" : "type-2253",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLDataLocator_IODevice_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-129"
    },
    {
     "field_name" : "maxWidth",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "maxHeight",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "featuresSupported",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "exposureModesSupported",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "flashModesSupported",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "focusModesSupported",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "meteringModesSupported",
     "field_offset" : 288,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "whiteBalanceModesSupported",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XACameraDescriptor_",
   "name" : "XACameraDescriptor_",
   "referenced_type" : "type-2254",
   "self_type" : "type-2254",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XACameraDescriptor_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetConfiguration",
     "referenced_type" : "type-2256"
    },
    {
     "field_name" : "GetConfiguration",
     "field_offset" : 64,
     "referenced_type" : "type-2262"
    },
    {
     "field_name" : "AcquireJavaProxy",
     "field_offset" : 128,
     "referenced_type" : "type-2264"
    },
    {
     "field_name" : "ReleaseJavaProxy",
     "field_offset" : 192,
     "referenced_type" : "type-2269"
    }
   ],
   "linker_set_key" : "SLAndroidConfigurationItf_",
   "name" : "SLAndroidConfigurationItf_",
   "referenced_type" : "type-2255",
   "self_type" : "type-2255",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidConfigurationItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetCameraCapabilities",
     "referenced_type" : "type-2272"
    },
    {
     "field_name" : "QueryFocusRegionPatterns",
     "field_offset" : 64,
     "referenced_type" : "type-2279"
    },
    {
     "field_name" : "GetSupportedAutoLocks",
     "field_offset" : 128,
     "referenced_type" : "type-2281"
    },
    {
     "field_name" : "GetSupportedFocusManualSettings",
     "field_offset" : 192,
     "referenced_type" : "type-2284"
    },
    {
     "field_name" : "GetSupportedISOSensitivitySettings",
     "field_offset" : 256,
     "referenced_type" : "type-2287"
    },
    {
     "field_name" : "GetSupportedApertureManualSettings",
     "field_offset" : 320,
     "referenced_type" : "type-2287"
    },
    {
     "field_name" : "GetSupportedShutterSpeedManualSettings",
     "field_offset" : 384,
     "referenced_type" : "type-2287"
    },
    {
     "field_name" : "GetSupportedWhiteBalanceManualSettings",
     "field_offset" : 448,
     "referenced_type" : "type-2287"
    },
    {
     "field_name" : "GetSupportedZoomSettings",
     "field_offset" : 512,
     "referenced_type" : "type-2289"
    }
   ],
   "linker_set_key" : "XACameraCapabilitiesItf_",
   "name" : "XACameraCapabilitiesItf_",
   "referenced_type" : "type-2271",
   "self_type" : "type-2271",
   "size" : 72,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL.h",
   "unique_id" : "XACameraCapabilitiesItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-230"
    }
   ],
   "linker_set_key" : "android::sp<android::AudioRecordClientProxy>",
   "name" : "android::sp<android::AudioRecordClientProxy>",
   "record_kind" : "class",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-232" ],
   "unique_id" : "_ZTSN7android2spINS_22AudioRecordClientProxyEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLAndroidSimpleBufferQueueState_",
   "name" : "SLAndroidSimpleBufferQueueState_",
   "referenced_type" : "type-2291",
   "self_type" : "type-2291",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidSimpleBufferQueueState_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "Enqueue",
     "referenced_type" : "type-2293"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 64,
     "referenced_type" : "type-2299"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 128,
     "referenced_type" : "type-2301"
    },
    {
     "field_name" : "RegisterCallback",
     "field_offset" : 192,
     "referenced_type" : "type-2304"
    }
   ],
   "linker_set_key" : "SLAndroidSimpleBufferQueueItf_",
   "name" : "SLAndroidSimpleBufferQueueItf_",
   "referenced_type" : "type-2292",
   "self_type" : "type-2292",
   "size" : 32,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidSimpleBufferQueueItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "itemKey",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "itemSize",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "itemData",
     "field_offset" : 64,
     "referenced_type" : "type-2309"
    }
   ],
   "linker_set_key" : "SLAndroidBufferItem_",
   "name" : "SLAndroidBufferItem_",
   "referenced_type" : "type-2308",
   "self_type" : "type-2308",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidBufferItem_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLAndroidBufferQueueState_",
   "name" : "SLAndroidBufferQueueState_",
   "referenced_type" : "type-2310",
   "self_type" : "type-2310",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidBufferQueueState_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "RegisterCallback",
     "referenced_type" : "type-2312"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 64,
     "referenced_type" : "type-2322"
    },
    {
     "field_name" : "Enqueue",
     "field_offset" : 128,
     "referenced_type" : "type-2324"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 192,
     "referenced_type" : "type-2326"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 256,
     "referenced_type" : "type-2329"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 320,
     "referenced_type" : "type-2331"
    }
   ],
   "linker_set_key" : "SLAndroidBufferQueueItf_",
   "name" : "SLAndroidBufferQueueItf_",
   "referenced_type" : "type-2311",
   "self_type" : "type-2311",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidBufferQueueItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-234"
    }
   ],
   "linker_set_key" : "android::sp<android::AudioRecord::DeathNotifier>",
   "name" : "android::sp<android::AudioRecord::DeathNotifier>",
   "record_kind" : "class",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-235" ],
   "unique_id" : "_ZTSN7android2spINS_11AudioRecord13DeathNotifierEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fd",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2334"
    },
    {
     "field_name" : "length",
     "field_offset" : 128,
     "referenced_type" : "type-2334"
    }
   ],
   "linker_set_key" : "SLDataLocator_AndroidFD_",
   "name" : "SLDataLocator_AndroidFD_",
   "referenced_type" : "type-2333",
   "self_type" : "type-2333",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLDataLocator_AndroidFD_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetSource",
     "referenced_type" : "type-2336"
    }
   ],
   "linker_set_key" : "SLDynamicSourceItf_",
   "name" : "SLDynamicSourceItf_",
   "referenced_type" : "type-2335",
   "self_type" : "type-2335",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLDynamicSourceItf_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLDataLocator_AndroidSimpleBufferQueue",
   "name" : "SLDataLocator_AndroidSimpleBufferQueue",
   "referenced_type" : "type-2342",
   "self_type" : "type-2342",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLDataLocator_AndroidSimpleBufferQueue"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "SLDataLocator_AndroidBufferQueue_",
   "name" : "SLDataLocator_AndroidBufferQueue_",
   "referenced_type" : "type-2343",
   "self_type" : "type-2343",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLDataLocator_AndroidBufferQueue_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "type-2345"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-2351"
    }
   ],
   "linker_set_key" : "SLAndroidAcousticEchoCancellationItf_",
   "name" : "SLAndroidAcousticEchoCancellationItf_",
   "referenced_type" : "type-2344",
   "self_type" : "type-2344",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidAcousticEchoCancellationItf_"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-237"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAudioRecord",
     "field_offset" : 64,
     "referenced_type" : "type-236"
    }
   ],
   "linker_set_key" : "android::AudioRecord::DeathNotifier",
   "name" : "android::AudioRecord::DeathNotifier",
   "record_kind" : "class",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 40,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioRecord.h",
   "unique_id" : "_ZTSN7android11AudioRecord13DeathNotifierE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AudioRecord13DeathNotifierE"
    },
    {
     "mangled_component_name" : "_ZN7android11AudioRecord13DeathNotifier10binderDiedERKNS_2wpINS_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioRecord13DeathNotifierD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11AudioRecord13DeathNotifierD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11AudioRecord13DeathNotifierE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11AudioRecord13DeathNotifierD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11AudioRecord13DeathNotifierD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "type-2354"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-2360"
    }
   ],
   "linker_set_key" : "SLAndroidAutomaticGainControlItf_",
   "name" : "SLAndroidAutomaticGainControlItf_",
   "referenced_type" : "type-2353",
   "self_type" : "type-2353",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidAutomaticGainControlItf_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetEnabled",
     "referenced_type" : "type-2363"
    },
    {
     "field_name" : "IsEnabled",
     "field_offset" : 64,
     "referenced_type" : "type-2369"
    }
   ],
   "linker_set_key" : "SLAndroidNoiseSuppressionItf_",
   "name" : "SLAndroidNoiseSuppressionItf_",
   "referenced_type" : "type-2362",
   "self_type" : "type-2362",
   "size" : 16,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES_Android.h",
   "unique_id" : "SLAndroidNoiseSuppressionItf_"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-147"
    }
   ],
   "linker_set_key" : "android::IBinder::DeathRecipient",
   "name" : "android::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 24,
   "source_file" : "/frameworks/native/libs/binder/include/binder/IBinder.h",
   "unique_id" : "_ZTSN7android7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipient10binderDiedERKNS_2wpIS0_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "itemKey",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "itemSize",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "itemData",
     "field_offset" : 64,
     "referenced_type" : "type-2309"
    }
   ],
   "linker_set_key" : "XAAndroidBufferItem_",
   "name" : "XAAndroidBufferItem_",
   "referenced_type" : "type-2371",
   "self_type" : "type-2371",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h",
   "unique_id" : "XAAndroidBufferItem_"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XAAndroidBufferQueueState_",
   "name" : "XAAndroidBufferQueueState_",
   "referenced_type" : "type-2372",
   "self_type" : "type-2372",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h",
   "unique_id" : "XAAndroidBufferQueueState_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "RegisterCallback",
     "referenced_type" : "type-2374"
    },
    {
     "field_name" : "Clear",
     "field_offset" : 64,
     "referenced_type" : "type-2384"
    },
    {
     "field_name" : "Enqueue",
     "field_offset" : 128,
     "referenced_type" : "type-2386"
    },
    {
     "field_name" : "GetState",
     "field_offset" : 192,
     "referenced_type" : "type-2388"
    },
    {
     "field_name" : "SetCallbackEventsMask",
     "field_offset" : 256,
     "referenced_type" : "type-2391"
    },
    {
     "field_name" : "GetCallbackEventsMask",
     "field_offset" : 320,
     "referenced_type" : "type-2393"
    }
   ],
   "linker_set_key" : "XAAndroidBufferQueueItf_",
   "name" : "XAAndroidBufferQueueItf_",
   "referenced_type" : "type-2373",
   "self_type" : "type-2373",
   "size" : 48,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h",
   "unique_id" : "XAAndroidBufferQueueItf_"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "content_type",
     "referenced_type" : "type-109"
    },
    {
     "field_name" : "usage",
     "field_offset" : 32,
     "referenced_type" : "type-108"
    },
    {
     "field_name" : "source",
     "field_offset" : 64,
     "referenced_type" : "type-100"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tags",
     "field_offset" : 128,
     "referenced_type" : "type-239"
    }
   ],
   "linker_set_key" : "audio_attributes_t",
   "name" : "audio_attributes_t",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 272,
   "source_file" : "/system/media/audio/include/system/audio.h",
   "unique_id" : "audio_attributes_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "numBuffers",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "XADataLocator_AndroidBufferQueue_",
   "name" : "XADataLocator_AndroidBufferQueue_",
   "referenced_type" : "type-2395",
   "self_type" : "type-2395",
   "size" : 8,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h",
   "unique_id" : "XADataLocator_AndroidBufferQueue_"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "locatorType",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fd",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2334"
    },
    {
     "field_name" : "length",
     "field_offset" : 128,
     "referenced_type" : "type-2334"
    }
   ],
   "linker_set_key" : "XADataLocator_AndroidFD_",
   "name" : "XADataLocator_AndroidFD_",
   "referenced_type" : "type-2396",
   "self_type" : "type-2396",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/OMXAL/OpenMAXAL_Android.h",
   "unique_id" : "XADataLocator_AndroidFD_"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-2399",
   "self_type" : "type-2399",
   "size" : 8,
   "source_file" : "/system/core/liblog/include/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAnalyticsItem",
     "referenced_type" : "type-241"
    },
    {
     "access" : "private",
     "field_name" : "mCreatedNs",
     "field_offset" : 64,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mStartedNs",
     "field_offset" : 128,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mDurationNs",
     "field_offset" : 192,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 256,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mLastError",
     "field_offset" : 288,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mLastErrorFunc",
     "field_offset" : 320,
     "referenced_type" : "type-242"
    }
   ],
   "linker_set_key" : "android::AudioRecord::MediaMetrics",
   "name" : "android::AudioRecord::MediaMetrics",
   "record_kind" : "class",
   "referenced_type" : "type-240",
   "self_type" : "type-240",
   "size" : 64,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioRecord.h",
   "unique_id" : "_ZTSN7android11AudioRecord12MediaMetricsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-2407",
   "self_type" : "type-2407",
   "size" : 20,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-2408",
   "self_type" : "type-2408",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-2409",
   "self_type" : "type-2409",
   "size" : 24,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-2410",
   "self_type" : "type-2410",
   "size" : 28,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-2412"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-2411",
   "self_type" : "type-2411",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-2413"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-2410"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-2410"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-2409"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-2408"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-2407"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3) at system/core/liblog/include/log/log_read.h:143:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3) at system/core/liblog/include/log/log_read.h:143:3",
   "record_kind" : "union",
   "referenced_type" : "type-2412",
   "self_type" : "type-2412",
   "size" : 5124,
   "source_file" : "/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include/log/log_read.h:143:3)"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "GetDestinationOutputDeviceIDs",
     "referenced_type" : "type-2417"
    },
    {
     "field_name" : "RegisterDeviceChangeCallback",
     "field_offset" : 64,
     "referenced_type" : "type-2423"
    },
    {
     "field_name" : "ReRoute",
     "field_offset" : 128,
     "referenced_type" : "type-2427"
    }
   ],
   "linker_set_key" : "SLOutputMixItf_",
   "name" : "SLOutputMixItf_",
   "referenced_type" : "type-2416",
   "self_type" : "type-2416",
   "size" : 24,
   "source_file" : "/frameworks/wilhelm/include/SLES/OpenSLES.h",
   "unique_id" : "SLOutputMixItf_"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::AudioMixMatchCriterion>",
   "name" : "android::trait_trivial_ctor<android::AudioMixMatchCriterion>",
   "referenced_type" : "type-2432",
   "self_type" : "type-2432",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_22AudioMixMatchCriterionEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::Vector<float> >",
   "name" : "android::trait_trivial_ctor<android::Vector<float> >",
   "referenced_type" : "type-2433",
   "self_type" : "type-2433",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2434" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_6VectorIfEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-328"
    }
   ],
   "linker_set_key" : "android::Vector<float>",
   "name" : "android::Vector<float>",
   "record_kind" : "class",
   "referenced_type" : "type-2434",
   "self_type" : "type-2434",
   "size" : 40,
   "source_file" : "/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android6VectorIfEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIfEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIfED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIfED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIfE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIfE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIfE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIfE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIfE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIfE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "referenced_type" : "type-2435",
   "self_type" : "type-2435",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-708" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::sp<android::AudioIoDescriptor> >",
   "name" : "android::trait_trivial_ctor<android::sp<android::AudioIoDescriptor> >",
   "referenced_type" : "type-2436",
   "self_type" : "type-2436",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2spINS_17AudioIoDescriptorEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "name" : "android::trait_trivial_ctor<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "referenced_type" : "type-2437",
   "self_type" : "type-2437",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "referenced_type" : "type-2438",
   "self_type" : "type-2438",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tIiNS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "name" : "android::trait_trivial_ctor<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "referenced_type" : "type-2439",
   "self_type" : "type-2439",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-245"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "android::wp<android::AudioTrack>",
   "name" : "android::wp<android::AudioTrack>",
   "record_kind" : "class",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 16,
   "source_file" : "/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-246" ],
   "unique_id" : "_ZTSN7android2wpINS_10AudioTrackEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::sp<android::AudioSystem::AudioPortCallback> >",
   "name" : "android::trait_trivial_ctor<android::sp<android::AudioSystem::AudioPortCallback> >",
   "referenced_type" : "type-2440",
   "self_type" : "type-2440",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<unsigned int, unsigned int> >",
   "referenced_type" : "type-2441",
   "self_type" : "type-2441",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorINS_16key_value_pair_tIjjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::AudioMixMatchCriterion>",
   "name" : "android::trait_trivial_dtor<android::AudioMixMatchCriterion>",
   "referenced_type" : "type-2442",
   "self_type" : "type-2442",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_22AudioMixMatchCriterionEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::Vector<float> >",
   "name" : "android::trait_trivial_dtor<android::Vector<float> >",
   "referenced_type" : "type-2443",
   "self_type" : "type-2443",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2434" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_6VectorIfEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::sp<android::AudioIoDescriptor> >",
   "name" : "android::trait_trivial_dtor<android::sp<android::AudioIoDescriptor> >",
   "referenced_type" : "type-2444",
   "self_type" : "type-2444",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2spINS_17AudioIoDescriptorEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "referenced_type" : "type-2445",
   "self_type" : "type-2445",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-708" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "name" : "android::trait_trivial_dtor<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "referenced_type" : "type-2446",
   "self_type" : "type-2446",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "name" : "android::trait_trivial_dtor<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "referenced_type" : "type-2447",
   "self_type" : "type-2447",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "referenced_type" : "type-2448",
   "self_type" : "type-2448",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tIiNS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::sp<android::AudioSystem::AudioPortCallback> >",
   "name" : "android::trait_trivial_dtor<android::sp<android::AudioSystem::AudioPortCallback> >",
   "referenced_type" : "type-2449",
   "self_type" : "type-2449",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<unsigned int, unsigned int> >",
   "referenced_type" : "type-2450",
   "self_type" : "type-2450",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorINS_16key_value_pair_tIjjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::AudioMixMatchCriterion>",
   "name" : "android::trait_trivial_copy<android::AudioMixMatchCriterion>",
   "referenced_type" : "type-2451",
   "self_type" : "type-2451",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_22AudioMixMatchCriterionEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::Vector<float> >",
   "name" : "android::trait_trivial_copy<android::Vector<float> >",
   "referenced_type" : "type-2452",
   "self_type" : "type-2452",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2434" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_6VectorIfEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::sp<android::AudioIoDescriptor> >",
   "name" : "android::trait_trivial_copy<android::sp<android::AudioIoDescriptor> >",
   "referenced_type" : "type-2453",
   "self_type" : "type-2453",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2spINS_17AudioIoDescriptorEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "referenced_type" : "type-2454",
   "self_type" : "type-2454",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-708" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "name" : "android::trait_trivial_copy<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "referenced_type" : "type-2455",
   "self_type" : "type-2455",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "name" : "android::trait_trivial_copy<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "referenced_type" : "type-2456",
   "self_type" : "type-2456",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "referenced_type" : "type-2457",
   "self_type" : "type-2457",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tIiNS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::sp<android::AudioSystem::AudioPortCallback> >",
   "name" : "android::trait_trivial_copy<android::sp<android::AudioSystem::AudioPortCallback> >",
   "referenced_type" : "type-2458",
   "self_type" : "type-2458",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<unsigned int, unsigned int> >",
   "referenced_type" : "type-2459",
   "self_type" : "type-2459",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyINS_16key_value_pair_tIjjEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-146"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mAudioTrack",
     "field_offset" : 128,
     "referenced_type" : "type-247"
    },
    {
     "access" : "protected",
     "field_name" : "mCblkMemory",
     "field_offset" : 192,
     "referenced_type" : "type-225"
    },
    {
     "access" : "protected",
     "field_name" : "mCblk",
     "field_offset" : 256,
     "referenced_type" : "type-226"
    },
    {
     "access" : "protected",
     "field_name" : "mOutput",
     "field_offset" : 320,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mAudioTrackThread",
     "field_offset" : 384,
     "referenced_type" : "type-250"
    },
    {
     "access" : "protected",
     "field_name" : "mThreadCanCallJava",
     "field_offset" : 448,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mVolume",
     "field_offset" : 480,
     "referenced_type" : "type-254"
    },
    {
     "access" : "protected",
     "field_name" : "mSendLevel",
     "field_offset" : 544,
     "referenced_type" : "type-110"
    },
    {
     "access" : "protected",
     "field_name" : "mSampleRate",
     "field_offset" : 576,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mOriginalSampleRate",
     "field_offset" : 608,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mPlaybackRate",
     "field_offset" : 640,
     "referenced_type" : "type-255"
    },
    {
     "access" : "protected",
     "field_name" : "mMaxRequiredSpeed",
     "field_offset" : 768,
     "referenced_type" : "type-110"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameCount",
     "field_offset" : 832,
     "referenced_type" : "type-219"
    },
    {
     "access" : "protected",
     "field_name" : "mReqFrameCount",
     "field_offset" : 896,
     "referenced_type" : "type-219"
    },
    {
     "access" : "protected",
     "field_name" : "mAfLatency",
     "field_offset" : 960,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mAfFrameCount",
     "field_offset" : 1024,
     "referenced_type" : "type-219"
    },
    {
     "access" : "protected",
     "field_name" : "mAfSampleRate",
     "field_offset" : 1088,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mFormat",
     "field_offset" : 1120,
     "referenced_type" : "type-89"
    },
    {
     "access" : "protected",
     "field_name" : "mStreamType",
     "field_offset" : 1152,
     "referenced_type" : "type-99"
    },
    {
     "access" : "protected",
     "field_name" : "mChannelCount",
     "field_offset" : 1184,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mChannelMask",
     "field_offset" : 1216,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mSharedBuffer",
     "field_offset" : 1280,
     "referenced_type" : "type-225"
    },
    {
     "access" : "protected",
     "field_name" : "mTransfer",
     "field_offset" : 1344,
     "referenced_type" : "type-256"
    },
    {
     "access" : "protected",
     "field_name" : "mOffloadInfoCopy",
     "field_offset" : 1408,
     "referenced_type" : "type-257"
    },
    {
     "access" : "protected",
     "field_name" : "mOffloadInfo",
     "field_offset" : 1792,
     "referenced_type" : "type-258"
    },
    {
     "access" : "protected",
     "field_name" : "mAttributes",
     "field_offset" : 1856,
     "referenced_type" : "type-238"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameSize",
     "field_offset" : 4032,
     "referenced_type" : "type-219"
    },
    {
     "access" : "protected",
     "field_name" : "mStatus",
     "field_offset" : 4096,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mLatency",
     "field_offset" : 4128,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mState",
     "field_offset" : 4160,
     "referenced_type" : "type-260"
    },
    {
     "access" : "protected",
     "field_name" : "mCbf",
     "field_offset" : 4224,
     "referenced_type" : "type-212"
    },
    {
     "access" : "protected",
     "field_name" : "mUserData",
     "field_offset" : 4288,
     "referenced_type" : "type-34"
    },
    {
     "access" : "protected",
     "field_name" : "mNotificationFramesReq",
     "field_offset" : 4352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mNotificationsPerBufferReq",
     "field_offset" : 4384,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mNotificationFramesAct",
     "field_offset" : 4416,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mRefreshRemaining",
     "field_offset" : 4448,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopCount",
     "field_offset" : 4480,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopStart",
     "field_offset" : 4512,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopEnd",
     "field_offset" : 4544,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mLoopCountNotified",
     "field_offset" : 4576,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mRemainingFrames",
     "field_offset" : 4608,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mRetryOnPartialBuffer",
     "field_offset" : 4640,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mObservedSequence",
     "field_offset" : 4672,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mMarkerPosition",
     "field_offset" : 4704,
     "referenced_type" : "type-214"
    },
    {
     "access" : "protected",
     "field_name" : "mMarkerReached",
     "field_offset" : 4736,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mNewPosition",
     "field_offset" : 4768,
     "referenced_type" : "type-214"
    },
    {
     "access" : "protected",
     "field_name" : "mUpdatePeriod",
     "field_offset" : 4800,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mServer",
     "field_offset" : 4832,
     "referenced_type" : "type-214"
    },
    {
     "access" : "protected",
     "field_name" : "mPosition",
     "field_offset" : 4864,
     "referenced_type" : "type-214"
    },
    {
     "access" : "protected",
     "field_name" : "mReleased",
     "field_offset" : 4896,
     "referenced_type" : "type-214"
    },
    {
     "access" : "protected",
     "field_name" : "mStartFromZeroUs",
     "field_offset" : 4928,
     "referenced_type" : "type-106"
    },
    {
     "access" : "protected",
     "field_name" : "mStartNs",
     "field_offset" : 4992,
     "referenced_type" : "type-106"
    },
    {
     "access" : "protected",
     "field_name" : "mStartEts",
     "field_offset" : 5056,
     "referenced_type" : "type-261"
    },
    {
     "access" : "protected",
     "field_name" : "mStartTs",
     "field_offset" : 5888,
     "referenced_type" : "type-264"
    },
    {
     "access" : "protected",
     "field_name" : "mPreviousTimestampValid",
     "field_offset" : 6080,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mTimestampStartupGlitchReported",
     "field_offset" : 6088,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mRetrogradeMotionReported",
     "field_offset" : 6096,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mPreviousTimestamp",
     "field_offset" : 6144,
     "referenced_type" : "type-264"
    },
    {
     "access" : "protected",
     "field_name" : "mPreviousLocation",
     "field_offset" : 6336,
     "referenced_type" : "type-266"
    },
    {
     "access" : "protected",
     "field_name" : "mUnderrunCountOffset",
     "field_offset" : 6368,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mFramesWritten",
     "field_offset" : 6400,
     "referenced_type" : "type-106"
    },
    {
     "access" : "protected",
     "field_name" : "mFramesWrittenServerOffset",
     "field_offset" : 6464,
     "referenced_type" : "type-106"
    },
    {
     "access" : "protected",
     "field_name" : "mFramesWrittenAtRestore",
     "field_offset" : 6528,
     "referenced_type" : "type-106"
    },
    {
     "access" : "protected",
     "field_name" : "mFlags",
     "field_offset" : 6592,
     "referenced_type" : "type-267"
    },
    {
     "access" : "protected",
     "field_name" : "mOrigFlags",
     "field_offset" : 6624,
     "referenced_type" : "type-267"
    },
    {
     "access" : "protected",
     "field_name" : "mDoNotReconnect",
     "field_offset" : 6656,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mSessionId",
     "field_offset" : 6688,
     "referenced_type" : "type-82"
    },
    {
     "access" : "protected",
     "field_name" : "mAuxEffectId",
     "field_offset" : 6720,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mLock",
     "field_offset" : 6752,
     "referenced_type" : "type-202"
    },
    {
     "access" : "protected",
     "field_name" : "mPreviousPriority",
     "field_offset" : 7072,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mPreviousSchedulingGroup",
     "field_offset" : 7104,
     "referenced_type" : "type-228"
    },
    {
     "access" : "protected",
     "field_name" : "mAwaitBoost",
     "field_offset" : 7136,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mStaticProxy",
     "field_offset" : 7168,
     "referenced_type" : "type-268"
    },
    {
     "access" : "protected",
     "field_name" : "mProxy",
     "field_offset" : 7232,
     "referenced_type" : "type-272"
    },
    {
     "access" : "protected",
     "field_name" : "mInUnderrun",
     "field_offset" : 7296,
     "referenced_type" : "type-206"
    },
    {
     "access" : "protected",
     "field_name" : "mPausedPosition",
     "field_offset" : 7328,
     "referenced_type" : "type-2"
    },
    {
     "access" : "protected",
     "field_name" : "mSelectedDeviceId",
     "field_offset" : 7360,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mRoutedDeviceId",
     "field_offset" : 7392,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "mVolumeHandler",
     "field_offset" : 7424,
     "referenced_type" : "type-276"
    },
    {
     "access" : "private",
     "field_name" : "mDeathNotifier",
     "field_offset" : 7488,
     "referenced_type" : "type-280"
    },
    {
     "access" : "private",
     "field_name" : "mSequence",
     "field_offset" : 7552,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mClientUid",
     "field_offset" : 7584,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mClientPid",
     "field_offset" : 7616,
     "referenced_type" : "type-41"
    },
    {
     "access" : "private",
     "field_name" : "mDeviceCallback",
     "field_offset" : 7680,
     "referenced_type" : "type-144"
    },
    {
     "access" : "private",
     "field_name" : "mMediaMetrics",
     "field_offset" : 7808,
     "referenced_type" : "type-284"
    }
   ],
   "linker_set_key" : "android::AudioTrack",
   "name" : "android::AudioTrack",
   "record_kind" : "class",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 984,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h",
   "unique_id" : "_ZTSN7android10AudioTrackE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioTrack19onAudioDeviceUpdateEii"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::AudioMixMatchCriterion>",
   "name" : "android::trait_trivial_move<android::AudioMixMatchCriterion>",
   "referenced_type" : "type-2460",
   "self_type" : "type-2460",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_22AudioMixMatchCriterionEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::Vector<float> >",
   "name" : "android::trait_trivial_move<android::Vector<float> >",
   "referenced_type" : "type-2461",
   "self_type" : "type-2461",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2434" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_6VectorIfEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::sp<android::AudioIoDescriptor> >",
   "name" : "android::trait_trivial_move<android::sp<android::AudioIoDescriptor> >",
   "referenced_type" : "type-2462",
   "self_type" : "type-2462",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2spINS_17AudioIoDescriptorEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "referenced_type" : "type-2463",
   "self_type" : "type-2463",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-708" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "name" : "android::trait_trivial_move<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "referenced_type" : "type-2464",
   "self_type" : "type-2464",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "name" : "android::trait_trivial_move<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "referenced_type" : "type-2465",
   "self_type" : "type-2465",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "referenced_type" : "type-2466",
   "self_type" : "type-2466",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tIiNS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::sp<android::AudioSystem::AudioPortCallback> >",
   "name" : "android::trait_trivial_move<android::sp<android::AudioSystem::AudioPortCallback> >",
   "referenced_type" : "type-2467",
   "self_type" : "type-2467",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<unsigned int, unsigned int> >",
   "referenced_type" : "type-2468",
   "self_type" : "type-2468",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_16key_value_pair_tIjjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::AudioMixMatchCriterion>",
   "name" : "android::trait_pointer<android::AudioMixMatchCriterion>",
   "referenced_type" : "type-2469",
   "self_type" : "type-2469",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_22AudioMixMatchCriterionEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-248"
    }
   ],
   "linker_set_key" : "android::sp<android::IAudioTrack>",
   "name" : "android::sp<android::IAudioTrack>",
   "record_kind" : "class",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-249" ],
   "unique_id" : "_ZTSN7android2spINS_11IAudioTrackEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<float>",
   "name" : "android::trait_pointer<float>",
   "referenced_type" : "type-2470",
   "self_type" : "type-2470",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android13trait_pointerIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::Vector<float> >",
   "name" : "android::trait_pointer<android::Vector<float> >",
   "referenced_type" : "type-2471",
   "self_type" : "type-2471",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2434" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_6VectorIfEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<int>",
   "name" : "android::trait_pointer<int>",
   "referenced_type" : "type-2472",
   "self_type" : "type-2472",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android13trait_pointerIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "name" : "android::trait_pointer<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "referenced_type" : "type-2473",
   "self_type" : "type-2473",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-708" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::sp<android::AudioIoDescriptor> >",
   "name" : "android::trait_pointer<android::sp<android::AudioIoDescriptor> >",
   "referenced_type" : "type-2474",
   "self_type" : "type-2474",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2spINS_17AudioIoDescriptorEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "name" : "android::trait_pointer<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "referenced_type" : "type-2475",
   "self_type" : "type-2475",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "name" : "android::trait_pointer<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "referenced_type" : "type-2476",
   "self_type" : "type-2476",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tIiNS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "name" : "android::trait_pointer<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "referenced_type" : "type-2477",
   "self_type" : "type-2477",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::sp<android::AudioSystem::AudioPortCallback> >",
   "name" : "android::trait_pointer<android::sp<android::AudioSystem::AudioPortCallback> >",
   "referenced_type" : "type-2478",
   "self_type" : "type-2478",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::trait_pointer<android::key_value_pair_t<unsigned int, unsigned int> >",
   "referenced_type" : "type-2479",
   "self_type" : "type-2479",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSN7android13trait_pointerINS_16key_value_pair_tIjjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_pointer<unsigned int>",
   "name" : "android::trait_pointer<unsigned int>",
   "referenced_type" : "type-2480",
   "self_type" : "type-2480",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android13trait_pointerIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::AudioMixMatchCriterion>",
   "name" : "android::traits<android::AudioMixMatchCriterion>",
   "referenced_type" : "type-2481",
   "self_type" : "type-2481",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-669" ],
   "unique_id" : "_ZTSN7android6traitsINS_22AudioMixMatchCriterionEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<float>",
   "name" : "android::traits<float>",
   "referenced_type" : "type-2482",
   "self_type" : "type-2482",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android6traitsIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::Vector<float> >",
   "name" : "android::traits<android::Vector<float> >",
   "referenced_type" : "type-2483",
   "self_type" : "type-2483",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2434" ],
   "unique_id" : "_ZTSN7android6traitsINS_6VectorIfEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<int>",
   "name" : "android::traits<int>",
   "referenced_type" : "type-2484",
   "self_type" : "type-2484",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android6traitsIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "name" : "android::traits<android::key_value_pair_t<int, android::sp<android::AudioIoDescriptor> > >",
   "referenced_type" : "type-2485",
   "self_type" : "type-2485",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-708" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tIiNS_2spINS_17AudioIoDescriptorEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::sp<android::AudioIoDescriptor> >",
   "name" : "android::traits<android::sp<android::AudioIoDescriptor> >",
   "referenced_type" : "type-2486",
   "self_type" : "type-2486",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android6traitsINS_2spINS_17AudioIoDescriptorEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "name" : "android::traits<android::wp<android::AudioSystem::AudioDeviceCallback> >",
   "referenced_type" : "type-2487",
   "self_type" : "type-2487",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-144" ],
   "unique_id" : "_ZTSN7android6traitsINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "name" : "android::traits<android::key_value_pair_t<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > > >",
   "referenced_type" : "type-2488",
   "self_type" : "type-2488",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-713" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tIiNS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "name" : "android::traits<android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "referenced_type" : "type-2489",
   "self_type" : "type-2489",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-710" ],
   "unique_id" : "_ZTSN7android6traitsINS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-194"
    }
   ],
   "linker_set_key" : "android::IAudioTrack",
   "name" : "android::IAudioTrack",
   "record_kind" : "class",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/IAudioTrack.h",
   "unique_id" : "_ZTSN7android11IAudioTrackE",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IAudioTrackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IAudioTrackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11IAudioTrackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11IAudioTrack22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11IAudioTrack7getCblkEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack5startEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack4stopEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack5pauseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack15attachAuxEffectEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack13setParametersERKNS_7String8E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack12getTimestampERNS_14AudioTimestampE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack6signalEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack17applyVolumeShaperERKNS_2spINS_5media12VolumeShaper13ConfigurationEEERKNS1_INS3_9OperationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11IAudioTrack20getVolumeShaperStateEi"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11IAudioTrackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IAudioTrackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android11IAudioTrackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::sp<android::AudioSystem::AudioPortCallback> >",
   "name" : "android::traits<android::sp<android::AudioSystem::AudioPortCallback> >",
   "referenced_type" : "type-2490",
   "self_type" : "type-2490",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSN7android6traitsINS_2spINS_11AudioSystem17AudioPortCallbackEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<android::key_value_pair_t<unsigned int, unsigned int> >",
   "name" : "android::traits<android::key_value_pair_t<unsigned int, unsigned int> >",
   "referenced_type" : "type-2491",
   "self_type" : "type-2491",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-331" ],
   "unique_id" : "_ZTSN7android6traitsINS_16key_value_pair_tIjjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::traits<unsigned int>",
   "name" : "android::traits<unsigned int>",
   "referenced_type" : "type-2492",
   "self_type" : "type-2492",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android6traitsIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<int, android::sp<android::AudioIoDescriptor> >",
   "name" : "android::aggregate_traits<int, android::sp<android::AudioIoDescriptor> >",
   "referenced_type" : "type-2493",
   "self_type" : "type-2493",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41", "type-371" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIiNS_2spINS_17AudioIoDescriptorEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "name" : "android::aggregate_traits<int, android::Vector<android::wp<android::AudioSystem::AudioDeviceCallback> > >",
   "referenced_type" : "type-2494",
   "self_type" : "type-2494",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41", "type-710" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIiNS_6VectorINS_2wpINS_11AudioSystem19AudioDeviceCallbackEEEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::aggregate_traits<unsigned int, unsigned int>",
   "name" : "android::aggregate_traits<unsigned int, unsigned int>",
   "referenced_type" : "type-2495",
   "self_type" : "type-2495",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2", "type-2" ],
   "unique_id" : "_ZTSN7android16aggregate_traitsIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-2496",
   "self_type" : "type-2496",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-2497",
   "self_type" : "type-2497",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-2498",
   "self_type" : "type-2498",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-2499",
   "self_type" : "type-2499",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-251"
    }
   ],
   "linker_set_key" : "android::sp<android::AudioTrack::AudioTrackThread>",
   "name" : "android::sp<android::AudioTrack::AudioTrackThread>",
   "record_kind" : "class",
   "referenced_type" : "type-250",
   "self_type" : "type-250",
   "size" : 8,
   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-252" ],
   "unique_id" : "_ZTSN7android2spINS_10AudioTrack16AudioTrackThreadEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-2500",
   "self_type" : "type-2500",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-206" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-2501",
   "self_type" : "type-2501",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-206" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-2502",
   "self_type" : "type-2502",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-206" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-2503",
   "self_type" : "type-2503",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-206" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-2504",
   "self_type" : "type-2504",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-2505",
   "self_type" : "type-2505",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-2506",
   "self_type" : "type-2506",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-2507",
   "self_type" : "type-2507",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-2508",
   "self_type" : "type-2508",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-2509",
   "self_type" : "type-2509",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-2510",
   "self_type" : "type-2510",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-2511",
   "self_type" : "type-2511",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-5" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-2512",
   "self_type" : "type-2512",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-2513",
   "self_type" : "type-2513",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-2514",
   "self_type" : "type-2514",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-2515",
   "self_type" : "type-2515",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-18" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-2516",
   "self_type" : "type-2516",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-2517",
   "self_type" : "type-2517",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-2518",
   "self_type" : "type-2518",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-2519",
   "self_type" : "type-2519",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-207"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mReceiver",
     "field_offset" : 1088,
     "referenced_type" : "type-253"
    },
    {
     "access" : "private",
     "field_name" : "mMyLock",
     "field_offset" : 1152,
     "referenced_type" : "type-202"
    },
    {
     "access" : "private",
     "field_name" : "mMyCond",
     "field_offset" : 1472,
     "referenced_type" : "type-204"
    },
    {
     "access" : "private",
     "field_name" : "mPaused",
     "field_offset" : 1856,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mPausedInt",
     "field_offset" : 1864,
     "referenced_type" : "type-206"
    },
    {
     "access" : "private",
     "field_name" : "mPausedNs",
     "field_offset" : 1920,
     "referenced_type" : "type-106"
    },
    {
     "access" : "private",
     "field_name" : "mIgnoreNextPausedInt",
     "field_offset" : 1984,
     "referenced_type" : "type-206"
    }
   ],
   "linker_set_key" : "android::AudioTrack::AudioTrackThread",
   "name" : "android::AudioTrack::AudioTrackThread",
   "record_kind" : "class",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 272,
   "source_file" : "/frameworks/av/media/libaudioclient/include/media/AudioTrack.h",
   "unique_id" : "_ZTSN7android10AudioTrack16AudioTrackThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 256,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack16AudioTrackThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "mangled_component_name" : "_ZN7android10AudioTrack16AudioTrackThread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -256,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -256,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10AudioTrack16AudioTrackThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10AudioTrack16AudioTrackThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android10AudioTrack16AudioTrackThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-2520",
   "self_type" : "type-2520",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-2521",
   "self_type" : "type-2521",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-2522",
   "self_type" : "type-2522",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-2523",
   "self_type" : "type-2523",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-2524",
   "self_type" : "type-2524",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-2525",
   "self_type" : "type-2525",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-2526",
   "self_type" : "type-2526",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-2527",
   "self_type" : "type-2527",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-2528",
   "self_type" : "type-2528",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-2529",
   "self_type" : "type-2529",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-2530",
   "self_type" : "type-2530",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-2531",
   "self_type" : "type-2531",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-106" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-2532",
   "self_type" : "type-2532",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-219" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-2533",
   "self_type" : "type-2533",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-219" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-2534",
   "self_type" : "type-2534",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-219" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-2535",
   "self_type" : "type-2535",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-219" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-2536",
   "self_type" : "type-2536",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2334" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-2537",
   "self_type" : "type-2537",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2334" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-2538",
   "self_type" : "type-2538",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2334" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-2539",
   "self_type" : "type-2539",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2334" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-2540",
   "self_type" : "type-2540",
   "size" : 1,
   "source_file" : "/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-603" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
