{
 "array_types" :
 [
  {
   "linker_set_key" : "__sFILE []",
   "name" : "__sFILE []",
   "referenced_type" : "type-1184",
   "self_type" : "type-1200",
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "user_fpregs::fp_reg [8]",
   "name" : "user_fpregs::fp_reg [8]",
   "referenced_type" : "type-1229",
   "self_type" : "type-1228",
   "size" : 96,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libunwind::v128 [32]",
   "name" : "libunwind::v128 [32]",
   "referenced_type" : "type-1292",
   "self_type" : "type-1291",
   "size" : 512,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [29]",
   "name" : "int [29]",
   "referenced_type" : "type-13",
   "self_type" : "type-1117",
   "size" : 116,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [8]",
   "name" : "int [8]",
   "referenced_type" : "type-13",
   "self_type" : "type-881",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [1]",
   "name" : "int [1]",
   "referenced_type" : "type-13",
   "self_type" : "type-883",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [10]",

   "name" : "const double",
   "referenced_type" : "type-80",
   "self_type" : "type-509",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "type-891",
   "self_type" : "type-893",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned int, const void *)",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "type-894",
   "self_type" : "type-896",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-897",
   "self_type" : "type-899",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const JNINativeInterface",
   "name" : "const JNINativeInterface",
   "referenced_type" : "type-8",
   "self_type" : "type-7",
   "size" : 932,
   "source_file" : "/libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-900",
   "self_type" : "type-902",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::exception_ptr",
   "name" : "const std::exception_ptr",
   "referenced_type" : "type-910",
   "self_type" : "type-912",
   "size" : 4,
   "source_file" : "/external/libcxx/include/exception"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "type-915",
   "self_type" : "type-916",
   "size" : 8,
   "source_file" : "/external/libcxx/include/exception"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::type_info",
   "name" : "const std::type_info",
   "referenced_type" : "type-918",
   "self_type" : "type-920",
   "size" : 8,
   "source_file" : "/external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "type-925",
   "self_type" : "type-926",
   "size" : 1,
   "source_file" : "/external/libcxx/include/new"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_ctor_base<false, false>",
   "name" : "const std::__sfinae_ctor_base<false, false>",
   "referenced_type" : "type-945",
   "self_type" : "type-948",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_ctor_base<true, false>",
   "name" : "const std::__sfinae_ctor_base<true, false>",
   "referenced_type" : "type-951",
   "self_type" : "type-953",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_ctor_base<false, true>",
   "name" : "const std::__sfinae_ctor_base<false, true>",
   "referenced_type" : "type-957",
   "self_type" : "type-961",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_assign_base<false, false>",
   "name" : "const std::__sfinae_assign_base<false, false>",
   "referenced_type" : "type-963",
   "self_type" : "type-965",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_assign_base<true, false>",
   "name" : "const std::__sfinae_assign_base<true, false>",
   "referenced_type" : "type-968",
   "self_type" : "type-970",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::__sfinae_assign_base<false, true>",
   "name" : "const std::__sfinae_assign_base<false, true>",
   "referenced_type" : "type-974",
   "self_type" : "type-976",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__tuple"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::__libcpp_debug_info",
   "name" : "const std::__libcpp_debug_info",
   "referenced_type" : "type-984",
   "self_type" : "type-988",
   "size" : 16,
   "source_file" : "/external/libcxx/include/__debug"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::piecewise_construct_t",
   "name" : "const std::piecewise_construct_t",
   "referenced_type" : "type-990",
   "self_type" : "type-991",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::in_place_t",
   "name" : "const std::in_place_t",
   "referenced_type" : "type-994",
   "self_type" : "type-996",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-9",
   "self_type" : "type-981",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char, unsigned int>",
   "name" : "std::unary_function<char, unsigned int>",
   "referenced_type" : "type-1000",
   "self_type" : "type-1000",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-21", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIcjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<signed char, unsigned int>",
   "name" : "std::unary_function<signed char, unsigned int>",
   "referenced_type" : "type-1001",
   "self_type" : "type-1001",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-25", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIajEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned char, unsigned int>",
   "name" : "std::unary_function<unsigned char, unsigned int>",
   "referenced_type" : "type-1002",
   "self_type" : "type-1002",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIhjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char16_t, unsigned int>",
   "name" : "std::unary_function<char16_t, unsigned int>",
   "referenced_type" : "type-1003",
   "self_type" : "type-1003",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-748", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDsjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<char32_t, unsigned int>",
   "name" : "std::unary_function<char32_t, unsigned int>",
   "referenced_type" : "type-1004",
   "self_type" : "type-1004",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-750", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDijEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<wchar_t, unsigned int>",
   "name" : "std::unary_function<wchar_t, unsigned int>",
   "referenced_type" : "type-1005",
   "self_type" : "type-1005",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-746", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIwjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<short, unsigned int>",
   "name" : "std::unary_function<short, unsigned int>",
   "referenced_type" : "type-1006",
   "self_type" : "type-1006",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-78", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIsjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned short, unsigned int>",
   "name" : "std::unary_function<unsigned short, unsigned int>",
   "referenced_type" : "type-1007",
   "self_type" : "type-1007",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-77", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionItjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<int, unsigned int>",
   "name" : "std::unary_function<int, unsigned int>",
   "referenced_type" : "type-1008",
   "self_type" : "type-1008",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-13", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIijEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned int, unsigned int>",
   "name" : "std::unary_function<unsigned int, unsigned int>",
   "referenced_type" : "type-1009",
   "self_type" : "type-1009",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-555", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIjjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long, unsigned int>",
   "name" : "std::unary_function<long, unsigned int>",
   "referenced_type" : "type-1010",
   "self_type" : "type-1010",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-704", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIljEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long, unsigned int>",
   "name" : "std::unary_function<unsigned long, unsigned int>",
   "referenced_type" : "type-1011",
   "self_type" : "type-1011",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-757", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionImjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long long, unsigned int>",
   "name" : "std::unary_function<long long, unsigned int>",
   "referenced_type" : "type-1012",
   "self_type" : "type-1012",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIxjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<unsigned long long, unsigned int>",
   "name" : "std::unary_function<unsigned long long, unsigned int>",
   "referenced_type" : "type-1013",
   "self_type" : "type-1013",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-662", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIyjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<float, unsigned int>",
   "name" : "std::unary_function<float, unsigned int>",
   "referenced_type" : "type-1014",
   "self_type" : "type-1014",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIfjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<double, unsigned int>",
   "name" : "std::unary_function<double, unsigned int>",
   "referenced_type" : "type-1015",
   "self_type" : "type-1015",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIdjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<long double, unsigned int>",
   "name" : "std::unary_function<long double, unsigned int>",
   "referenced_type" : "type-1016",
   "self_type" : "type-1016",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIejEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::unary_function<nullptr_t, unsigned int>",
   "name" : "std::unary_function<nullptr_t, unsigned int>",
   "referenced_type" : "type-1017",
   "self_type" : "type-1017",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-738", "type-555" ],
   "unique_id" : "_ZTSNSt3__114unary_functionIDnjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__murmur2_or_cityhash<unsigned int, 32>",
   "name" : "std::__murmur2_or_cityhash<unsigned int, 32>",
   "referenced_type" : "type-1018",
   "self_type" : "type-1018",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__121__murmur2_or_cityhashIjLj32EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-997"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<std::_PairT, 2>",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "referenced_type" : "type-1020",
   "self_type" : "type-1020",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-998" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashINS_6_PairTELj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1012"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long long, 2>",
   "name" : "std::__scalar_hash<long long, 2>",
   "referenced_type" : "type-1023",
   "self_type" : "type-1023",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIxLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1013"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<unsigned long long, 2>",
   "name" : "std::__scalar_hash<unsigned long long, 2>",
   "referenced_type" : "type-1024",
   "self_type" : "type-1024",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-662" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIyLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1014"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<float, 1>",
   "name" : "std::__scalar_hash<float, 1>",
   "referenced_type" : "type-1025",
   "self_type" : "type-1025",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIfLj1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1015"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<double, 2>",
   "name" : "std::__scalar_hash<double, 2>",
   "referenced_type" : "type-1028",
   "self_type" : "type-1028",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIdLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1016"
    }
   ],
   "linker_set_key" : "std::__scalar_hash<long double, 2>",
   "name" : "std::__scalar_hash<long double, 2>",
   "referenced_type" : "type-1031",
   "self_type" : "type-1031",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__113__scalar_hashIeLj2EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-999"
    }
   ],
   "linker_set_key" : "std::hash<bool>",
   "name" : "std::hash<bool>",
   "referenced_type" : "type-1034",
   "self_type" : "type-1034",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-709" ],
   "unique_id" : "_ZTSNSt3__14hashIbEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1000"
    }
   ],
   "linker_set_key" : "std::hash<char>",
   "name" : "std::hash<char>",
   "referenced_type" : "type-1037",
   "self_type" : "type-1037",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSNSt3__14hashIcEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1001"
    }
   ],
   "linker_set_key" : "std::hash<signed char>",
   "name" : "std::hash<signed char>",
   "referenced_type" : "type-1040",
   "self_type" : "type-1040",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSNSt3__14hashIaEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1002"
    }
   ],
   "linker_set_key" : "std::hash<unsigned char>",
   "name" : "std::hash<unsigned char>",
   "referenced_type" : "type-1043",
   "self_type" : "type-1043",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__14hashIhEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1003"
    }
   ],
   "linker_set_key" : "std::hash<char16_t>",
   "name" : "std::hash<char16_t>",
   "referenced_type" : "type-1046",
   "self_type" : "type-1046",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-748" ],
   "unique_id" : "_ZTSNSt3__14hashIDsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1004"
    }
   ],
   "linker_set_key" : "std::hash<char32_t>",
   "name" : "std::hash<char32_t>",
   "referenced_type" : "type-1049",
   "self_type" : "type-1049",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-750" ],
   "unique_id" : "_ZTSNSt3__14hashIDiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1005"
    }
   ],
   "linker_set_key" : "std::hash<wchar_t>",
   "name" : "std::hash<wchar_t>",
   "referenced_type" : "type-1052",
   "self_type" : "type-1052",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-746" ],
   "unique_id" : "_ZTSNSt3__14hashIwEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1006"
    }
   ],
   "linker_set_key" : "std::hash<short>",
   "name" : "std::hash<short>",
   "referenced_type" : "type-1055",
   "self_type" : "type-1055",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__14hashIsEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1007"
    }
   ],
   "linker_set_key" : "std::hash<unsigned short>",
   "name" : "std::hash<unsigned short>",
   "referenced_type" : "type-1058",
   "self_type" : "type-1058",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-77" ],
   "unique_id" : "_ZTSNSt3__14hashItEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1008"
    }
   ],
   "linker_set_key" : "std::hash<int>",
   "name" : "std::hash<int>",
   "referenced_type" : "type-1061",
   "self_type" : "type-1061",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__14hashIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1009"
    }
   ],
   "linker_set_key" : "std::hash<unsigned int>",
   "name" : "std::hash<unsigned int>",
   "referenced_type" : "type-1064",
   "self_type" : "type-1064",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__14hashIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1010"
    }
   ],
   "linker_set_key" : "std::hash<long>",
   "name" : "std::hash<long>",
   "referenced_type" : "type-1067",
   "self_type" : "type-1067",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-704" ],
   "unique_id" : "_ZTSNSt3__14hashIlEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1011"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long>",
   "name" : "std::hash<unsigned long>",
   "referenced_type" : "type-1070",
   "self_type" : "type-1070",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-757" ],
   "unique_id" : "_ZTSNSt3__14hashImEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1023"
    }
   ],
   "linker_set_key" : "std::hash<long long>",
   "name" : "std::hash<long long>",
   "referenced_type" : "type-1073",
   "self_type" : "type-1073",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSNSt3__14hashIxEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1024"
    }
   ],
   "linker_set_key" : "std::hash<unsigned long long>",
   "name" : "std::hash<unsigned long long>",
   "referenced_type" : "type-1074",
   "self_type" : "type-1074",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-662" ],
   "unique_id" : "_ZTSNSt3__14hashIyEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1025"
    }
   ],
   "linker_set_key" : "std::hash<float>",
   "name" : "std::hash<float>",
   "referenced_type" : "type-1075",
   "self_type" : "type-1075",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__14hashIfEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1028"
    }
   ],
   "linker_set_key" : "std::hash<double>",
   "name" : "std::hash<double>",
   "referenced_type" : "type-1078",
   "self_type" : "type-1078",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__14hashIdEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1031"
    }
   ],
   "linker_set_key" : "std::hash<long double>",
   "name" : "std::hash<long double>",
   "referenced_type" : "type-1081",
   "self_type" : "type-1081",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__14hashIeEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1017"
    }
   ],
   "linker_set_key" : "std::hash<nullptr_t>",
   "name" : "std::hash<nullptr_t>",
   "referenced_type" : "type-1084",
   "self_type" : "type-1084",
   "size" : 1,
   "source_file" : "/external/libcxx/include/utility",
   "template_args" : [ "type-738" ],
   "unique_id" : "_ZTSNSt3__14hashIDnEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<int, true>",
   "name" : "std::__libcpp_numeric_limits<int, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1091",
   "self_type" : "type-1091",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIiLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<short, true>",
   "name" : "std::__libcpp_numeric_limits<short, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1092",
   "self_type" : "type-1092",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIsLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_compute_min<int, 31, true>",
   "name" : "std::__libcpp_compute_min<int, 31, true>",
   "referenced_type" : "type-1093",
   "self_type" : "type-1093",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_compute_minIiLi31ELb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<bool, true>",
   "name" : "std::__libcpp_numeric_limits<bool, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1094",
   "self_type" : "type-1094",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-709" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIbLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<float, true>",
   "name" : "std::__libcpp_numeric_limits<float, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1095",
   "self_type" : "type-1095",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-79" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIfLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<double, true>",
   "name" : "std::__libcpp_numeric_limits<double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1096",
   "self_type" : "type-1096",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-80" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIdLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<long double, true>",
   "name" : "std::__libcpp_numeric_limits<long double, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1097",
   "self_type" : "type-1097",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-3" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIeLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1091"
    }
   ],
   "linker_set_key" : "std::numeric_limits<int>",
   "name" : "std::numeric_limits<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1098",
   "self_type" : "type-1098",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1092"
    }
   ],
   "linker_set_key" : "std::numeric_limits<short>",
   "name" : "std::numeric_limits<short>",
   "record_kind" : "class",
   "referenced_type" : "type-1099",
   "self_type" : "type-1099",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIsEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-1100",
   "self_type" : "type-1100",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-1101",
   "self_type" : "type-1101",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-1102",
   "self_type" : "type-1102",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1100"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-1100"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-1103",
   "self_type" : "type-1103",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1101"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-1101"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-1104",
   "self_type" : "type-1104",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-1105",
   "self_type" : "type-1105",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1105"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1105"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-1106",
   "self_type" : "type-1106",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-1107",
   "self_type" : "type-1107",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-1109"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-1130"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-1108",
   "self_type" : "type-1108",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-1110"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-1112"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3) at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3) at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3",
   "record_kind" : "union",
   "referenced_type" : "type-1109",
   "self_type" : "type-1109",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "type-1116"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-1115",
   "self_type" : "type-1115",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1117"
    },
    {
     "field_name" : "_kill",
     "referenced_type" : "type-1118"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-1119"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-1121"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-1122"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-1123"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-1128"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-1129"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3",
   "record_kind" : "union",
   "referenced_type" : "type-1116",
   "self_type" : "type-1116",
   "size" : 116,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:54:5",
   "referenced_type" : "type-1118",
   "self_type" : "type-1118",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1120"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:58:5",
   "referenced_type" : "type-1119",
   "self_type" : "type-1119",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-1120",
   "self_type" : "type-1120",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1120"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:64:5",
   "referenced_type" : "type-1121",
   "self_type" : "type-1121",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-704"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:69:5",
   "referenced_type" : "type-1122",
   "self_type" : "type-1122",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-1124"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5",
   "referenced_type" : "type-1123",
   "self_type" : "type-1123",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-1125"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-1127"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7",
   "record_kind" : "union",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-1126"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:89:9",
   "referenced_type" : "type-1125",
   "self_type" : "type-1125",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-1126"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:76:5)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:87:7)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:94:9",
   "referenced_type" : "type-1127",
   "self_type" : "type-1127",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:100:5",
   "referenced_type" : "type-1128",
   "self_type" : "type-1128",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "name" : "siginfo::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:52:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:104:5",
   "referenced_type" : "type-1129",
   "self_type" : "type-1129",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-1120"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "type-1133"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-1132",
   "self_type" : "type-1132",
   "size" : 64,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1134"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-1135"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3",
   "record_kind" : "union",
   "referenced_type" : "type-1133",
   "self_type" : "type-1133",
   "size" : 52,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-1136"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "name" : "sigevent::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:228:3)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:231:5",
   "referenced_type" : "type-1135",
   "self_type" : "type-1135",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1139"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-1130"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-1138",
   "self_type" : "type-1138",
   "size" : 16,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1110"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1112"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:105:3) at bionic/libc/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:105:3) at bionic/libc/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-1139",
   "self_type" : "type-1139",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1141"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-1130"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-1142"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-1140",
   "self_type" : "type-1140",
   "size" : 20,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1110"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1112"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:116:3) at bionic/libc/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:116:3) at bionic/libc/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-1141",
   "self_type" : "type-1141",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-1143"
    }
   ],
   "linker_set_key" : "sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "type-1142",
   "self_type" : "type-1142",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS10sigset64_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1145"
    }
   ],
   "linker_set_key" : "std::is_floating_point<unsigned int>",
   "name" : "std::is_floating_point<unsigned int>",
   "referenced_type" : "type-1144",
   "self_type" : "type-1144",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__117is_floating_pointIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_floating_point<unsigned int>",
   "name" : "std::__libcpp_is_floating_point<unsigned int>",
   "referenced_type" : "type-1145",
   "self_type" : "type-1145",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__126__libcpp_is_floating_pointIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "std::is_same<std::__less<unsigned int, unsigned int> &, std::__two>",
   "name" : "std::is_same<std::__less<unsigned int, unsigned int> &, std::__two>",
   "referenced_type" : "type-1146",
   "self_type" : "type-1146",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1147", "type-706" ],
   "unique_id" : "_ZTSNSt3__17is_sameIRNS_6__lessIjjEENS_5__twoEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__less<unsigned int, unsigned int>",
   "name" : "std::__less<unsigned int, unsigned int>",
   "referenced_type" : "type-1148",
   "self_type" : "type-1148",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-555", "type-555" ],
   "unique_id" : "_ZTSNSt3__16__lessIjjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "linker_set_key" : "std::is_arithmetic<unsigned int>",
   "name" : "std::is_arithmetic<unsigned int>",
   "referenced_type" : "type-1149",
   "self_type" : "type-1149",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__113is_arithmeticIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "linker_set_key" : "std::__is_referenceable<std::__less<unsigned int, unsigned int> >",
   "name" : "std::__is_referenceable<std::__less<unsigned int, unsigned int> >",
   "referenced_type" : "type-1150",
   "self_type" : "type-1150",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1148" ],
   "unique_id" : "_ZTSNSt3__118__is_referenceableINS_6__lessIjjEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__add_lvalue_reference_impl<std::__less<unsigned int, unsigned int>, true>",
   "name" : "std::__add_lvalue_reference_impl<std::__less<unsigned int, unsigned int>, true>",
   "referenced_type" : "type-1151",
   "self_type" : "type-1151",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1148" ],
   "unique_id" : "_ZTSNSt3__127__add_lvalue_reference_implINS_6__lessIjjEELb1EEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-1154"
    }
   ],
   "linker_set_key" : "unw_cursor_t",
   "name" : "unw_cursor_t",
   "referenced_type" : "type-1153",
   "self_type" : "type-1153",
   "size" : 1120,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS12unw_cursor_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::add_lvalue_reference<std::__less<unsigned int, unsigned int> >",
   "name" : "std::add_lvalue_reference<std::__less<unsigned int, unsigned int> >",
   "referenced_type" : "type-1155",
   "self_type" : "type-1155",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1148" ],
   "unique_id" : "_ZTSNSt3__120add_lvalue_referenceINS_6__lessIjjEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed_impl<int, true>",
   "name" : "std::__libcpp_is_signed_impl<int, true>",
   "referenced_type" : "type-1156",
   "self_type" : "type-1156",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_is_signed_implIiLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed_impl<unsigned int, true>",
   "name" : "std::__libcpp_is_signed_impl<unsigned int, true>",
   "referenced_type" : "type-1157",
   "self_type" : "type-1157",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_is_signed_implIjLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1156"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed<int, true>",
   "name" : "std::__libcpp_is_signed<int, true>",
   "referenced_type" : "type-1158",
   "self_type" : "type-1158",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__118__libcpp_is_signedIiLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1157"
    }
   ],
   "linker_set_key" : "std::__libcpp_is_signed<unsigned int, true>",
   "name" : "std::__libcpp_is_signed<unsigned int, true>",
   "referenced_type" : "type-1159",
   "self_type" : "type-1159",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__118__libcpp_is_signedIjLb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1158"
    }
   ],
   "linker_set_key" : "std::is_signed<int>",
   "name" : "std::is_signed<int>",
   "referenced_type" : "type-1160",
   "self_type" : "type-1160",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__19is_signedIiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1159"
    }
   ],
   "linker_set_key" : "std::is_signed<unsigned int>",
   "name" : "std::is_signed<unsigned int>",
   "referenced_type" : "type-1161",
   "self_type" : "type-1161",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__19is_signedIjEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "std::is_abstract<std::input_iterator_tag>",
   "name" : "std::is_abstract<std::input_iterator_tag>",
   "referenced_type" : "type-1162",
   "self_type" : "type-1162",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1163" ],
   "unique_id" : "_ZTSNSt3__111is_abstractINS_18input_iterator_tagEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::input_iterator_tag",
   "name" : "std::input_iterator_tag",
   "referenced_type" : "type-1163",
   "self_type" : "type-1163",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__118input_iterator_tagE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-1166"
    }
   ],
   "linker_set_key" : "unw_context_t",
   "name" : "unw_context_t",
   "referenced_type" : "type-1165",
   "self_type" : "type-1165",
   "size" : 1024,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS13unw_context_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "std::is_abstract<std::output_iterator_tag>",
   "name" : "std::is_abstract<std::output_iterator_tag>",
   "referenced_type" : "type-1167",
   "self_type" : "type-1167",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1168" ],
   "unique_id" : "_ZTSNSt3__111is_abstractINS_19output_iterator_tagEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::output_iterator_tag",
   "name" : "std::output_iterator_tag",
   "referenced_type" : "type-1168",
   "self_type" : "type-1168",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__119output_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "linker_set_key" : "std::is_convertible<std::random_access_iterator_tag, std::input_iterator_tag>",
   "name" : "std::is_convertible<std::random_access_iterator_tag, std::input_iterator_tag>",
   "referenced_type" : "type-1169",
   "self_type" : "type-1169",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1170", "type-1163" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleINS_26random_access_iterator_tagENS_18input_iterator_tagEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1171"
    }
   ],
   "linker_set_key" : "std::random_access_iterator_tag",
   "name" : "std::random_access_iterator_tag",
   "referenced_type" : "type-1170",
   "self_type" : "type-1170",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__126random_access_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1172"
    }
   ],
   "linker_set_key" : "std::bidirectional_iterator_tag",
   "name" : "std::bidirectional_iterator_tag",
   "referenced_type" : "type-1171",
   "self_type" : "type-1171",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__126bidirectional_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1163"
    }
   ],
   "linker_set_key" : "std::forward_iterator_tag",
   "name" : "std::forward_iterator_tag",
   "referenced_type" : "type-1172",
   "self_type" : "type-1172",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "unique_id" : "_ZTSNSt3__120forward_iterator_tagE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "std::is_convertible<std::random_access_iterator_tag, std::output_iterator_tag>",
   "name" : "std::is_convertible<std::random_access_iterator_tag, std::output_iterator_tag>",
   "referenced_type" : "type-1173",
   "self_type" : "type-1173",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-1170", "type-1168" ],
   "unique_id" : "_ZTSNSt3__114is_convertibleINS_26random_access_iterator_tagENS_19output_iterator_tagEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_ip",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "end_ip",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "lsda",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "handler",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "gp",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "unwind_info_size",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "unwind_info",
     "field_offset" : 256,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "extra",
     "field_offset" : 288,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "unw_proc_info_t",
   "name" : "unw_proc_info_t",
   "referenced_type" : "type-1175",
   "self_type" : "type-1175",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "_ZTS15unw_proc_info_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-876"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-1178",
   "self_type" : "type-1178",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-878"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-1179",
   "self_type" : "type-1179",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-1180",
   "self_type" : "type-1180",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-883"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-1181",
   "self_type" : "type-1181",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-883"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-1182",
   "self_type" : "type-1182",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-886"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-1183",
   "self_type" : "type-1183",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-1185"
    }
   ],
   "linker_set_key" : "__sFILE",
   "name" : "__sFILE",
   "referenced_type" : "type-1184",
   "self_type" : "type-1184",
   "size" : 84,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/struct_file.h",
   "unique_id" : "__sFILE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_numeric_limits<unsigned int, true>",
   "name" : "std::__libcpp_numeric_limits<unsigned int, true>",
   "record_kind" : "class",
   "referenced_type" : "type-1186",
   "self_type" : "type-1186",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__123__libcpp_numeric_limitsIjLb1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__libcpp_compute_min<unsigned int, 32, false>",
   "name" : "std::__libcpp_compute_min<unsigned int, 32, false>",
   "referenced_type" : "type-1187",
   "self_type" : "type-1187",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__120__libcpp_compute_minIjLi32ELb0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1186"
    }
   ],
   "linker_set_key" : "std::numeric_limits<unsigned int>",
   "name" : "std::numeric_limits<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-1188",
   "self_type" : "type-1188",
   "size" : 1,
   "source_file" : "/external/libcxx/include/limits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__114numeric_limitsIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "timespec",
   "name" : "timespec",
   "referenced_type" : "type-1189",
   "self_type" : "type-1189",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS8timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "timeval",
   "name" : "timeval",
   "referenced_type" : "type-1190",
   "self_type" : "type-1190",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS7timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "timezone",
   "name" : "timezone",
   "referenced_type" : "type-1191",
   "self_type" : "type-1191",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS8timezone"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1189"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-1189"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-1192",
   "self_type" : "type-1192",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1190"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-1190"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-1193",
   "self_type" : "type-1193",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-1194",
   "self_type" : "type-1194",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-1194"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-1194"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-1195",
   "self_type" : "type-1195",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-1196",
   "self_type" : "type-1196",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "type-757"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-1197",
   "self_type" : "type-1197",
   "size" : 84,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-1199"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-1130"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-1198",
   "self_type" : "type-1198",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-1110"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-1112"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "name" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "record_kind" : "union",
   "referenced_type" : "type-1199",
   "self_type" : "type-1199",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "type-1202"
    }
   ],
   "linker_set_key" : "siginfo",
   "name" : "siginfo",
   "referenced_type" : "type-1201",
   "self_type" : "type-1201",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS7siginfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1117"
    },
    {
     "field_name" : "_kill",
     "referenced_type" : "type-1203"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-1204"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-1206"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-1207"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-1208"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-1212"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-1213"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3",
   "record_kind" : "union",
   "referenced_type" : "type-1202",
   "self_type" : "type-1202",
   "size" : 116,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:54:5",
   "referenced_type" : "type-1203",
   "self_type" : "type-1203",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1205"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:58:5",
   "referenced_type" : "type-1204",
   "self_type" : "type-1204",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "referenced_type" : "type-1205",
   "self_type" : "type-1205",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS6sigval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-1205"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:64:5",
   "referenced_type" : "type-1206",
   "self_type" : "type-1206",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-704"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:69:5",
   "referenced_type" : "type-1207",
   "self_type" : "type-1207",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-1209"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5",
   "referenced_type" : "type-1208",
   "self_type" : "type-1208",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-1210"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-1211"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7",
   "record_kind" : "union",
   "referenced_type" : "type-1209",
   "self_type" : "type-1209",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-1126"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:89:9",
   "referenced_type" : "type-1210",
   "self_type" : "type-1210",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-1126"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:76:5)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:87:7)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:94:9",
   "referenced_type" : "type-1211",
   "self_type" : "type-1211",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:100:5",
   "referenced_type" : "type-1212",
   "self_type" : "type-1212",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5",
   "name" : "siginfo::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:52:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:104:5",
   "referenced_type" : "type-1213",
   "self_type" : "type-1213",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN7siginfoUt_Ut5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-1215",
   "self_type" : "type-1215",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-1216",
   "self_type" : "type-1216",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-1217",
   "self_type" : "type-1217",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "type-1205"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "type-1219"
    }
   ],
   "linker_set_key" : "sigevent",
   "name" : "sigevent",
   "referenced_type" : "type-1218",
   "self_type" : "type-1218",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS8sigevent"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "type-1134"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "type-1220"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3",
   "name" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3",
   "record_kind" : "union",
   "referenced_type" : "type-1219",
   "self_type" : "type-1219",
   "size" : 52,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "type-1136"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5",
   "name" : "sigevent::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:228:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:231:5",
   "referenced_type" : "type-1220",
   "self_type" : "type-1220",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN8sigeventUt_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-1221",
   "self_type" : "type-1221",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-1143"
    }
   ],
   "linker_set_key" : "sigset64_t",
   "name" : "sigset64_t",
   "referenced_type" : "type-1222",
   "self_type" : "type-1222",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS10sigset64_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1224"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-1130"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-1223",
   "self_type" : "type-1223",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1110"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1112"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-1224",
   "self_type" : "type-1224",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1226"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-1130"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-1222"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-1225",
   "self_type" : "type-1225",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-1110"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-1112"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-1226",
   "self_type" : "type-1226",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-1228"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "type-1230"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "type-1227",
   "self_type" : "type-1227",
   "size" : 116,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_fpregs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "user_fpregs::fp_reg",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "type-1229",
   "self_type" : "type-1229",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_fpregs::fp_reg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "type-1232"
    }
   ],
   "linker_set_key" : "user_regs",
   "name" : "user_regs",
   "referenced_type" : "type-1231",
   "self_type" : "type-1231",
   "size" : 72,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_regs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-1234"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "type-757"
    }
   ],
   "linker_set_key" : "user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "type-1233",
   "self_type" : "type-1233",
   "size" : 264,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_vfp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "type-757"
    }
   ],
   "linker_set_key" : "user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "type-1235",
   "self_type" : "type-1235",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user_vfp_exc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-1231"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "type-1237"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "type-1238"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "type-881"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "type-1227"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "type-1239"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-1236",
   "self_type" : "type-1236",
   "size" : 296,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-1240",
   "self_type" : "type-1240",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-1242"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-1215"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-1197"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "type-1243"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "type-1245"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "type-1246"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-1241",
   "self_type" : "type-1241",
   "size" : 744,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1244"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-1222"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3",
   "name" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3",
   "record_kind" : "union",
   "referenced_type" : "type-1243",
   "self_type" : "type-1243",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5",
   "name" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5) at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5",
   "referenced_type" : "type-1244",
   "self_type" : "type-1244",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:90:3)::(anonymous struct at out/soong/ndk/sysroot/usr/include/sys/ucontext.h:91:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-876"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-1247",
   "self_type" : "type-1247",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-1248",
   "self_type" : "type-1248",
   "size" : 44,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-1250"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-1249",
   "self_type" : "type-1249",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__has_iterator_category<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "name" : "std::__has_iterator_category<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "referenced_type" : "type-1251",
   "self_type" : "type-1251",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-1252" ],
   "unique_id" : "_ZTSNSt3__123__has_iterator_categoryIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_i",
     "referenced_type" : "type-555"
    },
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-1253"
    },
    {
     "access" : "private",
     "field_name" : "_sects",
     "field_offset" : 64,
     "referenced_type" : "type-1255"
    }
   ],
   "linker_set_key" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "name" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "referenced_type" : "type-1252",
   "self_type" : "type-1252",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-1254" ],
   "unique_id" : "_ZTSN9libunwind20EHABISectionIteratorINS_17LocalAddressSpaceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "libunwind::LocalAddressSpace",
   "name" : "libunwind::LocalAddressSpace",
   "record_kind" : "class",
   "referenced_type" : "type-1254",
   "self_type" : "type-1254",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind17LocalAddressSpaceE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arm_section",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "arm_section_length",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "libunwind::UnwindInfoSections",
   "name" : "libunwind::UnwindInfoSections",
   "referenced_type" : "type-1257",
   "self_type" : "type-1257",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind18UnwindInfoSectionsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__iterator_traits_impl<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "name" : "std::__iterator_traits_impl<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "referenced_type" : "type-1258",
   "self_type" : "type-1258",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-1252" ],
   "unique_id" : "_ZTSNSt3__122__iterator_traits_implIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1258"
    }
   ],
   "linker_set_key" : "std::__iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "name" : "std::__iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>, true>",
   "referenced_type" : "type-1259",
   "self_type" : "type-1259",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-1252" ],
   "unique_id" : "_ZTSNSt3__117__iterator_traitsIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEELb1EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1259"
    }
   ],
   "linker_set_key" : "std::iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "name" : "std::iterator_traits<libunwind::EHABISectionIterator<libunwind::LocalAddressSpace> >",
   "referenced_type" : "type-1260",
   "self_type" : "type-1260",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-1252" ],
   "unique_id" : "_ZTSNSt3__115iterator_traitsIN9libunwind20EHABISectionIteratorINS1_17LocalAddressSpaceEEEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::auto_ptr<void>",
   "name" : "std::auto_ptr<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1265",
   "self_type" : "type-1265",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__18auto_ptrIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__rs_default",
   "name" : "std::__rs_default",
   "record_kind" : "class",
   "referenced_type" : "type-1275",
   "self_type" : "type-1275",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__112__rs_defaultE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "referenced_type" : "type-1276",
   "self_type" : "type-1276",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1277", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_x86E13unw_context_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1278"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86",
   "name" : "libunwind::Registers_x86",
   "record_kind" : "class",
   "referenced_type" : "type-1277",
   "self_type" : "type-1277",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x86E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__eax",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__ebx",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__ecx",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__edx",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__edi",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__esi",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__ebp",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__esp",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__ss",
     "field_offset" : 256,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__eflags",
     "field_offset" : 288,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__eip",
     "field_offset" : 320,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 352,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__ds",
     "field_offset" : 384,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__es",
     "field_offset" : 416,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 448,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 480,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86::GPRs",
   "name" : "libunwind::Registers_x86::GPRs",
   "referenced_type" : "type-1278",
   "self_type" : "type-1278",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x864GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "referenced_type" : "type-1279",
   "self_type" : "type-1279",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1277" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1280",
   "self_type" : "type-1280",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "referenced_type" : "type-1281",
   "self_type" : "type-1281",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1282", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1283"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64",
   "name" : "libunwind::Registers_x86_64",
   "record_kind" : "class",
   "referenced_type" : "type-1282",
   "self_type" : "type-1282",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__rax",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rbx",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rcx",
     "field_offset" : 128,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rdx",
     "field_offset" : 192,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rdi",
     "field_offset" : 256,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rsi",
     "field_offset" : 320,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rbp",
     "field_offset" : 384,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rsp",
     "field_offset" : 448,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 512,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 576,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 640,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 704,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 768,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 832,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 896,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 960,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rip",
     "field_offset" : 1024,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__rflags",
     "field_offset" : 1088,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 1152,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 1216,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 1280,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64::GPRs",
   "name" : "libunwind::Registers_x86_64::GPRs",
   "referenced_type" : "type-1283",
   "self_type" : "type-1283",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_644GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "referenced_type" : "type-1284",
   "self_type" : "type-1284",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1282" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1285",
   "self_type" : "type-1285",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "referenced_type" : "type-1286",
   "self_type" : "type-1286",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1287", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_ppcE13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1288"
    },
    {
     "access" : "private",
     "field_name" : "_floatRegisters",
     "field_offset" : 1280,
     "referenced_type" : "type-1289"
    },
    {
     "access" : "private",
     "field_name" : "_vectorRegisters",
     "field_offset" : 3392,
     "referenced_type" : "type-1291"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc",
   "name" : "libunwind::Registers_ppc",
   "record_kind" : "class",
   "referenced_type" : "type-1287",
   "self_type" : "type-1287",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppcE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 256,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 288,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 320,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 352,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 384,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 416,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 448,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 480,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 512,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 544,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 576,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 608,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 640,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 672,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 704,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 736,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 768,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 800,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 832,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 864,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 896,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 928,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 960,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 992,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 1024,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 1056,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 1088,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 1120,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1152,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 1184,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__mq",
     "field_offset" : 1216,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 1248,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "name" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "referenced_type" : "type-1288",
   "self_type" : "type-1288",
   "size" : 160,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc18ppc_thread_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__fpregs",
     "referenced_type" : "type-1290"
    },
    {
     "field_name" : "__fpscr_pad",
     "field_offset" : 2048,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__fpscr",
     "field_offset" : 2080,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_float_state_t",
   "name" : "libunwind::Registers_ppc::ppc_float_state_t",
   "referenced_type" : "type-1289",
   "self_type" : "type-1289",
   "size" : 264,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc17ppc_float_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vec",
     "referenced_type" : "type-1293"
    }
   ],
   "linker_set_key" : "libunwind::v128",
   "name" : "libunwind::v128",
   "referenced_type" : "type-1292",
   "self_type" : "type-1292",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind4v128E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "referenced_type" : "type-1294",
   "self_type" : "type-1294",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1287" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1295",
   "self_type" : "type-1295",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "referenced_type" : "type-1296",
   "self_type" : "type-1296",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1297", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_arm64E13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1298"
    },
    {
     "access" : "private",
     "field_name" : "_vectorHalfRegisters",
     "field_offset" : 2176,
     "referenced_type" : "type-1290"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64",
   "name" : "libunwind::Registers_arm64",
   "record_kind" : "class",
   "referenced_type" : "type-1297",
   "self_type" : "type-1297",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__x",
     "referenced_type" : "type-1299"
    },
    {
     "field_name" : "__fp",
     "field_offset" : 1856,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1920,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 1984,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "padding",
     "field_offset" : 2112,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64::GPRs",
   "name" : "libunwind::Registers_arm64::GPRs",
   "referenced_type" : "type-1298",
   "self_type" : "type-1298",
   "size" : 272,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm644GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "referenced_type" : "type-1300",
   "self_type" : "type-1300",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1297" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1301",
   "self_type" : "type-1301",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "referenced_type" : "type-1302",
   "self_type" : "type-1302",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1303", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_armE13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1304"
    },
    {
     "access" : "private",
     "field_name" : "_use_X_for_vfp_save",
     "field_offset" : 512,
     "referenced_type" : "type-709"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d0_d15",
     "field_offset" : 520,
     "referenced_type" : "type-709"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d16_d31",
     "field_offset" : 528,
     "referenced_type" : "type-709"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d0_d15_pad",
     "field_offset" : 576,
     "referenced_type" : "type-1306"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d16_d31",
     "field_offset" : 1664,
     "referenced_type" : "type-1307"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm",
   "name" : "libunwind::Registers_arm",
   "record_kind" : "class",
   "referenced_type" : "type-1303",
   "self_type" : "type-1303",
   "size" : 336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_armE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-1305"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 416,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 448,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 480,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm::GPRs",
   "name" : "libunwind::Registers_arm::GPRs",
   "referenced_type" : "type-1304",
   "self_type" : "type-1304",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_arm4GPRsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "referenced_type" : "type-1308",
   "self_type" : "type-1308",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1303" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1309",
   "self_type" : "type-1309",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "referenced_type" : "type-1310",
   "self_type" : "type-1310",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1311", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind14Registers_or1kE13unw_context_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1312"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k",
   "name" : "libunwind::Registers_or1k",
   "record_kind" : "class",
   "referenced_type" : "type-1311",
   "self_type" : "type-1311",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1kE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-1313"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "name" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "referenced_type" : "type-1312",
   "self_type" : "type-1312",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1k19or1k_thread_state_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "referenced_type" : "type-1314",
   "self_type" : "type-1314",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1311" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1315",
   "self_type" : "type-1315",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "referenced_type" : "type-1316",
   "self_type" : "type-1316",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1317", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1318"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32",
   "name" : "libunwind::Registers_mips_o32",
   "record_kind" : "class",
   "referenced_type" : "type-1317",
   "self_type" : "type-1317",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o32E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-1313"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 1056,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 1088,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "name" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "referenced_type" : "type-1318",
   "self_type" : "type-1318",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o3223mips_o32_thread_state_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "referenced_type" : "type-1319",
   "self_type" : "type-1319",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1317" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1320",
   "self_type" : "type-1320",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_n64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_n64, unw_context_t>",
   "referenced_type" : "type-1321",
   "self_type" : "type-1321",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1322", "type-1165" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind18Registers_mips_n64E13unw_context_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-1323"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_n64",
   "name" : "libunwind::Registers_mips_n64",
   "record_kind" : "class",
   "referenced_type" : "type-1322",
   "self_type" : "type-1322",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_n64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-1234"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 2112,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 2176,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_n64::mips_n64_thread_state_t",
   "name" : "libunwind::Registers_mips_n64::mips_n64_thread_state_t",
   "referenced_type" : "type-1323",
   "self_type" : "type-1323",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_n6423mips_n64_thread_state_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<libunwind::Registers_mips_n64>",
   "name" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<libunwind::Registers_mips_n64>",
   "referenced_type" : "type-1324",
   "self_type" : "type-1324",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1322" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_n64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_n64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-1325",
   "self_type" : "type-1325",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1165" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_n64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "name" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "referenced_type" : "type-1326",
   "self_type" : "type-1326",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1327", "type-1153" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1329"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-1328"
    },
    {
     "access" : "private",
     "field_name" : "_registers",
     "field_offset" : 64,
     "referenced_type" : "type-1303"
    },
    {
     "access" : "private",
     "field_name" : "_info",
     "field_offset" : 2752,
     "referenced_type" : "type-1175"
    },
    {
     "access" : "private",
     "field_name" : "_unwindInfoMissing",
     "field_offset" : 3072,
     "referenced_type" : "type-709"
    },
    {
     "access" : "private",
     "field_name" : "_isSignalFrame",
     "field_offset" : 3080,
     "referenced_type" : "type-709"
    }
   ],
   "linker_set_key" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "name" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "record_kind" : "class",
   "referenced_type" : "type-1327",
   "self_type" : "type-1327",
   "size" : 392,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-1254", "type-1303" ],
   "unique_id" : "_ZTSN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libunwind::AbstractUnwindCursor",
   "name" : "libunwind::AbstractUnwindCursor",
   "record_kind" : "class",
   "referenced_type" : "type-1329",
   "self_type" : "type-1329",
   "size" : 4,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind20AbstractUnwindCursorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind20AbstractUnwindCursorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "referenced_type" : "type-1330",
   "self_type" : "type-1330",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS4_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "referenced_type" : "type-1331",
   "self_type" : "type-1331",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-1153" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS5_EE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-1335"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-1338"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-1339"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-1341"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-1342"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-1334",
   "self_type" : "type-1334",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTS21_Unwind_Control_Block"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:75:3) at external/libunwind_llvm/include/unwind.h:75:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:75:3) at external/libunwind_llvm/include/unwind.h:75:3",
   "referenced_type" : "type-1338",
   "self_type" : "type-1338",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-1340"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:84:3) at external/libunwind_llvm/include/unwind.h:84:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:84:3) at external/libunwind_llvm/include/unwind.h:84:3",
   "referenced_type" : "type-1339",
   "self_type" : "type-1339",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-1293"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:90:3) at external/libunwind_llvm/include/unwind.h:90:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:90:3) at external/libunwind_llvm/include/unwind.h:90:3",
   "referenced_type" : "type-1341",
   "self_type" : "type-1341",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-663"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:95:3) at external/libunwind_llvm/include/unwind.h:95:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:95:3) at external/libunwind_llvm/include/unwind.h:95:3",
   "referenced_type" : "type-1342",
   "self_type" : "type-1342",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tbase",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "dbase",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "dwarf_eh_bases",
   "name" : "dwarf_eh_bases",
   "referenced_type" : "type-1346",
   "self_type" : "type-1346",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "dwarf_eh_bases"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 64,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "Dl_info",
   "name" : "Dl_info",
   "referenced_type" : "type-1347",
   "self_type" : "type-1347",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/dlfcn.h",
   "unique_id" : "Dl_info"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-1348",
   "self_type" : "type-1348",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_const<unsigned int>",
   "name" : "std::remove_const<unsigned int>",
   "referenced_type" : "type-1361",
   "self_type" : "type-1361",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__112remove_constIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 32,
     "referenced_type" : "type-1375"
    }
   ],
   "linker_set_key" : "dynamic",
   "name" : "dynamic",
   "referenced_type" : "type-1374",
   "self_type" : "type-1374",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS7dynamic"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "name" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "record_kind" : "union",
   "referenced_type" : "type-1375",
   "self_type" : "type-1375",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN7dynamicUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_volatile<unsigned int>",
   "name" : "std::remove_volatile<unsigned int>",
   "referenced_type" : "type-1376",
   "self_type" : "type-1376",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__115remove_volatileIjEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 64,
     "referenced_type" : "type-1378"
    }
   ],
   "linker_set_key" : "Elf64_Dyn",
   "name" : "Elf64_Dyn",
   "referenced_type" : "type-1377",
   "self_type" : "type-1377",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9Elf64_Dyn"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-662"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "name" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "record_kind" : "union",
   "referenced_type" : "type-1378",
   "self_type" : "type-1378",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN9Elf64_DynUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "elf32_rel",
   "name" : "elf32_rel",
   "referenced_type" : "type-1379",
   "self_type" : "type-1379",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_rel"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "elf64_rel",
   "name" : "elf64_rel",
   "referenced_type" : "type-1380",
   "self_type" : "type-1380",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_rel"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "elf32_rela",
   "name" : "elf32_rela",
   "referenced_type" : "type-1381",
   "self_type" : "type-1381",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_rela"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "elf64_rela",
   "name" : "elf64_rela",
   "referenced_type" : "type-1382",
   "self_type" : "type-1382",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_rela"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 96,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 104,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 112,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "elf32_sym",
   "name" : "elf32_sym",
   "referenced_type" : "type-1383",
   "self_type" : "type-1383",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_sym"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 32,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 40,
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 128,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "elf64_sym",
   "name" : "elf64_sym",
   "referenced_type" : "type-1384",
   "self_type" : "type-1384",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_sym"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-847"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 256,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 288,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 320,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 336,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 352,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 368,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 384,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 400,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "elf32_hdr",
   "name" : "elf32_hdr",
   "referenced_type" : "type-1385",
   "self_type" : "type-1385",
   "size" : 52,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_hdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-847"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 256,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 320,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 384,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 416,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 432,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 448,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 464,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 480,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 496,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "elf64_hdr",
   "name" : "elf64_hdr",
   "referenced_type" : "type-1386",
   "self_type" : "type-1386",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "elf32_phdr",
   "name" : "elf32_phdr",
   "referenced_type" : "type-1387",
   "self_type" : "type-1387",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_phdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 128,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 192,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 256,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 320,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 384,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "elf64_phdr",
   "name" : "elf64_phdr",
   "referenced_type" : "type-1388",
   "self_type" : "type-1388",
   "size" : 56,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_phdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 256,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 288,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "elf32_shdr",
   "name" : "elf32_shdr",
   "referenced_type" : "type-1389",
   "self_type" : "type-1389",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_shdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 128,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 192,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 256,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 320,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 352,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 384,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 448,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "elf64_shdr",
   "name" : "elf64_shdr",
   "referenced_type" : "type-1390",
   "self_type" : "type-1390",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_shdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "elf32_note",
   "name" : "elf32_note",
   "referenced_type" : "type-1391",
   "self_type" : "type-1391",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_note"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "elf64_note",
   "name" : "elf64_note",
   "referenced_type" : "type-1392",
   "self_type" : "type-1392",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_note"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 32,
     "referenced_type" : "type-1394"
    }
   ],
   "linker_set_key" : "Elf32_auxv_t",
   "name" : "Elf32_auxv_t",
   "referenced_type" : "type-1393",
   "self_type" : "type-1393",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_auxv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "name" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "record_kind" : "union",
   "referenced_type" : "type-1394",
   "self_type" : "type-1394",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf32_auxv_tUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 64,
     "referenced_type" : "type-1396"
    }
   ],
   "linker_set_key" : "Elf64_auxv_t",
   "name" : "Elf64_auxv_t",
   "referenced_type" : "type-1395",
   "self_type" : "type-1395",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_auxv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-662"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "name" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "record_kind" : "union",
   "referenced_type" : "type-1396",
   "self_type" : "type-1396",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf64_auxv_tUt_E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::remove_cv<unsigned int>",
   "name" : "std::remove_cv<unsigned int>",
   "referenced_type" : "type-1397",
   "self_type" : "type-1397",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__19remove_cvIjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf32_Chdr",
   "name" : "Elf32_Chdr",
   "referenced_type" : "type-1398",
   "self_type" : "type-1398",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Chdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ch_reserved",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 128,
     "referenced_type" : "type-662"
    }
   ],
   "linker_set_key" : "Elf64_Chdr",
   "name" : "Elf64_Chdr",
   "referenced_type" : "type-1399",
   "self_type" : "type-1399",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Chdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf32_Lib",
   "name" : "Elf32_Lib",
   "referenced_type" : "type-1400",
   "self_type" : "type-1400",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf32_Lib"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf64_Lib",
   "name" : "Elf64_Lib",
   "referenced_type" : "type-1401",
   "self_type" : "type-1401",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf64_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 128,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 144,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "Elf32_Move",
   "name" : "Elf32_Move",
   "referenced_type" : "type-1402",
   "self_type" : "type-1402",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Move"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 128,
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 192,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 208,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "Elf64_Move",
   "name" : "Elf64_Move",
   "referenced_type" : "type-1403",
   "self_type" : "type-1403",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "Elf32_Syminfo",
   "name" : "Elf32_Syminfo",
   "referenced_type" : "type-1404",
   "self_type" : "type-1404",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Syminfo"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "Elf64_Syminfo",
   "name" : "Elf64_Syminfo",
   "referenced_type" : "type-1405",
   "self_type" : "type-1405",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Syminfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf32_Verdef",
   "name" : "Elf32_Verdef",
   "referenced_type" : "type-1406",
   "self_type" : "type-1406",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf32_Verdaux",
   "name" : "Elf32_Verdaux",
   "referenced_type" : "type-1407",
   "self_type" : "type-1407",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf64_Verdef",
   "name" : "Elf64_Verdef",
   "referenced_type" : "type-1408",
   "self_type" : "type-1408",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf64_Verdaux",
   "name" : "Elf64_Verdaux",
   "referenced_type" : "type-1409",
   "self_type" : "type-1409",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf32_Verneed",
   "name" : "Elf32_Verneed",
   "referenced_type" : "type-1410",
   "self_type" : "type-1410",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verneed"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf32_Vernaux",
   "name" : "Elf32_Vernaux",
   "referenced_type" : "type-1411",
   "self_type" : "type-1411",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf64_Verneed",
   "name" : "Elf64_Verneed",
   "referenced_type" : "type-1412",
   "self_type" : "type-1412",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verneed"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "Elf64_Vernaux",
   "name" : "Elf64_Vernaux",
   "referenced_type" : "type-1413",
   "self_type" : "type-1413",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlpi_addr",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "dlpi_name",
     "field_offset" : 32,
     "referenced_type" : "type-19"
    },
    {
     "field_name" : "dlpi_phdr",
     "field_offset" : 64,
     "referenced_type" : "type-1415"
    },
    {
     "field_name" : "dlpi_phnum",
     "field_offset" : 96,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "dl_phdr_info",
   "name" : "dl_phdr_info",
   "referenced_type" : "type-1414",
   "self_type" : "type-1414",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "dl_phdr_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_addr",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "l_name",
     "field_offset" : 32,
     "referenced_type" : "type-539"
    },
    {
     "field_name" : "l_ld",
     "field_offset" : 64,
     "referenced_type" : "type-1418"
    },
    {
     "field_name" : "l_next",
     "field_offset" : 96,
     "referenced_type" : "type-1419"
    },
    {
     "field_name" : "l_prev",
     "field_offset" : 128,
     "referenced_type" : "type-1419"
    }
   ],
   "linker_set_key" : "link_map",
   "name" : "link_map",
   "referenced_type" : "type-1417",
   "self_type" : "type-1417",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "link_map"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_version",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "r_map",
     "field_offset" : 32,
     "referenced_type" : "type-1419"
    },
    {
     "field_name" : "r_brk",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "r_state",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "r_ldbase",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "r_debug",
   "name" : "r_debug",
   "referenced_type" : "type-1420",
   "self_type" : "type-1420",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "r_debug"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "addressSpace",
     "referenced_type" : "type-1253"
    },
    {
     "field_name" : "sects",
     "field_offset" : 32,
     "referenced_type" : "type-1424"
    },
    {
     "field_name" : "targetAddr",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "dl_iterate_cb_data",
   "name" : "dl_iterate_cb_data",
   "referenced_type" : "type-1423",
   "self_type" : "type-1423",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSZN9libunwind17LocalAddressSpace18findUnwindSectionsEjRNS_18UnwindInfoSectionsEE18dl_iterate_cb_data"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "commonEncodingsArraySectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "commonEncodingsArrayCount",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "personalityArraySectionOffset",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "personalityArrayCount",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "indexSectionOffset",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "indexCount",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "unwind_info_section_header",
   "name" : "unwind_info_section_header",
   "referenced_type" : "type-1425",
   "self_type" : "type-1425",
   "size" : 28,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS26unwind_info_section_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "secondLevelPagesSectionOffset",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "lsdaIndexArraySectionOffset",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_index_entry",
   "name" : "unwind_info_section_header_index_entry",
   "referenced_type" : "type-1426",
   "self_type" : "type-1426",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_section_header_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "lsdaOffset",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "unwind_info_section_header_lsda_index_entry",
   "name" : "unwind_info_section_header_lsda_index_entry",
   "referenced_type" : "type-1427",
   "self_type" : "type-1427",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS43unwind_info_section_header_lsda_index_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "encoding",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_entry",
   "name" : "unwind_info_regular_second_level_entry",
   "referenced_type" : "type-1428",
   "self_type" : "type-1428",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS38unwind_info_regular_second_level_entry"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "unwind_info_regular_second_level_page_header",
   "name" : "unwind_info_regular_second_level_page_header",
   "referenced_type" : "type-1429",
   "self_type" : "type-1429",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS44unwind_info_regular_second_level_page_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "entryPageOffset",
     "field_offset" : 32,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "entryCount",
     "field_offset" : 48,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "encodingsPageOffset",
     "field_offset" : 64,
     "referenced_type" : "type-77"
    },
    {
     "field_name" : "encodingsCount",
     "field_offset" : 80,
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "unwind_info_compressed_second_level_page_header",
   "name" : "unwind_info_compressed_second_level_page_header",
   "referenced_type" : "type-1430",
   "self_type" : "type-1430",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/mach-o/compact_unwind_encoding.h",
   "unique_id" : "_ZTS47unwind_info_compressed_second_level_page_header"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-1431",
   "self_type" : "type-1431",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-1433"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-1432",
   "self_type" : "type-1432",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-1435"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "type-1436"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-1434",
   "self_type" : "type-1434",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_lock",
     "referenced_type" : "type-1183"
    }
   ],
   "linker_set_key" : "libunwind::RWMutex",
   "name" : "libunwind::RWMutex",
   "record_kind" : "class",
   "referenced_type" : "type-1438",
   "self_type" : "type-1438",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/src/RWMutex.hpp",
   "unique_id" : "_ZTSN9libunwind7RWMutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "libunwind::EHABIIndexEntry",
   "name" : "libunwind::EHABIIndexEntry",
   "referenced_type" : "type-1443",
   "self_type" : "type-1443",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind15EHABIIndexEntryE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-754"
    }
   ],
   "linker_set_key" : "std::is_integral<unsigned int>",
   "name" : "std::is_integral<unsigned int>",
   "referenced_type" : "type-1448",
   "self_type" : "type-1448",
   "size" : 1,
   "source_file" : "/external/libcxx/include/type_traits",
   "template_args" : [ "type-555" ],
   "unique_id" : "_ZTSNSt3__111is_integralIjEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-662"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-1458"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-1460"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-1461"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-1462"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-1463"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-1457",
   "self_type" : "type-1457",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:75:3) at external/libunwind_llvm/include/unwind.h:75:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:75:3) at external/libunwind_llvm/include/unwind.h:75:3",
   "referenced_type" : "type-1460",
   "self_type" : "type-1460",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:75:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-1340"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:84:3) at external/libunwind_llvm/include/unwind.h:84:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:84:3) at external/libunwind_llvm/include/unwind.h:84:3",
   "referenced_type" : "type-1461",
   "self_type" : "type-1461",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:84:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-1293"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:90:3) at external/libunwind_llvm/include/unwind.h:90:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:90:3) at external/libunwind_llvm/include/unwind.h:90:3",
   "referenced_type" : "type-1462",
   "self_type" : "type-1462",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:90:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-663"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:95:3) at external/libunwind_llvm/include/unwind.h:95:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:95:3) at external/libunwind_llvm/include/unwind.h:95:3",
   "referenced_type" : "type-1463",
   "self_type" : "type-1463",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:95:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-876"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-1464",
   "self_type" : "type-1464",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-878"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-1465",
   "self_type" : "type-1465",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-1466",
   "self_type" : "type-1466",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-883"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-1468",
   "self_type" : "type-1468",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-883"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-1469",
   "self_type" : "type-1469",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-886"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-1470",
   "self_type" : "type-1470",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-1471",
   "self_type" : "type-1471",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/inttypes.h",
   "unique_id" : "imaxdiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-1166"
    }
   ],
   "linker_set_key" : "unw_context_t",
   "name" : "unw_context_t",
   "referenced_type" : "type-1472",
   "self_type" : "type-1472",
   "size" : 1024,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_context_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "type-1154"
    }
   ],
   "linker_set_key" : "unw_cursor_t",
   "name" : "unw_cursor_t",
   "referenced_type" : "type-1473",
   "self_type" : "type-1473",
   "size" : 1120,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_cursor_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_ip",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "end_ip",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "lsda",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "handler",
     "field_offset" : 96,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "gp",
     "field_offset" : 128,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "unwind_info_size",
     "field_offset" : 224,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "unwind_info",
     "field_offset" : 256,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "extra",
     "field_offset" : 288,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "unw_proc_info_t",
   "name" : "unw_proc_info_t",
   "referenced_type" : "type-1474",
   "self_type" : "type-1474",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/include/libunwind.h",
   "unique_id" : "unw_proc_info_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sign1",
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "unused",
     "field_offset" : 1,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "sign2",
     "field_offset" : 16,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 17,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "j",
     "field_offset" : 31,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "user_fpregs::fp_reg",
   "name" : "user_fpregs::fp_reg",
   "referenced_type" : "type-1486",
   "self_type" : "type-1486",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_fpregs::fp_reg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "type-1232"
    }
   ],
   "linker_set_key" : "user_regs",
   "name" : "user_regs",
   "referenced_type" : "type-1488",
   "self_type" : "type-1488",
   "size" : 72,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_regs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-1234"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "type-757"
    }
   ],
   "linker_set_key" : "user_vfp",
   "name" : "user_vfp",
   "referenced_type" : "type-1489",
   "self_type" : "type-1489",
   "size" : 264,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_vfp"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "type-757"
    }
   ],
   "linker_set_key" : "user_vfp_exc",
   "name" : "user_vfp_exc",
   "referenced_type" : "type-1490",
   "self_type" : "type-1490",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_vfp_exc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "type-1488"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "type-1492"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "type-1238"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "type-881"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "type-1493"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "type-1494"
    }
   ],
   "linker_set_key" : "user",
   "name" : "user",
   "referenced_type" : "type-1491",
   "self_type" : "type-1491",
   "size" : 296,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "type-1487"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 768,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 800,
     "referenced_type" : "type-555"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "type-1230"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "user_fpregs",
   "name" : "user_fpregs",
   "referenced_type" : "type-1493",
   "self_type" : "type-1493",
   "size" : 116,
   "source_file" : "/bionic/libc/include/sys/user.h",
   "unique_id" : "user_fpregs"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "type-1496"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "type-1497"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "type-1498"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "type-1499"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "type-1245"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "type-1246"
    }
   ],
   "linker_set_key" : "ucontext",
   "name" : "ucontext",
   "referenced_type" : "type-1495",
   "self_type" : "type-1495",
   "size" : 744,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-1497",
   "self_type" : "type-1497",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "type-757"
    }
   ],
   "linker_set_key" : "sigcontext",
   "name" : "sigcontext",
   "referenced_type" : "type-1498",
   "self_type" : "type-1498",
   "size" : 84,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h",
   "unique_id" : "_ZTS10sigcontext"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-1500"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "type-1142"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3) at bionic/libc/include/sys/ucontext.h:90:3",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3) at bionic/libc/include/sys/ucontext.h:90:3",
   "record_kind" : "union",
   "referenced_type" : "type-1499",
   "self_type" : "type-1499",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "type-757"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "type-555"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5) at bionic/libc/include/sys/ucontext.h:91:5",
   "name" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5) at bionic/libc/include/sys/ucontext.h:91:5",
   "referenced_type" : "type-1500",
   "self_type" : "type-1500",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/ucontext.h",
   "unique_id" : "ucontext::(anonymous union at bionic/libc/include/sys/ucontext.h:90:3)::(anonymous struct at bionic/libc/include/sys/ucontext.h:91:5)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-876"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-1503",
   "self_type" : "type-1503",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "type-704"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "tm",
   "name" : "tm",
   "referenced_type" : "type-1505",
   "self_type" : "type-1505",
   "size" : 44,
   "source_file" : "/bionic/libc/include/time.h",
   "unique_id" : "tm"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-1250"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-1506",
   "self_type" : "type-1506",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less<void>",
   "name" : "std::less<void>",
   "referenced_type" : "type-1510",
   "self_type" : "type-1510",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__14lessIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__invoke_void_return_wrapper<void>",
   "name" : "std::__invoke_void_return_wrapper<void>",
   "referenced_type" : "type-1511",
   "self_type" : "type-1511",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__128__invoke_void_return_wrapperIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator_arg_t",
   "name" : "std::allocator_arg_t",
   "referenced_type" : "type-1512",
   "self_type" : "type-1512",
   "size" : 1,
   "source_file" : "/external/libcxx/include/__functional_base",
   "unique_id" : "_ZTSNSt3__115allocator_arg_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "name" : "std::iterator<std::output_iterator_tag, void, void, void, void>",
   "referenced_type" : "type-1514",
   "self_type" : "type-1514",
   "size" : 1,
   "source_file" : "/external/libcxx/include/iterator",
   "template_args" : [ "type-1168", "type-10", "type-10", "type-10", "type-10" ],
   "unique_id" : "_ZTSNSt3__18iteratorINS_19output_iterator_tagEvvvvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::tuple<>",
   "name" : "std::tuple<>",
   "record_kind" : "class",
   "referenced_type" : "type-1515",
   "self_type" : "type-1515",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__15tupleIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__ignore_t<unsigned char>",
   "name" : "std::__ignore_t<unsigned char>",
   "referenced_type" : "type-1518",
   "self_type" : "type-1518",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "template_args" : [ "type-38" ],
   "unique_id" : "_ZTSNSt3__110__ignore_tIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_equal<0>",
   "name" : "std::__tuple_equal<0>",
   "referenced_type" : "type-1520",
   "self_type" : "type-1520",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__113__tuple_equalILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_less<0>",
   "name" : "std::__tuple_less<0>",
   "referenced_type" : "type-1521",
   "self_type" : "type-1521",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__112__tuple_lessILj0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__tuple_cat_return<>",
   "name" : "std::__tuple_cat_return<>",
   "referenced_type" : "type-1522",
   "self_type" : "type-1522",
   "size" : 1,
   "source_file" : "/external/libcxx/include/tuple",
   "unique_id" : "_ZTSNSt3__118__tuple_cat_returnIJEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "referenced_type" : "type-19"
    }
   ],
   "linker_set_key" : "std::__libcpp_refstring",
   "name" : "std::__libcpp_refstring",
   "record_kind" : "class",
   "referenced_type" : "type-1523",
   "self_type" : "type-1523",
   "size" : 4,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSNSt3__118__libcpp_refstringE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-907"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 32,
     "referenced_type" : "type-1523"
    }
   ],
   "linker_set_key" : "std::logic_error",
   "name" : "std::logic_error",
   "record_kind" : "class",
   "referenced_type" : "type-1526",
   "self_type" : "type-1526",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11logic_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11logic_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11logic_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-907"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__imp_",
     "field_offset" : 32,
     "referenced_type" : "type-1523"
    }
   ],
   "linker_set_key" : "std::runtime_error",
   "name" : "std::runtime_error",
   "record_kind" : "class",
   "referenced_type" : "type-1527",
   "self_type" : "type-1527",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt13runtime_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt13runtime_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt13runtime_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1526"
    }
   ],
   "linker_set_key" : "std::domain_error",
   "name" : "std::domain_error",
   "record_kind" : "class",
   "referenced_type" : "type-1528",
   "self_type" : "type-1528",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12domain_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12domain_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12domain_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1526"
    }
   ],
   "linker_set_key" : "std::invalid_argument",
   "name" : "std::invalid_argument",
   "record_kind" : "class",
   "referenced_type" : "type-1533",
   "self_type" : "type-1533",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt16invalid_argument",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt16invalid_argument"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt16invalid_argumentD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1526"
    }
   ],
   "linker_set_key" : "std::length_error",
   "name" : "std::length_error",
   "record_kind" : "class",
   "referenced_type" : "type-1535",
   "self_type" : "type-1535",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12length_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12length_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12length_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1526"
    }
   ],
   "linker_set_key" : "std::out_of_range",
   "name" : "std::out_of_range",
   "record_kind" : "class",
   "referenced_type" : "type-1537",
   "self_type" : "type-1537",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt12out_of_range",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt12out_of_range"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt12out_of_rangeD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt11logic_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1527"
    }
   ],
   "linker_set_key" : "std::range_error",
   "name" : "std::range_error",
   "record_kind" : "class",
   "referenced_type" : "type-1539",
   "self_type" : "type-1539",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt11range_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt11range_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt11range_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1527"
    }
   ],
   "linker_set_key" : "std::overflow_error",
   "name" : "std::overflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1541",
   "self_type" : "type-1541",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt14overflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt14overflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt14overflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1527"
    }
   ],
   "linker_set_key" : "std::underflow_error",
   "name" : "std::underflow_error",
   "record_kind" : "class",
   "referenced_type" : "type-1543",
   "self_type" : "type-1543",
   "size" : 8,
   "source_file" : "/external/libcxx/include/stdexcept",
   "unique_id" : "_ZTSSt15underflow_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTISt15underflow_error"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt15underflow_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "type-1552"
    }
   ],
   "linker_set_key" : "std::atomic_flag",
   "name" : "std::atomic_flag",
   "referenced_type" : "type-1551",
   "self_type" : "type-1551",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic",
   "unique_id" : "_ZTSNSt3__111atomic_flagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<void>",
   "name" : "std::allocator<void>",
   "record_kind" : "class",
   "referenced_type" : "type-1558",
   "self_type" : "type-1558",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__19allocatorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<const void>",
   "name" : "std::allocator<const void>",
   "record_kind" : "class",
   "referenced_type" : "type-1559",
   "self_type" : "type-1559",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-654" ],
   "unique_id" : "_ZTSNSt3__19allocatorIKvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__second_tag",
   "name" : "std::__second_tag",
   "referenced_type" : "type-1560",
   "self_type" : "type-1560",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__second_tagE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "type-555"
    }
   ],
   "linker_set_key" : "std::__destruct_n",
   "name" : "std::__destruct_n",
   "referenced_type" : "type-1561",
   "self_type" : "type-1561",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112__destruct_nE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-907"
    }
   ],
   "linker_set_key" : "std::bad_weak_ptr",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "referenced_type" : "type-1564",
   "self_type" : "type-1564",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__112bad_weak_ptrE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 32,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "std::__shared_count",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "referenced_type" : "type-1565",
   "self_type" : "type-1565",
   "size" : 8,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114__shared_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-1565"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__shared_weak_owners_",
     "field_offset" : 64,
     "referenced_type" : "type-704"
    }
   ],
   "linker_set_key" : "std::__shared_weak_count",
   "name" : "std::__shared_weak_count",
   "record_kind" : "class",
   "referenced_type" : "type-1569",
   "self_type" : "type-1569",
   "size" : 12,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__119__shared_weak_countE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__119__shared_weak_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__119__shared_weak_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__119__shared_weak_count13__get_deleterERKSt9type_info"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__119__shared_weak_count21__on_zero_shared_weakEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "name" : "std::allocator<std::__shared_ptr_dummy_rebind_allocator_type>",
   "record_kind" : "class",
   "referenced_type" : "type-1573",
   "self_type" : "type-1573",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-1574" ],
   "unique_id" : "_ZTSNSt3__19allocatorINS_40__shared_ptr_dummy_rebind_allocator_typeEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::owner_less<void>",
   "name" : "std::owner_less<void>",
   "referenced_type" : "type-1575",
   "self_type" : "type-1575",
   "size" : 1,
   "source_file" : "/external/libcxx/include/memory",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110owner_lessIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__lx",
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "std::__sp_mut",
   "name" : "std::__sp_mut",
   "record_kind" : "class",
   "referenced_type" : "type-1576",
   "self_type" : "type-1576",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__18__sp_mutE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__v_",
     "referenced_type" : "type-1578"
    }
   ],
   "linker_set_key" : "std::pointer_safety",
   "name" : "std::pointer_safety",
   "referenced_type" : "type-1577",
   "self_type" : "type-1577",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory",
   "unique_id" : "_ZTSNSt3__114pointer_safetyE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::plus<void>",
   "name" : "std::plus<void>",
   "referenced_type" : "type-1582",
   "self_type" : "type-1582",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__14plusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::minus<void>",
   "name" : "std::minus<void>",
   "referenced_type" : "type-1583",
   "self_type" : "type-1583",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__15minusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::multiplies<void>",
   "name" : "std::multiplies<void>",
   "referenced_type" : "type-1584",
   "self_type" : "type-1584",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110multipliesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::divides<void>",
   "name" : "std::divides<void>",
   "referenced_type" : "type-1585",
   "self_type" : "type-1585",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17dividesIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::modulus<void>",
   "name" : "std::modulus<void>",
   "referenced_type" : "type-1586",
   "self_type" : "type-1586",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17modulusIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::negate<void>",
   "name" : "std::negate<void>",
   "referenced_type" : "type-1587",
   "self_type" : "type-1587",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__16negateIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::equal_to<void>",
   "name" : "std::equal_to<void>",
   "referenced_type" : "type-1588",
   "self_type" : "type-1588",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__18equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::not_equal_to<void>",
   "name" : "std::not_equal_to<void>",
   "referenced_type" : "type-1589",
   "self_type" : "type-1589",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__112not_equal_toIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater<void>",
   "name" : "std::greater<void>",
   "referenced_type" : "type-1590",
   "self_type" : "type-1590",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17greaterIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::greater_equal<void>",
   "name" : "std::greater_equal<void>",
   "referenced_type" : "type-1591",
   "self_type" : "type-1591",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__113greater_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::less_equal<void>",
   "name" : "std::less_equal<void>",
   "referenced_type" : "type-1592",
   "self_type" : "type-1592",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110less_equalIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_and<void>",
   "name" : "std::logical_and<void>",
   "referenced_type" : "type-1593",
   "self_type" : "type-1593",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__111logical_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_or<void>",
   "name" : "std::logical_or<void>",
   "referenced_type" : "type-1594",
   "self_type" : "type-1594",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__110logical_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::logical_not<void>",
   "name" : "std::logical_not<void>",
   "referenced_type" : "type-1595",
   "self_type" : "type-1595",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__111logical_notIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_and<void>",
   "name" : "std::bit_and<void>",
   "referenced_type" : "type-1596",
   "self_type" : "type-1596",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17bit_andIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_or<void>",
   "name" : "std::bit_or<void>",
   "referenced_type" : "type-1597",
   "self_type" : "type-1597",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__16bit_orIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_xor<void>",
   "name" : "std::bit_xor<void>",
   "referenced_type" : "type-1598",
   "self_type" : "type-1598",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17bit_xorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::bit_not<void>",
   "name" : "std::bit_not<void>",
   "referenced_type" : "type-1599",
   "self_type" : "type-1599",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "template_args" : [ "type-10" ],
   "unique_id" : "_ZTSNSt3__17bit_notIvEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-907"
    }
   ],
   "linker_set_key" : "std::bad_function_call",
   "name" : "std::bad_function_call",
   "record_kind" : "class",
   "referenced_type" : "type-1600",
   "self_type" : "type-1600",
   "size" : 4,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__117bad_function_callE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__117bad_function_callE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__117bad_function_callD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt9exception4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<1>",
   "name" : "std::placeholders::__ph<1>",
   "referenced_type" : "type-1601",
   "self_type" : "type-1601",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<2>",
   "name" : "std::placeholders::__ph<2>",
   "referenced_type" : "type-1602",
   "self_type" : "type-1602",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi2EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<3>",
   "name" : "std::placeholders::__ph<3>",
   "referenced_type" : "type-1603",
   "self_type" : "type-1603",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi3EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<4>",
   "name" : "std::placeholders::__ph<4>",
   "referenced_type" : "type-1604",
   "self_type" : "type-1604",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi4EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<5>",
   "name" : "std::placeholders::__ph<5>",
   "referenced_type" : "type-1605",
   "self_type" : "type-1605",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi5EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<6>",
   "name" : "std::placeholders::__ph<6>",
   "referenced_type" : "type-1606",
   "self_type" : "type-1606",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi6EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<7>",
   "name" : "std::placeholders::__ph<7>",
   "referenced_type" : "type-1607",
   "self_type" : "type-1607",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi7EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<8>",
   "name" : "std::placeholders::__ph<8>",
   "referenced_type" : "type-1608",
   "self_type" : "type-1608",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi8EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<9>",
   "name" : "std::placeholders::__ph<9>",
   "referenced_type" : "type-1609",
   "self_type" : "type-1609",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi9EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::placeholders::__ph<10>",
   "name" : "std::placeholders::__ph<10>",
   "referenced_type" : "type-1610",
   "self_type" : "type-1610",
   "size" : 1,
   "source_file" : "/external/libcxx/include/functional",
   "unique_id" : "_ZTSNSt3__112placeholders4__phILi10EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__p_",
     "referenced_type" : "type-1628"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<int>",
   "name" : "std::uniform_int_distribution<int>",
   "record_kind" : "class",
   "referenced_type" : "type-1627",
   "self_type" : "type-1627",
   "size" : 8,
   "source_file" : "/external/libcxx/include/algorithm",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__a_",
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "__b_",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "std::uniform_int_distribution<int>::param_type",
   "name" : "std::uniform_int_distribution<int>::param_type",
   "record_kind" : "class",
   "referenced_type" : "type-1628",
   "self_type" : "type-1628",
   "size" : 8,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__124uniform_int_distributionIiE10param_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "std::__return_temporary_buffer",
   "name" : "std::__return_temporary_buffer",
   "referenced_type" : "type-1629",
   "self_type" : "type-1629",
   "size" : 1,
   "source_file" : "/external/libcxx/include/algorithm",
   "unique_id" : "_ZTSNSt3__125__return_temporary_bufferE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<>",
   "name" : "skstd::index_sequence<>",
   "referenced_type" : "type-1630",
   "self_type" : "type-1630",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "skstd::index_sequence<0>",
   "name" : "skstd::index_sequence<0>",
   "referenced_type" : "type-1631",
   "self_type" : "type-1631",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd14index_sequenceIJLj0EEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1630"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<0>",
   "name" : "skstd::make_index_sequence<0>",
   "referenced_type" : "type-1632",
   "self_type" : "type-1632",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILj0EEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1631"
    }
   ],
   "linker_set_key" : "skstd::make_index_sequence<1>",
   "name" : "skstd::make_index_sequence<1>",
   "referenced_type" : "type-1633",
   "self_type" : "type-1633",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTLogic.h",
   "unique_id" : "_ZTSN5skstd19make_index_sequenceILj1EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "name" : "sktfitsin::Private::SkTMux<true, true, sktfitsin::Private::SkTFitsIn_Signed2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Signed2Unsigned<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Signed<short, int>, sktfitsin::Private::SkTFitsIn_Unsigned2Unsiged<short, int> >",
   "referenced_type" : "type-1634",
   "self_type" : "type-1634",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-690", "type-1635", "type-1636", "type-1637" ],
   "unique_id" : "_ZTSN9sktfitsin7Private6SkTMuxILb1ELb1ENS0_23SkTFitsIn_Signed2SignedIsiEENS0_25SkTFitsIn_Signed2UnsignedIsiEENS0_25SkTFitsIn_Unsigned2SignedIsiEENS0_26SkTFitsIn_Unsigned2UnsigedIsiEEEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-721"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<short, int>",
   "referenced_type" : "type-1638",
   "self_type" : "type-1638",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIsiEE"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-719"
    }
   ],
   "linker_set_key" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "name" : "sktfitsin::Private::SkTHasMoreDigits<int, short>",
   "referenced_type" : "type-1639",
   "self_type" : "type-1639",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-13", "type-78" ],
   "unique_id" : "_ZTSN9sktfitsin7Private16SkTHasMoreDigitsIisEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "name" : "sktfitsin::Private::SkTFitsIn<short, int>",
   "referenced_type" : "type-1640",
   "self_type" : "type-1640",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78", "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private9SkTFitsInIsiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<int, false>",
   "name" : "sktfitsin::Private::underlying_type<int, false>",
   "referenced_type" : "type-1641",
   "self_type" : "type-1641",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-13" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIiLb0EEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "sktfitsin::Private::underlying_type<short, false>",
   "name" : "sktfitsin::Private::underlying_type<short, false>",
   "referenced_type" : "type-1642",
   "self_type" : "type-1642",
   "size" : 1,
   "source_file" : "/external/skia/include/private/SkTFitsIn.h",
   "template_args" : [ "type-78" ],
   "unique_id" : "_ZTSN9sktfitsin7Private15underlying_typeIsLb0EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fFloat",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fSignBitInt",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "SkFloatIntUnion",
   "name" : "SkFloatIntUnion",
   "record_kind" : "union",
   "referenced_type" : "type-1651",
   "self_type" : "type-1651",
   "size" : 4,
   "source_file" : "/external/skia/include/private/SkFloatBits.h",
   "unique_id" : "_ZTS15SkFloatIntUnion"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1653"
    }
   ],
   "linker_set_key" : "int8x8x2_t",
   "name" : "int8x8x2_t",
   "referenced_type" : "type-1652",
   "self_type" : "type-1652",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1656"
    }
   ],
   "linker_set_key" : "int8x16x2_t",
   "name" : "int8x16x2_t",
   "referenced_type" : "type-1655",
   "self_type" : "type-1655",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1659"
    }
   ],
   "linker_set_key" : "int16x4x2_t",
   "name" : "int16x4x2_t",
   "referenced_type" : "type-1658",
   "self_type" : "type-1658",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1662"
    }
   ],
   "linker_set_key" : "int16x8x2_t",
   "name" : "int16x8x2_t",
   "referenced_type" : "type-1661",
   "self_type" : "type-1661",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1665"
    }
   ],
   "linker_set_key" : "int32x2x2_t",
   "name" : "int32x2x2_t",
   "referenced_type" : "type-1664",
   "self_type" : "type-1664",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1668"
    }
   ],
   "linker_set_key" : "int32x4x2_t",
   "name" : "int32x4x2_t",
   "referenced_type" : "type-1667",
   "self_type" : "type-1667",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1671"
    }
   ],
   "linker_set_key" : "int64x1x2_t",
   "name" : "int64x1x2_t",
   "referenced_type" : "type-1670",
   "self_type" : "type-1670",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1674"
    }
   ],
   "linker_set_key" : "int64x2x2_t",
   "name" : "int64x2x2_t",
   "referenced_type" : "type-1673",
   "self_type" : "type-1673",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1677"
    }
   ],
   "linker_set_key" : "uint8x8x2_t",
   "name" : "uint8x8x2_t",
   "referenced_type" : "type-1676",
   "self_type" : "type-1676",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11uint8x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1680"
    }
   ],
   "linker_set_key" : "uint8x16x2_t",
   "name" : "uint8x16x2_t",
   "referenced_type" : "type-1679",
   "self_type" : "type-1679",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint8x16x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1683"
    }
   ],
   "linker_set_key" : "uint16x4x2_t",
   "name" : "uint16x4x2_t",
   "referenced_type" : "type-1682",
   "self_type" : "type-1682",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1686"
    }
   ],
   "linker_set_key" : "uint16x8x2_t",
   "name" : "uint16x8x2_t",
   "referenced_type" : "type-1685",
   "self_type" : "type-1685",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1689"
    }
   ],
   "linker_set_key" : "uint32x2x2_t",
   "name" : "uint32x2x2_t",
   "referenced_type" : "type-1688",
   "self_type" : "type-1688",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1692"
    }
   ],
   "linker_set_key" : "uint32x4x2_t",
   "name" : "uint32x4x2_t",
   "referenced_type" : "type-1691",
   "self_type" : "type-1691",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1695"
    }
   ],
   "linker_set_key" : "uint64x1x2_t",
   "name" : "uint64x1x2_t",
   "referenced_type" : "type-1694",
   "self_type" : "type-1694",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x1x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1698"
    }
   ],
   "linker_set_key" : "uint64x2x2_t",
   "name" : "uint64x2x2_t",
   "referenced_type" : "type-1697",
   "self_type" : "type-1697",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x2x2_t"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jclass"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1701"
    }
   ],
   "linker_set_key" : "float16x4x2_t",
   "name" : "float16x4x2_t",
   "referenced_type" : "type-1700",
   "self_type" : "type-1700",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1704"
    }
   ],
   "linker_set_key" : "float16x8x2_t",
   "name" : "float16x8x2_t",
   "referenced_type" : "type-1703",
   "self_type" : "type-1703",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1707"
    }
   ],
   "linker_set_key" : "float32x2x2_t",
   "name" : "float32x2x2_t",
   "referenced_type" : "type-1706",
   "self_type" : "type-1706",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1710"
    }
   ],
   "linker_set_key" : "float32x4x2_t",
   "name" : "float32x4x2_t",
   "referenced_type" : "type-1709",
   "self_type" : "type-1709",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1713"
    }
   ],
   "linker_set_key" : "poly8x8x2_t",
   "name" : "poly8x8x2_t",
   "referenced_type" : "type-1712",
   "self_type" : "type-1712",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1716"
    }
   ],
   "linker_set_key" : "poly8x16x2_t",
   "name" : "poly8x16x2_t",
   "referenced_type" : "type-1715",
   "self_type" : "type-1715",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1719"
    }
   ],
   "linker_set_key" : "poly16x4x2_t",
   "name" : "poly16x4x2_t",
   "referenced_type" : "type-1718",
   "self_type" : "type-1718",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x2_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1722"
    }
   ],
   "linker_set_key" : "poly16x8x2_t",
   "name" : "poly16x8x2_t",
   "referenced_type" : "type-1721",
   "self_type" : "type-1721",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x2_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1725"
    }
   ],
   "linker_set_key" : "int8x8x3_t",
   "name" : "int8x8x3_t",
   "referenced_type" : "type-1724",
   "self_type" : "type-1724",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1728"
    }
   ],
   "linker_set_key" : "int8x16x3_t",
   "name" : "int8x16x3_t",
   "referenced_type" : "type-1727",
   "self_type" : "type-1727",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1731"
    }
   ],
   "linker_set_key" : "int16x4x3_t",
   "name" : "int16x4x3_t",
   "referenced_type" : "type-1730",
   "self_type" : "type-1730",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1734"
    }
   ],
   "linker_set_key" : "int16x8x3_t",
   "name" : "int16x8x3_t",
   "referenced_type" : "type-1733",
   "self_type" : "type-1733",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1737"
    }
   ],
   "linker_set_key" : "int32x2x3_t",
   "name" : "int32x2x3_t",
   "referenced_type" : "type-1736",
   "self_type" : "type-1736",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1740"
    }
   ],
   "linker_set_key" : "int32x4x3_t",
   "name" : "int32x4x3_t",
   "referenced_type" : "type-1739",
   "self_type" : "type-1739",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1743"
    }
   ],
   "linker_set_key" : "int64x1x3_t",
   "name" : "int64x1x3_t",
   "referenced_type" : "type-1742",
   "self_type" : "type-1742",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1746"
    }
   ],
   "linker_set_key" : "int64x2x3_t",
   "name" : "int64x2x3_t",
   "referenced_type" : "type-1745",
   "self_type" : "type-1745",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1749"
    }
   ],
   "linker_set_key" : "uint8x8x3_t",
   "name" : "uint8x8x3_t",
   "referenced_type" : "type-1748",
   "self_type" : "type-1748",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11uint8x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1752"
    }
   ],
   "linker_set_key" : "uint8x16x3_t",
   "name" : "uint8x16x3_t",
   "referenced_type" : "type-1751",
   "self_type" : "type-1751",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint8x16x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1755"
    }
   ],
   "linker_set_key" : "uint16x4x3_t",
   "name" : "uint16x4x3_t",
   "referenced_type" : "type-1754",
   "self_type" : "type-1754",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1758"
    }
   ],
   "linker_set_key" : "uint16x8x3_t",
   "name" : "uint16x8x3_t",
   "referenced_type" : "type-1757",
   "self_type" : "type-1757",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1761"
    }
   ],
   "linker_set_key" : "uint32x2x3_t",
   "name" : "uint32x2x3_t",
   "referenced_type" : "type-1760",
   "self_type" : "type-1760",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1764"
    }
   ],
   "linker_set_key" : "uint32x4x3_t",
   "name" : "uint32x4x3_t",
   "referenced_type" : "type-1763",
   "self_type" : "type-1763",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1767"
    }
   ],
   "linker_set_key" : "uint64x1x3_t",
   "name" : "uint64x1x3_t",
   "referenced_type" : "type-1766",
   "self_type" : "type-1766",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x1x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1770"
    }
   ],
   "linker_set_key" : "uint64x2x3_t",
   "name" : "uint64x2x3_t",
   "referenced_type" : "type-1769",
   "self_type" : "type-1769",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x2x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1773"
    }
   ],
   "linker_set_key" : "float16x4x3_t",
   "name" : "float16x4x3_t",
   "referenced_type" : "type-1772",
   "self_type" : "type-1772",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1776"
    }
   ],
   "linker_set_key" : "float16x8x3_t",
   "name" : "float16x8x3_t",
   "referenced_type" : "type-1775",
   "self_type" : "type-1775",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1779"
    }
   ],
   "linker_set_key" : "float32x2x3_t",
   "name" : "float32x2x3_t",
   "referenced_type" : "type-1778",
   "self_type" : "type-1778",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1782"
    }
   ],
   "linker_set_key" : "float32x4x3_t",
   "name" : "float32x4x3_t",
   "referenced_type" : "type-1781",
   "self_type" : "type-1781",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1785"
    }
   ],
   "linker_set_key" : "poly8x8x3_t",
   "name" : "poly8x8x3_t",
   "referenced_type" : "type-1784",
   "self_type" : "type-1784",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1788"
    }
   ],
   "linker_set_key" : "poly8x16x3_t",
   "name" : "poly8x16x3_t",
   "referenced_type" : "type-1787",
   "self_type" : "type-1787",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1791"
    }
   ],
   "linker_set_key" : "poly16x4x3_t",
   "name" : "poly16x4x3_t",
   "referenced_type" : "type-1790",
   "self_type" : "type-1790",
   "size" : 24,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x3_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1794"
    }
   ],
   "linker_set_key" : "poly16x8x3_t",
   "name" : "poly16x8x3_t",
   "referenced_type" : "type-1793",
   "self_type" : "type-1793",
   "size" : 48,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x3_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1797"
    }
   ],
   "linker_set_key" : "int8x8x4_t",
   "name" : "int8x8x4_t",
   "referenced_type" : "type-1796",
   "self_type" : "type-1796",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS10int8x8x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1800"
    }
   ],
   "linker_set_key" : "int8x16x4_t",
   "name" : "int8x16x4_t",
   "referenced_type" : "type-1799",
   "self_type" : "type-1799",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int8x16x4_t"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "type-18",
   "self_type" : "type-18",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jobject"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1803"
    }
   ],
   "linker_set_key" : "int16x4x4_t",
   "name" : "int16x4x4_t",
   "referenced_type" : "type-1802",
   "self_type" : "type-1802",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1806"
    }
   ],
   "linker_set_key" : "int16x8x4_t",
   "name" : "int16x8x4_t",
   "referenced_type" : "type-1805",
   "self_type" : "type-1805",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1809"
    }
   ],
   "linker_set_key" : "int32x2x4_t",
   "name" : "int32x2x4_t",
   "referenced_type" : "type-1808",
   "self_type" : "type-1808",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1812"
    }
   ],
   "linker_set_key" : "int32x4x4_t",
   "name" : "int32x4x4_t",
   "referenced_type" : "type-1811",
   "self_type" : "type-1811",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1815"
    }
   ],
   "linker_set_key" : "int64x1x4_t",
   "name" : "int64x1x4_t",
   "referenced_type" : "type-1814",
   "self_type" : "type-1814",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1818"
    }
   ],
   "linker_set_key" : "int64x2x4_t",
   "name" : "int64x2x4_t",
   "referenced_type" : "type-1817",
   "self_type" : "type-1817",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11int64x2x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1821"
    }
   ],
   "linker_set_key" : "uint8x8x4_t",
   "name" : "uint8x8x4_t",
   "referenced_type" : "type-1820",
   "self_type" : "type-1820",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11uint8x8x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1824"
    }
   ],
   "linker_set_key" : "uint8x16x4_t",
   "name" : "uint8x16x4_t",
   "referenced_type" : "type-1823",
   "self_type" : "type-1823",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint8x16x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1827"
    }
   ],
   "linker_set_key" : "uint16x4x4_t",
   "name" : "uint16x4x4_t",
   "referenced_type" : "type-1826",
   "self_type" : "type-1826",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1830"
    }
   ],
   "linker_set_key" : "uint16x8x4_t",
   "name" : "uint16x8x4_t",
   "referenced_type" : "type-1829",
   "self_type" : "type-1829",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1833"
    }
   ],
   "linker_set_key" : "uint32x2x4_t",
   "name" : "uint32x2x4_t",
   "referenced_type" : "type-1832",
   "self_type" : "type-1832",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1836"
    }
   ],
   "linker_set_key" : "uint32x4x4_t",
   "name" : "uint32x4x4_t",
   "referenced_type" : "type-1835",
   "self_type" : "type-1835",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1839"
    }
   ],
   "linker_set_key" : "uint64x1x4_t",
   "name" : "uint64x1x4_t",
   "referenced_type" : "type-1838",
   "self_type" : "type-1838",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x1x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1842"
    }
   ],
   "linker_set_key" : "uint64x2x4_t",
   "name" : "uint64x2x4_t",
   "referenced_type" : "type-1841",
   "self_type" : "type-1841",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12uint64x2x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1845"
    }
   ],
   "linker_set_key" : "float16x4x4_t",
   "name" : "float16x4x4_t",
   "referenced_type" : "type-1844",
   "self_type" : "type-1844",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1848"
    }
   ],
   "linker_set_key" : "float16x8x4_t",
   "name" : "float16x8x4_t",
   "referenced_type" : "type-1847",
   "self_type" : "type-1847",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float16x8x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1851"
    }
   ],
   "linker_set_key" : "float32x2x4_t",
   "name" : "float32x2x4_t",
   "referenced_type" : "type-1850",
   "self_type" : "type-1850",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x2x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1854"
    }
   ],
   "linker_set_key" : "float32x4x4_t",
   "name" : "float32x4x4_t",
   "referenced_type" : "type-1853",
   "self_type" : "type-1853",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS13float32x4x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1857"
    }
   ],
   "linker_set_key" : "poly8x8x4_t",
   "name" : "poly8x8x4_t",
   "referenced_type" : "type-1856",
   "self_type" : "type-1856",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS11poly8x8x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1860"
    }
   ],
   "linker_set_key" : "poly8x16x4_t",
   "name" : "poly8x16x4_t",
   "referenced_type" : "type-1859",
   "self_type" : "type-1859",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly8x16x4_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1863"
    }
   ],
   "linker_set_key" : "poly16x4x4_t",
   "name" : "poly16x4x4_t",
   "referenced_type" : "type-1862",
   "self_type" : "type-1862",
   "size" : 32,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x4x4_t"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-1866"
    }
   ],
   "linker_set_key" : "poly16x8x4_t",
   "name" : "poly16x8x4_t",
   "referenced_type" : "type-1865",
   "self_type" : "type-1865",
   "size" : 64,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/8.0.5/include/arm_neon.h",
   "unique_id" : "_ZTS12poly16x8x4_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "SkColor4f",
   "name" : "SkColor4f",
   "referenced_type" : "type-1869",
   "self_type" : "type-1869",
   "size" : 16,
   "source_file" : "/external/skia/include/core/SkColor.h",
   "unique_id" : "_ZTS9SkColor4f"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-78"
    },
    {
     "field_name" : "fY",
     "field_offset" : 16,
     "referenced_type" : "type-78"
    }
   ],
   "linker_set_key" : "SkIPoint16",
   "name" : "SkIPoint16",
   "referenced_type" : "type-1874",
   "self_type" : "type-1874",
   "size" : 4,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS10SkIPoint16"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "SkIPoint",
   "name" : "SkIPoint",
   "referenced_type" : "type-1878",
   "self_type" : "type-1878",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkPoint.h",
   "unique_id" : "_ZTS8SkIPoint"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "type-13"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "SkISize",
   "name" : "SkISize",
   "referenced_type" : "type-1885",
   "self_type" : "type-1885",
   "size" : 8,
   "source_file" : "/external/skia/include/core/SkSize.h",
   "unique_id" : "_ZTS7SkISize"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "type-367",
   "self_type" : "type-367",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jstring"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "type-386",
   "self_type" : "type-386",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jarray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "type-390",
   "self_type" : "type-390",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jobjectArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "type-398",
   "self_type" : "type-398",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14_jbooleanArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "type-402",
   "self_type" : "type-402",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jbyteArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "type-406",
   "self_type" : "type-406",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jcharArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "type-410",
   "self_type" : "type-410",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jshortArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "type-414",
   "self_type" : "type-414",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS10_jintArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "type-418",
   "self_type" : "type-418",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jlongArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jfloatArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-386"
    }
   ],
   "linker_set_key" : "_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "type-426",
   "self_type" : "type-426",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jdoubleArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-18"
    }
   ],
   "linker_set_key" : "_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jthrowable"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
