{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA10_c",
   "name" : "char [10]",
   "referenced_type" : "type-154",
   "self_type" : "type-155",
   "size" : 10,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_modf.c"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA10_d",
   "name" : "double [10]",
   "referenced_type" : "type-4",
   "self_type" : "type-192",
   "size" : 80,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "type-1",
   "self_type" : "type-2",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA11_d",
   "name" : "double [11]",
   "referenced_type" : "type-4",
   "self_type" : "type-184",
   "size" : 88,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_atan.c"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA128_N12pow_log_dataUt_E",
   "name" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3) [128]",
   "referenced_type" : "type-199",
   "self_type" : "type-198",
   "size" : 4096,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA128_N8log_dataUt_E",

   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_rem_pio2.c"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIA_Kj",
   "name" : "unsigned int const[]",
   "referenced_type" : "type-204",
   "self_type" : "type-205",
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10exp2f_data",
   "name" : "const exp2f_data",
   "referenced_type" : "type-187",
   "self_type" : "type-206",
   "size" : 328,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10log2f_data",
   "name" : "const log2f_data",
   "referenced_type" : "type-170",
   "self_type" : "type-174",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12pow_log_data",
   "name" : "const pow_log_data",
   "referenced_type" : "type-196",
   "self_type" : "type-200",
   "size" : 4168,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14powf_log2_data",
   "name" : "const powf_log2_data",
   "referenced_type" : "type-175",
   "self_type" : "type-179",
   "size" : 296,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8exp_data",
   "name" : "const exp_data",
   "referenced_type" : "type-180",
   "self_type" : "type-182",
   "size" : 2160,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK8log_data",
   "name" : "const log_data",
   "referenced_type" : "type-183",
   "self_type" : "type-189",
   "size" : 4240,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9log2_data",
   "name" : "const log2_data",
   "referenced_type" : "type-190",
   "self_type" : "type-195",
   "size" : 2192,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9logf_data",
   "name" : "const logf_data",
   "referenced_type" : "type-168",
   "self_type" : "type-167",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "type-154",
   "self_type" : "type-157",
   "size" : 1,
   "source_file" : "/bionic/libc/include/math.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "type-4",
   "self_type" : "type-25",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/bsdsrc/b_exp.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "type-10",
   "self_type" : "type-162",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-netbsd/lib/libm/complex/cephes_subrl.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "type-8",
   "self_type" : "type-56",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrigf.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "type-12",
   "self_type" : "type-102",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/k_exp.c"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVKd",
   "name" : "const volatile double",
   "referenced_type" : "type-4",
   "self_type" : "type-53",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrig.c"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVKf",
   "name" : "const volatile float",
   "referenced_type" : "type-8",
   "self_type" : "type-54",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/catrig.c"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVd",
   "name" : "volatile double",
   "referenced_type" : "type-4",
   "self_type" : "type-3",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_acos.c"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVf",
   "name" : "volatile float",
   "referenced_type" : "type-8",
   "self_type" : "type-7",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/e_acosf.c"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-244"
    }
   ],
   "linker_set_key" : "_ZTI10IEEEd2bits",
   "name" : "IEEEd2bits",
   "record_kind" : "union",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "bits",
     "referenced_type" : "type-242"
    }
   ],
   "linker_set_key" : "_ZTI10IEEEf2bits",
   "name" : "IEEEf2bits",
   "record_kind" : "union",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-188"
    },
    {
     "field_name" : "shift_scaled",
     "field_offset" : 2048,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-169"
    },
    {
     "field_name" : "shift",
     "field_offset" : 2304,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "invln2_scaled",
     "field_offset" : 2368,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly_scaled",
     "field_offset" : 2432,
     "referenced_type" : "type-169"
    }
   ],
   "linker_set_key" : "_ZTI10exp2f_data",
   "name" : "exp2f_data",
   "referenced_type" : "type-187",
   "self_type" : "type-187",
   "size" : 328,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-171"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-173"
    }
   ],
   "linker_set_key" : "_ZTI10log2f_data",
   "name" : "log2f_data",
   "referenced_type" : "type-170",
   "self_type" : "type-170",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-152"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.7/include/__stddef_max_align_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-197"
    },
    {
     "field_name" : "tab",
     "field_offset" : 576,
     "referenced_type" : "type-198"
    }
   ],
   "linker_set_key" : "_ZTI12pow_log_data",
   "name" : "pow_log_data",
   "referenced_type" : "type-196",
   "self_type" : "type-196",
   "size" : 4168,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "_ZTI13float_complex",
   "name" : "float_complex",
   "record_kind" : "union",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-47"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-28"
    }
   ],
   "linker_set_key" : "_ZTI14double_complex",
   "name" : "double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-176"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2048,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "_ZTI14powf_log2_data",
   "name" : "powf_log2_data",
   "referenced_type" : "type-175",
   "self_type" : "type-175",
   "size" : 296,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-18"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-1"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 24,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-51",
   "self_type" : "type-51",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-26",
   "self_type" : "type-26",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-52"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-57",
   "self_type" : "type-57",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-43"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-42",
   "self_type" : "type-42",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "a",
     "referenced_type" : "type-50"
    }
   ],
   "linker_set_key" : "_ZTI19long_double_complex",
   "name" : "long_double_complex",
   "record_kind" : "union",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "parts32",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "parts64",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTI20ieee_quad_shape_type",
   "name" : "ieee_quad_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-8"
    },
    {
     "field_name" : "word",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "_ZTI21ieee_float_shape_type",
   "name" : "ieee_float_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-23",
   "self_type" : "type-23",
   "size" : 4,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "parts",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "xparts",
     "referenced_type" : "type-22"
    }
   ],
   "linker_set_key" : "_ZTI22ieee_double_shape_type",
   "name" : "ieee_double_shape_type",
   "record_kind" : "union",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "_ZTI2dd",
   "name" : "dd",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/s_fma.c"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "_ZTI6Double",
   "name" : "Double",
   "referenced_type" : "type-24",
   "self_type" : "type-24",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/bsdsrc/mathimpl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2N",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "shift",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "negln2hiN",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "negln2loN",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 256,
     "referenced_type" : "type-173"
    },
    {
     "field_name" : "exp2_shift",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "exp2_poly",
     "field_offset" : 576,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "tab",
     "field_offset" : 896,
     "referenced_type" : "type-181"
    }
   ],
   "linker_set_key" : "_ZTI8exp_data",
   "name" : "exp_data",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 2160,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ln2hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "ln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 448,
     "referenced_type" : "type-184"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-185"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 17536,
     "referenced_type" : "type-185"
    }
   ],
   "linker_set_key" : "_ZTI8log_data",
   "name" : "log_data",
   "referenced_type" : "type-183",
   "self_type" : "type-183",
   "size" : 4240,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sign",
     "referenced_type" : "type-173"
    },
    {
     "field_name" : "hpi_inv",
     "field_offset" : 256,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "hpi",
     "field_offset" : 320,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c0",
     "field_offset" : 384,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c1",
     "field_offset" : 448,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c2",
     "field_offset" : 512,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c3",
     "field_offset" : 576,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "c4",
     "field_offset" : 640,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "s1",
     "field_offset" : 704,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "s2",
     "field_offset" : 768,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "s3",
     "field_offset" : 832,
     "referenced_type" : "type-4"
    }
   ],
   "linker_set_key" : "_ZTI8sincos_t",
   "name" : "sincos_t",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 112,
   "source_file" : "/external/arm-optimized-routines/math/sincosf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invln2hi",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "invln2lo",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 128,
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "poly1",
     "field_offset" : 512,
     "referenced_type" : "type-192"
    },
    {
     "field_name" : "tab",
     "field_offset" : 1152,
     "referenced_type" : "type-193"
    },
    {
     "field_name" : "tab2",
     "field_offset" : 9344,
     "referenced_type" : "type-193"
    }
   ],
   "linker_set_key" : "_ZTI9log2_data",
   "name" : "log2_data",
   "referenced_type" : "type-190",
   "self_type" : "type-190",
   "size" : 2192,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tab",
     "referenced_type" : "type-166"
    },
    {
     "field_name" : "ln2",
     "field_offset" : 2048,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "poly",
     "field_offset" : 2112,
     "referenced_type" : "type-169"
    }
   ],
   "linker_set_key" : "_ZTI9logf_data",
   "name" : "logf_data",
   "referenced_type" : "type-168",
   "self_type" : "type-168",
   "size" : 288,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "manl",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "manh",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exp",
     "field_offset" : 52,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign",
     "field_offset" : 63,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10IEEEd2bitsUt_E",
   "name" : "IEEEd2bits::(anonymous struct at bionic/libm/fpmath.h:54:3)",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 8,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "man",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "exp",
     "field_offset" : 23,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "sign",
     "field_offset" : 31,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10IEEEf2bitsUt_E",
   "name" : "IEEEf2bits::(anonymous struct at bionic/libm/fpmath.h:42:3)",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 4,
   "source_file" : "/bionic/libm/fpmath.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10log2f_dataUt_E",
   "name" : "log2f_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:317:3)",
   "referenced_type" : "type-172",
   "self_type" : "type-172",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "pad",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 128,
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logctail",
     "field_offset" : 192,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12pow_log_dataUt_E",
   "name" : "pow_log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:402:3)",
   "referenced_type" : "type-199",
   "self_type" : "type-199",
   "size" : 32,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN14powf_log2_dataUt_E",
   "name" : "powf_log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:334:3)",
   "referenced_type" : "type-177",
   "self_type" : "type-177",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lswlo",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "lswhi",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mswlo",
     "field_offset" : 64,
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "mswhi",
     "field_offset" : 96,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN20ieee_quad_shape_typeUt_E",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:78:3)",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "msw",
     "field_offset" : 64,
     "referenced_type" : "type-14"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN20ieee_quad_shape_typeUt_E",
   "name" : "ieee_quad_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:84:3)",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 16,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lsw",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "msw",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN22ieee_double_shape_typeUt_E",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:115:3)",
   "referenced_type" : "type-21",
   "self_type" : "type-21",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "w",
     "referenced_type" : "type-14"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN22ieee_double_shape_typeUt_E",
   "name" : "ieee_double_shape_type::(anonymous struct at /bionic/libm/upstream-freebsd/lib/msun/bsdsrc/../src/math_private.h:120:3)",
   "referenced_type" : "type-22",
   "self_type" : "type-22",
   "size" : 8,
   "source_file" : "/bionic/libm/upstream-freebsd/lib/msun/src/math_private.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8log_dataUt_E",
   "name" : "log_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:373:3)",
   "referenced_type" : "type-186",
   "self_type" : "type-186",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9log2_dataUt_E",
   "name" : "log2_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:388:3)",
   "referenced_type" : "type-194",
   "self_type" : "type-194",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "invc",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "logc",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9logf_dataUt_E",
   "name" : "logf_data::(anonymous struct at /external/arm-optimized-routines/math/math_config.h:305:3)",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 16,
   "source_file" : "/external/arm-optimized-routines/math/math_config.h"
  }
 ],
 "rvalue_reference_types" : []
}
